RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * AIPS_PACRB - Peripheral Access Control Register
 ******************************************************************************/

/*!
 * @brief AIPS_PACRB - Peripheral Access Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Each peripheral on this chip has a 4-bit PACR field which includes a
 * read-only "lock" bit plus a 3-bit attribute check field which defines the access
 * rights (privileged/user, secure/nonsecure) needed to reference the slave
 * peripheral's address space. Access to these registers is allowed using only 32-bit
 * privileged, secure reads and writes. Each 32-bit register controls eight
 * peripherals. A peripheral's assignment to a PACR field is defined by the memory map slot
 * to which the peripheral is assigned. See this chip's peripheral bridge memory
 * map information for the assignment of a particular peripheral. The following
 * table shows the top-level structure of PACRs. Offset Register [31:28] [27:24]
 * [23:20] [19:16] [15:12] [11:8] [7:4] [3:0] 0x20 PACRA PACR0 PACR1 PACR2 PACR3
 * PACR4 PACR5 PACR6 PACR7 0x24 PACRB PACR8 PACR9 PACR10 PACR11 PACR12 PACR13
 * PACR14 PACR15 The following table defines the attribute check values for each AC
 * field. For access to peripherals that have their own access attribute checks,
 * such as GPIO, refer also to their attributes checks definitions. Attribute
 * check (AC) values AC User nonsecure User secure Privileged secure 0b000
 * Read/Write Read/Write Read/Write 0b001 Read Read/Write Read/Write 0b010 None Read/Write
 * Read/Write 0b011 Read Read Read/Write 0b100 None Read Read/Write 0b101 None
 * None Read/Write 0b110 None None Read 0b111 None None None
 */
/*!
 * @name Constants and macros for entire AIPS_PACRB register
 */
/*@{*/
#define AIPS_RD_PACRB(base)      (AIPS_PACRB_REG(base))
#define AIPS_WR_PACRB(base, value) (AIPS_PACRB_REG(base) = (value))
#define AIPS_RMW_PACRB(base, mask, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~(mask)) | (value)))
#define AIPS_SET_PACRB(base, value) (BME_OR32(&AIPS_PACRB_REG(base), (uint32_t)(value)))
#define AIPS_CLR_PACRB(base, value) (BME_AND32(&AIPS_PACRB_REG(base), (uint32_t)(~(value))))
#define AIPS_TOG_PACRB(base, value) (BME_XOR32(&AIPS_PACRB_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AIPS_PACRB bitfields
 */

/*!
 * @name Register AIPS_PACRB, field AC7[2:0] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_AC7 field. */
#define AIPS_RD_PACRB_AC7(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_AC7_MASK) >> AIPS_PACRB_AC7_SHIFT)
#define AIPS_BRD_PACRB_AC7(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_AC7_SHIFT, AIPS_PACRB_AC7_WIDTH))

/*! @brief Set the AC7 field to a new value. */
#define AIPS_WR_PACRB_AC7(base, value) (AIPS_RMW_PACRB(base, AIPS_PACRB_AC7_MASK, AIPS_PACRB_AC7(value)))
#define AIPS_BWR_PACRB_AC7(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_AC7_SHIFT), AIPS_PACRB_AC7_SHIFT, AIPS_PACRB_AC7_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field RO7[3] (RW)
 *
 * Indicates the lock status of this register's AC7 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC7 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0b0 - Writes to corresponding AC field are allowed.
 * - 0b1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_RO7 field. */
#define AIPS_RD_PACRB_RO7(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_RO7_MASK) >> AIPS_PACRB_RO7_SHIFT)
#define AIPS_BRD_PACRB_RO7(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_RO7_SHIFT, AIPS_PACRB_RO7_WIDTH))

/*! @brief Set the RO7 field to a new value. */
#define AIPS_WR_PACRB_RO7(base, value) (AIPS_RMW_PACRB(base, AIPS_PACRB_RO7_MASK, AIPS_PACRB_RO7(value)))
#define AIPS_BWR_PACRB_RO7(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_RO7_SHIFT), AIPS_PACRB_RO7_SHIFT, AIPS_PACRB_RO7_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field AC6[6:4] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_AC6 field. */
#define AIPS_RD_PACRB_AC6(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_AC6_MASK) >> AIPS_PACRB_AC6_SHIFT)
#define AIPS_BRD_PACRB_AC6(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_AC6_SHIFT, AIPS_PACRB_AC6_WIDTH))

/*! @brief Set the AC6 field to a new value. */
#define AIPS_WR_PACRB_AC6(base, value) (AIPS_RMW_PACRB(base, AIPS_PACRB_AC6_MASK, AIPS_PACRB_AC6(value)))
#define AIPS_BWR_PACRB_AC6(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_AC6_SHIFT), AIPS_PACRB_AC6_SHIFT, AIPS_PACRB_AC6_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field RO6[7] (RW)
 *
 * Indicates the lock status of this register's AC6 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC6 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0b0 - Writes to corresponding AC field are allowed.
 * - 0b1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_RO6 field. */
#define AIPS_RD_PACRB_RO6(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_RO6_MASK) >> AIPS_PACRB_RO6_SHIFT)
#define AIPS_BRD_PACRB_RO6(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_RO6_SHIFT, AIPS_PACRB_RO6_WIDTH))

/*! @brief Set the RO6 field to a new value. */
#define AIPS_WR_PACRB_RO6(base, value) (AIPS_RMW_PACRB(base, AIPS_PACRB_RO6_MASK, AIPS_PACRB_RO6(value)))
#define AIPS_BWR_PACRB_RO6(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_RO6_SHIFT), AIPS_PACRB_RO6_SHIFT, AIPS_PACRB_RO6_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field AC5[10:8] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_AC5 field. */
#define AIPS_RD_PACRB_AC5(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_AC5_MASK) >> AIPS_PACRB_AC5_SHIFT)
#define AIPS_BRD_PACRB_AC5(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_AC5_SHIFT, AIPS_PACRB_AC5_WIDTH))

