RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*
 * MKM34Z7 GPIO
 *
 * General Purpose Input/Output
 *
 * Registers defined in this header file:
 * - GPIO_PDOR - Port Data Output Register
 * - GPIO_PSOR - Port Set Output Register
 * - GPIO_PCOR - Port Clear Output Register
 * - GPIO_PTOR - Port Toggle Output Register
 * - GPIO_PDIR - Port Data Input Register
 * - GPIO_PDDR - Port Data Direction Register
 * - GPIO_GACR - GPIO Attribute Checker Register
 */

#define GPIO_INSTANCE_COUNT (13U) /*!< Number of instances of the GPIO module. */
#define GPIOA_IDX (0U) /*!< Instance number for GPIOA. */
#define GPIOB_IDX (1U) /*!< Instance number for GPIOB. */
#define GPIOC_IDX (2U) /*!< Instance number for GPIOC. */
#define GPIOD_IDX (3U) /*!< Instance number for GPIOD. */
#define GPIOE_IDX (4U) /*!< Instance number for GPIOE. */
#define GPIOF_IDX (5U) /*!< Instance number for GPIOF. */
#define GPIOG_IDX (6U) /*!< Instance number for GPIOG. */
#define GPIOH_IDX (7U) /*!< Instance number for GPIOH. */
#define GPIOI_IDX (8U) /*!< Instance number for GPIOI. */
#define GPIOJ_IDX (9U) /*!< Instance number for GPIOJ. */
#define GPIOK_IDX (10U) /*!< Instance number for GPIOK. */
#define GPIOL_IDX (11U) /*!< Instance number for GPIOL. */
#define GPIOM_IDX (12U) /*!< Instance number for GPIOM. */

/*******************************************************************************
 * GPIO_PDOR - Port Data Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDOR - Port Data Output Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register configures the logic levels that are driven on each
 * general-purpose output pins. Do not modify pin configuration registers associated with
 * pins not available in your selected package. All un-bonded pins not available in
 * your package will default to DISABLE state for lowest power consumption.
 */
/*!
 * @name Constants and macros for entire GPIO_PDOR register
 */
/*@{*/
#define GPIO_RD_PDOR(base)       (GPIO_PDOR_REG(base))
#define GPIO_WR_PDOR(base, value) (GPIO_PDOR_REG(base) = (value))
#define GPIO_RMW_PDOR(base, mask, value) (GPIO_WR_PDOR(base, (GPIO_RD_PDOR(base) & ~(mask)) | (value)))
#define GPIO_SET_PDOR(base, value) (BME_OR8(&GPIO_PDOR_REG(base), (uint8_t)(value)))
#define GPIO_CLR_PDOR(base, value) (BME_AND8(&GPIO_PDOR_REG(base), (uint8_t)(~(value))))
#define GPIO_TOG_PDOR(base, value) (BME_XOR8(&GPIO_PDOR_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * GPIO_PSOR - Port Set Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PSOR - Port Set Output Register (WORZ)
 *
 * Reset value: 0x00U
 *
 * This register configures whether to set the fields of the PDOR.
 */
/*!
 * @name Constants and macros for entire GPIO_PSOR register
 */
/*@{*/
#define GPIO_RD_PSOR(base)       (GPIO_PSOR_REG(base))
#define GPIO_WR_PSOR(base, value) (GPIO_PSOR_REG(base) = (value))
#define GPIO_RMW_PSOR(base, mask, value) (GPIO_WR_PSOR(base, (GPIO_RD_PSOR(base) & ~(mask)) | (value)))
/*@}*/

/*******************************************************************************
 * GPIO_PCOR - Port Clear Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PCOR - Port Clear Output Register (WORZ)
 *
 * Reset value: 0x00U
 *
 * This register configures whether to clear the fields of PDOR.
 */
/*!
 * @name Constants and macros for entire GPIO_PCOR register
 */
/*@{*/
#define GPIO_RD_PCOR(base)       (GPIO_PCOR_REG(base))
#define GPIO_WR_PCOR(base, value) (GPIO_PCOR_REG(base) = (value))
#define GPIO_RMW_PCOR(base, mask, value) (GPIO_WR_PCOR(base, (GPIO_RD_PCOR(base) & ~(mask)) | (value)))
/*@}*/

/*******************************************************************************
 * GPIO_PTOR - Port Toggle Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PTOR - Port Toggle Output Register (WORZ)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire GPIO_PTOR register
 */
/*@{*/
#define GPIO_RD_PTOR(base)       (GPIO_PTOR_REG(base))
#define GPIO_WR_PTOR(base, value) (GPIO_PTOR_REG(base) = (value))
#define GPIO_RMW_PTOR(base, mask, value) (GPIO_WR_PTOR(base, (GPIO_RD_PTOR(base) & ~(mask)) | (value)))
/*@}*/

/*******************************************************************************
 * GPIO_PDIR - Port Data Input Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDIR - Port Data Input Register (RO)
 *
 * Reset value: 0x00U
 *
 * Do not modify pin configuration registers associated with pins not available
 * in your selected package. All un-bonded pins not available in your package
 * will default to DISABLE state for lowest power consumption.
 */
/*!
 * @name Constants and macros for entire GPIO_PDIR register
 */
/*@{*/
#define GPIO_RD_PDIR(base)       (GPIO_PDIR_REG(base))
/*@}*/

/*******************************************************************************
 * GPIO_PDDR - Port Data Direction Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDDR - Port Data Direction Register (RW)
 *
 * Reset value: 0x00U
 *
 * The PDDR configures the individual port pins for input or output.
 */
/*!
 * @name Constants and macros for entire GPIO_PDDR register
 */
/*@{*/
#define GPIO_RD_PDDR(base)       (GPIO_PDDR_REG(base))
#define GPIO_WR_PDDR(base, value) (GPIO_PDDR_REG(base) = (value))
#define GPIO_RMW_PDDR(base, mask, value) (GPIO_WR_PDDR(base, (GPIO_RD_PDDR(base) & ~(mask)) | (value)))
#define GPIO_SET_PDDR(base, value) (BME_OR8(&GPIO_PDDR_REG(base), (uint8_t)(value)))
#define GPIO_CLR_PDDR(base, value) (BME_AND8(&GPIO_PDDR_REG(base), (uint8_t)(~(value))))
#define GPIO_TOG_PDDR(base, value) (BME_XOR8(&GPIO_PDDR_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * GPIO_GACR - GPIO Attribute Checker Register
 ******************************************************************************/

/*!
 * @brief GPIO_GACR - GPIO Attribute Checker Register (RW)
 *
 * Reset value: 0x00U
 *
 * The GPIO module supports a device-specific number of data ports GPIO supports
 * single-cycle accesses from the processor core IOPORT bus as well as
 * references from the PBRIDGE-mapped address space. Since the core's IOPORT does not
 * support any type of bus stalls or error terminations, if an IOPORT access fails
 * the attribute checks, it is treated as a RAZ/WI access, that is, reads-as-zero
 * and writes ignored. GPIO GACRn register is checked for PBRDIGE accesses only if
 * the corresponding PACRn register allowed the reference. The appropriate PACRn
 * controls access rights to the entire GPIO address space, while the GACRn
 * registers define the access rights down to the byte level for the actual data
 * ports.
 */
/*!
 * @name Constants and macros for entire GPIO_GACR register
 */
/*@{*/
#define GPIO_RD_GACR(base)       (GPIO_GACR_REG(base))
#define GPIO_WR_GACR(base, value) (GPIO_GACR_REG(base) = (value))
#define GPIO_RMW_GACR(base, mask, value) (GPIO_WR_GACR(base, (GPIO_RD_GACR(base) & ~(mask)) | (value)))
#define GPIO_SET_GACR(base, value) (BME_OR8(&GPIO_GACR_REG(base), (uint8_t)(value)))
#define GPIO_CLR_GACR(base, value) (BME_AND8(&GPIO_GACR_REG(base), (uint8_t)(~(value))))
#define GPIO_TOG_GACR(base, value) (BME_XOR8(&GPIO_GACR_REG(base), (uint8_t)(value)))
/*@}*/

