RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*
 * Constants & macros for individual I2C_S2 bitfields
 */

/*!
 * @name Register I2C_S2, field EMPTY[0] (RO)
 *
 * Indicates if the Tx or Rx buffer is empty.
 *
 * Values:
 * - 0b0 - Tx or Rx buffer is not empty and cannot be written to, that is new
 *     data cannot be loaded into the buffer.
 * - 0b1 - Tx or Rx buffer is empty and can be written to, that is new data can
 *     be loaded into the buffer.
 */
/*@{*/
/*! @brief Read current value of the I2C_S2_EMPTY field. */
#define I2C_RD_S2_EMPTY(base) ((I2C_S2_REG(base) & I2C_S2_EMPTY_MASK) >> I2C_S2_EMPTY_SHIFT)
#define I2C_BRD_S2_EMPTY(base) (BME_UBFX8(&I2C_S2_REG(base), I2C_S2_EMPTY_SHIFT, I2C_S2_EMPTY_WIDTH))
/*@}*/

/*!
 * @name Register I2C_S2, field ERROR[1] (W1C)
 *
 * Indicates if there are read or write errors with the Tx and Rx buffers.
 *
 * Values:
 * - 0b0 - The buffer is not full and all write/read operations have no errors.
 * - 0b1 - There are 3 or more write/read errors during the data transfer phase
 *     (when the Empty flag is not set and the buffer is busy).
 */
/*@{*/
/*! @brief Read current value of the I2C_S2_ERROR field. */
#define I2C_RD_S2_ERROR(base) ((I2C_S2_REG(base) & I2C_S2_ERROR_MASK) >> I2C_S2_ERROR_SHIFT)
#define I2C_BRD_S2_ERROR(base) (BME_UBFX8(&I2C_S2_REG(base), I2C_S2_ERROR_SHIFT, I2C_S2_ERROR_WIDTH))

/*! @brief Set the ERROR field to a new value. */
#define I2C_WR_S2_ERROR(base, value) (I2C_RMW_S2(base, I2C_S2_ERROR_MASK, I2C_S2_ERROR(value)))
#define I2C_BWR_S2_ERROR(base, value) (BME_BFI8(&I2C_S2_REG(base), ((uint8_t)(value) << I2C_S2_ERROR_SHIFT), I2C_S2_ERROR_SHIFT, I2C_S2_ERROR_WIDTH))
/*@}*/

/*
 * MKM34Z7 LCD
 *
 * Segment Liquid Crystal Display
 *
 * Registers defined in this header file:
 * - LCD_GCR - LCD General Control Register
 * - LCD_AR - LCD Auxiliary Register
 * - LCD_FDCR - LCD Fault Detect Control Register
 * - LCD_FDSR - LCD Fault Detect Status Register
 * - LCD_PEN - LCD Pin Enable register
 * - LCD_BPEN - LCD Back Plane Enable register
 * - LCD_WF - LCD Waveform register
 * - LCD_WF8B - LCD Waveform Register 0.
 */

#define LCD_INSTANCE_COUNT (1U) /*!< Number of instances of the LCD module. */
#define LCD_IDX (0U) /*!< Instance number for LCD. */

/*******************************************************************************
 * LCD_GCR - LCD General Control Register
 ******************************************************************************/

/*!
 * @brief LCD_GCR - LCD General Control Register (RW)
 *
 * Reset value: 0x08300003U
 *
 * Write: LCDEN anytime. Do not change SOURCE, LCLK, or DUTY while LCDEN = 1.
 * For proper operation, do not modify VSUPPLY while the LCDEN bit is asserted.
 * VSUPPLY must also be configured according to the external hardware power supply
 * configuration. The reset value of this register depends on the reset type: POR
 * -- 0x0830_0003
 */
/*!
 * @name Constants and macros for entire LCD_GCR register
 */
/*@{*/
#define LCD_RD_GCR(base)         (LCD_GCR_REG(base))
#define LCD_WR_GCR(base, value)  (LCD_GCR_REG(base) = (value))
#define LCD_RMW_GCR(base, mask, value) (LCD_WR_GCR(base, (LCD_RD_GCR(base) & ~(mask)) | (value)))
#define LCD_SET_GCR(base, value) (BME_OR32(&LCD_GCR_REG(base), (uint32_t)(value)))
#define LCD_CLR_GCR(base, value) (BME_AND32(&LCD_GCR_REG(base), (uint32_t)(~(value))))
#define LCD_TOG_GCR(base, value) (BME_XOR32(&LCD_GCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LCD_GCR bitfields
 */

/*!
 * @name Register LCD_GCR, field DUTY[2:0] (RW)
 *
 * Selects the duty cycle of the LCD controller driver.
 *
 * Values:
 * - 0b000 - Use 1 BP (1/1 duty cycle).
 * - 0b001 - Use 2 BP (1/2 duty cycle).
 * - 0b010 - Use 3 BP (1/3 duty cycle).
 * - 0b011 - Use 4 BP (1/4 duty cycle). (Default)
 * - 0b100 - Use 5 BP (1/5 duty cycle).
 * - 0b101 - Use 6 BP (1/6 duty cycle).
 * - 0b110 - Use 7 BP (1/7 duty cycle).
 * - 0b111 - Use 8 BP (1/8 duty cycle).
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_DUTY field. */
#define LCD_RD_GCR_DUTY(base) ((LCD_GCR_REG(base) & LCD_GCR_DUTY_MASK) >> LCD_GCR_DUTY_SHIFT)
#define LCD_BRD_GCR_DUTY(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_DUTY_SHIFT, LCD_GCR_DUTY_WIDTH))

/*! @brief Set the DUTY field to a new value. */
#define LCD_WR_GCR_DUTY(base, value) (LCD_RMW_GCR(base, LCD_GCR_DUTY_MASK, LCD_GCR_DUTY(value)))
#define LCD_BWR_GCR_DUTY(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_DUTY_SHIFT), LCD_GCR_DUTY_SHIFT, LCD_GCR_DUTY_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCLK[5:3] (RW)
 *
 * Used as a clock divider to generate the SLCD frame frequency. LCD controller
 * duty cycle configuration is used to determine the LCD controller frame
 * frequency. LCD controller frame frequency calculations are provided in SLCD base
 * clock and frame frequency . LCD controller frame frequency = LCD clock/((DUTY + 1)
 * * 8 * (4 + LCLK[2:0]) * Y) where: 30 < LCD clock < 39.063 kHz Y = 2, 2, 3, 3,
 * 4, 5, 8, 16 chosen by module duty cycle configuration
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCLK field. */
#define LCD_RD_GCR_LCLK(base) ((LCD_GCR_REG(base) & LCD_GCR_LCLK_MASK) >> LCD_GCR_LCLK_SHIFT)
#define LCD_BRD_GCR_LCLK(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_LCLK_SHIFT, LCD_GCR_LCLK_WIDTH))

/*! @brief Set the LCLK field to a new value. */
#define LCD_WR_GCR_LCLK(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCLK_MASK, LCD_GCR_LCLK(value)))
#define LCD_BWR_GCR_LCLK(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCLK_SHIFT), LCD_GCR_LCLK_SHIFT, LCD_GCR_LCLK_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field SOURCE[6] (RW)
 *
 * The LCD controller has two possible clock sources. This bit is used to select
 * which clock source is the basis for LCD clock. The clock sources are
 * chip-specific. For the clock source assignments, see the chapter that describes how
 * modules are configured. Alternate clock can be only MCGIRCLK, and therefore when
 * SOURCE=1, SIM_SOPT1[OSC32KSEL] bit plays no role. Default clock can be either
 * MCGIRCLK, ERCLK32K, OSC32KCLK, according to the selection in
 * SIM_SOPT1[OSC32KSEL].
 *
 * Values:
 * - 0b0 - Selects the default clock as the LCD clock source.
 * - 0b1 - Selects the alternate clock as the LCD clock source.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_SOURCE field. */
#define LCD_RD_GCR_SOURCE(base) ((LCD_GCR_REG(base) & LCD_GCR_SOURCE_MASK) >> LCD_GCR_SOURCE_SHIFT)
#define LCD_BRD_GCR_SOURCE(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_SOURCE_SHIFT, LCD_GCR_SOURCE_WIDTH))

/*! @brief Set the SOURCE field to a new value. */
#define LCD_WR_GCR_SOURCE(base, value) (LCD_RMW_GCR(base, LCD_GCR_SOURCE_MASK, LCD_GCR_SOURCE(value)))
#define LCD_BWR_GCR_SOURCE(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_SOURCE_SHIFT), LCD_GCR_SOURCE_SHIFT, LCD_GCR_SOURCE_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDEN[7] (RW)
 *
 * Starts LCD controller waveform generator.
 *
 * Values:
 * - 0b0 - All front plane and back plane pins are disabled. The LCD controller
 *     system is also disabled, and all LCD waveform generation clocks are
 *     stopped. V LL3 is connected to V DD internally.
 * - 0b1 - LCD controller driver system is enabled, and front plane and back
 *     plane waveforms are generated. All LCD pins, LCD_Pn, enabled using the LCD
 *     Pin Enable register, output an LCD driver waveform. The back plane pins
 *     output an LCD driver back plane waveform based on the settings of DUTY[2:0].
 *     Charge pump or resistor bias is enabled.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDEN field. */
#define LCD_RD_GCR_LCDEN(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDEN_MASK) >> LCD_GCR_LCDEN_SHIFT)
#define LCD_BRD_GCR_LCDEN(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_LCDEN_SHIFT, LCD_GCR_LCDEN_WIDTH))

/*! @brief Set the LCDEN field to a new value. */
#define LCD_WR_GCR_LCDEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDEN_MASK, LCD_GCR_LCDEN(value)))
#define LCD_BWR_GCR_LCDEN(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCDEN_SHIFT), LCD_GCR_LCDEN_SHIFT, LCD_GCR_LCDEN_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDSTP[8] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Stop mode.
 *
 * Values:
 * - 0b0 - Allows the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator to continue running during Stop mode.
 * - 0b1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Stop mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDSTP field. */
#define LCD_RD_GCR_LCDSTP(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDSTP_MASK) >> LCD_GCR_LCDSTP_SHIFT)
#define LCD_BRD_GCR_LCDSTP(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_LCDSTP_SHIFT, LCD_GCR_LCDSTP_WIDTH))

/*! @brief Set the LCDSTP field to a new value. */
#define LCD_WR_GCR_LCDSTP(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDSTP_MASK, LCD_GCR_LCDSTP(value)))
#define LCD_BWR_GCR_LCDSTP(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCDSTP_SHIFT), LCD_GCR_LCDSTP_SHIFT, LCD_GCR_LCDSTP_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDDOZE[9] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Doze mode.
 *
 * Values:
 * - 0b0 - Allows the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator to continue running during Doze mode.
 * - 0b1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Doze mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDDOZE field. */
#define LCD_RD_GCR_LCDDOZE(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDDOZE_MASK) >> LCD_GCR_LCDDOZE_SHIFT)
#define LCD_BRD_GCR_LCDDOZE(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_LCDDOZE_SHIFT, LCD_GCR_LCDDOZE_WIDTH))

/*! @brief Set the LCDDOZE field to a new value. */
#define LCD_WR_GCR_LCDDOZE(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDDOZE_MASK, LCD_GCR_LCDDOZE(value)))
#define LCD_BWR_GCR_LCDDOZE(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCDDOZE_SHIFT), LCD_GCR_LCDDOZE_SHIFT, LCD_GCR_LCDDOZE_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field ALTDIV[13:12] (RW)
 *
 * Functions as a clock divider to divide the alternate clock before it is
 * selected as LCD clock source.
 *
 * Values:
 * - 0b00 - Divide factor = 1 (No divide)
 * - 0b01 - Divide factor = 64
 * - 0b10 - Divide factor = 256
 * - 0b11 - Divide factor = 512
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_ALTDIV field. */
#define LCD_RD_GCR_ALTDIV(base) ((LCD_GCR_REG(base) & LCD_GCR_ALTDIV_MASK) >> LCD_GCR_ALTDIV_SHIFT)
#define LCD_BRD_GCR_ALTDIV(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_ALTDIV_SHIFT, LCD_GCR_ALTDIV_WIDTH))

/*! @brief Set the ALTDIV field to a new value. */
#define LCD_WR_GCR_ALTDIV(base, value) (LCD_RMW_GCR(base, LCD_GCR_ALTDIV_MASK, LCD_GCR_ALTDIV(value)))
#define LCD_BWR_GCR_ALTDIV(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_ALTDIV_SHIFT), LCD_GCR_ALTDIV_SHIFT, LCD_GCR_ALTDIV_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field FDCIEN[14] (RW)
 *
 * Enables an LCD interrupt event when fault detection is completed.
 *
 * Values:
 * - 0b0 - No interrupt request is generated by this event.
 * - 0b1 - When a fault is detected and FDCF bit is set, this event causes an
 *     interrupt request.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_FDCIEN field. */
#define LCD_RD_GCR_FDCIEN(base) ((LCD_GCR_REG(base) & LCD_GCR_FDCIEN_MASK) >> LCD_GCR_FDCIEN_SHIFT)
#define LCD_BRD_GCR_FDCIEN(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_FDCIEN_SHIFT, LCD_GCR_FDCIEN_WIDTH))

/*! @brief Set the FDCIEN field to a new value. */
#define LCD_WR_GCR_FDCIEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_FDCIEN_MASK, LCD_GCR_FDCIEN(value)))
#define LCD_BWR_GCR_FDCIEN(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_FDCIEN_SHIFT), LCD_GCR_FDCIEN_SHIFT, LCD_GCR_FDCIEN_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDIEN[15] (RW)
 *
 * Enables an LCD interrupt event that coincides with the LCD controller frame
 * frequency.
 *
 * Values:
 * - 0b0 - No interrupt request is generated by this event.
 * - 0b1 - When LCDIF bit is set, this event causes an interrupt request.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDIEN field. */
#define LCD_RD_GCR_LCDIEN(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDIEN_MASK) >> LCD_GCR_LCDIEN_SHIFT)
#define LCD_BRD_GCR_LCDIEN(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_LCDIEN_SHIFT, LCD_GCR_LCDIEN_WIDTH))

/*! @brief Set the LCDIEN field to a new value. */
#define LCD_WR_GCR_LCDIEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDIEN_MASK, LCD_GCR_LCDIEN(value)))
#define LCD_BWR_GCR_LCDIEN(base, value) (BME_BFI32(&LCD_GCR_REG(base), ((uint32_t)(value) << LCD_GCR_LCDIEN_SHIFT), LCD_GCR_LCDIEN_SHIFT, LCD_GCR_LCDIEN_WIDTH))
/*@}*/

/*!
 * @name Register LCD_GCR, field VSUPPLY[17] (RW)
 *
 * Configures whether the LCD controller power supply is external or internal.
 * Avoid modifying this field while the LCD controller is enabled, for example, if
 * LCDEN = 1.
 *
 * Values:
 * - 0b0 - Drive VLL3 internally from VDD
 * - 0b1 - Drive VLL3 externally from VDD or drive VLL1 internally from vIREG
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_VSUPPLY field. */
#define LCD_RD_GCR_VSUPPLY(base) ((LCD_GCR_REG(base) & LCD_GCR_VSUPPLY_MASK) >> LCD_GCR_VSUPPLY_SHIFT)
#define LCD_BRD_GCR_VSUPPLY(base) (BME_UBFX32(&LCD_GCR_REG(base), LCD_GCR_VSUPPLY_SHIFT, LCD_GCR_VSUPPLY_WIDTH))

