RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the WF21 field to a new value. */
#define LCD_WR_WF_WF21(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF21_MASK, LCD_WF_WF21(value)))
#define LCD_BWR_WF_WF21(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF21_SHIFT), LCD_WF_WF21_SHIFT, LCD_WF_WF21_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF26[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P26 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF26 field. */
#define LCD_RD_WF_WF26(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF26_MASK) >> LCD_WF_WF26_SHIFT)
#define LCD_BRD_WF_WF26(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF26_SHIFT, LCD_WF_WF26_WIDTH))

/*! @brief Set the WF26 field to a new value. */
#define LCD_WR_WF_WF26(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF26_MASK, LCD_WF_WF26(value)))
#define LCD_BWR_WF_WF26(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF26_SHIFT), LCD_WF_WF26_SHIFT, LCD_WF_WF26_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF46[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P46 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF46 field. */
#define LCD_RD_WF_WF46(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF46_MASK) >> LCD_WF_WF46_SHIFT)
#define LCD_BRD_WF_WF46(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF46_SHIFT, LCD_WF_WF46_WIDTH))

/*! @brief Set the WF46 field to a new value. */
#define LCD_WR_WF_WF46(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF46_MASK, LCD_WF_WF46(value)))
#define LCD_BWR_WF_WF46(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF46_SHIFT), LCD_WF_WF46_SHIFT, LCD_WF_WF46_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF6[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P6 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF6 field. */
#define LCD_RD_WF_WF6(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF6_MASK) >> LCD_WF_WF6_SHIFT)
#define LCD_BRD_WF_WF6(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF6_SHIFT, LCD_WF_WF6_WIDTH))

/*! @brief Set the WF6 field to a new value. */
#define LCD_WR_WF_WF6(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF6_MASK, LCD_WF_WF6(value)))
#define LCD_BWR_WF_WF6(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF6_SHIFT), LCD_WF_WF6_SHIFT, LCD_WF_WF6_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF42[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P42 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF42 field. */
#define LCD_RD_WF_WF42(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF42_MASK) >> LCD_WF_WF42_SHIFT)
#define LCD_BRD_WF_WF42(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF42_SHIFT, LCD_WF_WF42_WIDTH))

/*! @brief Set the WF42 field to a new value. */
#define LCD_WR_WF_WF42(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF42_MASK, LCD_WF_WF42(value)))
#define LCD_BWR_WF_WF42(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF42_SHIFT), LCD_WF_WF42_SHIFT, LCD_WF_WF42_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF18[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P18 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF18 field. */
#define LCD_RD_WF_WF18(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF18_MASK) >> LCD_WF_WF18_SHIFT)
#define LCD_BRD_WF_WF18(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF18_SHIFT, LCD_WF_WF18_WIDTH))

/*! @brief Set the WF18 field to a new value. */
#define LCD_WR_WF_WF18(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF18_MASK, LCD_WF_WF18(value)))
#define LCD_BWR_WF_WF18(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF18_SHIFT), LCD_WF_WF18_SHIFT, LCD_WF_WF18_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF38[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P38 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF38 field. */
#define LCD_RD_WF_WF38(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF38_MASK) >> LCD_WF_WF38_SHIFT)
#define LCD_BRD_WF_WF38(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF38_SHIFT, LCD_WF_WF38_WIDTH))

/*! @brief Set the WF38 field to a new value. */
#define LCD_WR_WF_WF38(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF38_MASK, LCD_WF_WF38(value)))
#define LCD_BWR_WF_WF38(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF38_SHIFT), LCD_WF_WF38_SHIFT, LCD_WF_WF38_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF22[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P22 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF22 field. */
#define LCD_RD_WF_WF22(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF22_MASK) >> LCD_WF_WF22_SHIFT)
#define LCD_BRD_WF_WF22(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF22_SHIFT, LCD_WF_WF22_WIDTH))

/*! @brief Set the WF22 field to a new value. */
#define LCD_WR_WF_WF22(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF22_MASK, LCD_WF_WF22(value)))
#define LCD_BWR_WF_WF22(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF22_SHIFT), LCD_WF_WF22_SHIFT, LCD_WF_WF22_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF34[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P34 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF34 field. */
#define LCD_RD_WF_WF34(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF34_MASK) >> LCD_WF_WF34_SHIFT)
#define LCD_BRD_WF_WF34(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF34_SHIFT, LCD_WF_WF34_WIDTH))

