RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the BPALCD57 field to a new value. */
#define LCD_WR_WF8B_BPALCD57(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD57_MASK, LCD_WF8B_BPALCD57(value)))
#define LCD_BWR_WF8B_BPALCD57(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD57_SHIFT), LCD_WF8B_BPALCD57_SHIFT, LCD_WF8B_BPALCD57_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD1[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD1 field. */
#define LCD_RD_WF8B_BPALCD1(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD1_MASK) >> LCD_WF8B_BPALCD1_SHIFT)
#define LCD_BRD_WF8B_BPALCD1(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD1_SHIFT, LCD_WF8B_BPALCD1_WIDTH))

/*! @brief Set the BPALCD1 field to a new value. */
#define LCD_WR_WF8B_BPALCD1(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD1_MASK, LCD_WF8B_BPALCD1(value)))
#define LCD_BWR_WF8B_BPALCD1(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD1_SHIFT), LCD_WF8B_BPALCD1_SHIFT, LCD_WF8B_BPALCD1_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD56[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD56 field. */
#define LCD_RD_WF8B_BPALCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD56_MASK) >> LCD_WF8B_BPALCD56_SHIFT)
#define LCD_BRD_WF8B_BPALCD56(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD56_SHIFT, LCD_WF8B_BPALCD56_WIDTH))

/*! @brief Set the BPALCD56 field to a new value. */
#define LCD_WR_WF8B_BPALCD56(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD56_MASK, LCD_WF8B_BPALCD56(value)))
#define LCD_BWR_WF8B_BPALCD56(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD56_SHIFT), LCD_WF8B_BPALCD56_SHIFT, LCD_WF8B_BPALCD56_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD55[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD55 field. */
#define LCD_RD_WF8B_BPALCD55(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD55_MASK) >> LCD_WF8B_BPALCD55_SHIFT)
#define LCD_BRD_WF8B_BPALCD55(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD55_SHIFT, LCD_WF8B_BPALCD55_WIDTH))

/*! @brief Set the BPALCD55 field to a new value. */
#define LCD_WR_WF8B_BPALCD55(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD55_MASK, LCD_WF8B_BPALCD55(value)))
#define LCD_BWR_WF8B_BPALCD55(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD55_SHIFT), LCD_WF8B_BPALCD55_SHIFT, LCD_WF8B_BPALCD55_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD54[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD54 field. */
#define LCD_RD_WF8B_BPALCD54(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD54_MASK) >> LCD_WF8B_BPALCD54_SHIFT)
#define LCD_BRD_WF8B_BPALCD54(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD54_SHIFT, LCD_WF8B_BPALCD54_WIDTH))

/*! @brief Set the BPALCD54 field to a new value. */
#define LCD_WR_WF8B_BPALCD54(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD54_MASK, LCD_WF8B_BPALCD54(value)))
#define LCD_BWR_WF8B_BPALCD54(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD54_SHIFT), LCD_WF8B_BPALCD54_SHIFT, LCD_WF8B_BPALCD54_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD53[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD53 field. */
#define LCD_RD_WF8B_BPALCD53(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD53_MASK) >> LCD_WF8B_BPALCD53_SHIFT)
#define LCD_BRD_WF8B_BPALCD53(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD53_SHIFT, LCD_WF8B_BPALCD53_WIDTH))

/*! @brief Set the BPALCD53 field to a new value. */
#define LCD_WR_WF8B_BPALCD53(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD53_MASK, LCD_WF8B_BPALCD53(value)))
#define LCD_BWR_WF8B_BPALCD53(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD53_SHIFT), LCD_WF8B_BPALCD53_SHIFT, LCD_WF8B_BPALCD53_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD52[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD52 field. */
#define LCD_RD_WF8B_BPALCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD52_MASK) >> LCD_WF8B_BPALCD52_SHIFT)
#define LCD_BRD_WF8B_BPALCD52(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD52_SHIFT, LCD_WF8B_BPALCD52_WIDTH))

/*! @brief Set the BPALCD52 field to a new value. */
#define LCD_WR_WF8B_BPALCD52(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD52_MASK, LCD_WF8B_BPALCD52(value)))
#define LCD_BWR_WF8B_BPALCD52(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD52_SHIFT), LCD_WF8B_BPALCD52_SHIFT, LCD_WF8B_BPALCD52_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD51[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD51 field. */
#define LCD_RD_WF8B_BPALCD51(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD51_MASK) >> LCD_WF8B_BPALCD51_SHIFT)
#define LCD_BRD_WF8B_BPALCD51(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD51_SHIFT, LCD_WF8B_BPALCD51_WIDTH))

/*! @brief Set the BPALCD51 field to a new value. */
#define LCD_WR_WF8B_BPALCD51(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD51_MASK, LCD_WF8B_BPALCD51(value)))
#define LCD_BWR_WF8B_BPALCD51(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD51_SHIFT), LCD_WF8B_BPALCD51_SHIFT, LCD_WF8B_BPALCD51_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD50[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD50 field. */
#define LCD_RD_WF8B_BPALCD50(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD50_MASK) >> LCD_WF8B_BPALCD50_SHIFT)
#define LCD_BRD_WF8B_BPALCD50(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD50_SHIFT, LCD_WF8B_BPALCD50_WIDTH))

/*! @brief Set the BPALCD50 field to a new value. */
#define LCD_WR_WF8B_BPALCD50(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD50_MASK, LCD_WF8B_BPALCD50(value)))
#define LCD_BWR_WF8B_BPALCD50(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD50_SHIFT), LCD_WF8B_BPALCD50_SHIFT, LCD_WF8B_BPALCD50_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD2[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD2 field. */
#define LCD_RD_WF8B_BPALCD2(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD2_MASK) >> LCD_WF8B_BPALCD2_SHIFT)
#define LCD_BRD_WF8B_BPALCD2(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD2_SHIFT, LCD_WF8B_BPALCD2_WIDTH))

/*! @brief Set the BPALCD2 field to a new value. */
#define LCD_WR_WF8B_BPALCD2(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD2_MASK, LCD_WF8B_BPALCD2(value)))
#define LCD_BWR_WF8B_BPALCD2(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPALCD2_SHIFT), LCD_WF8B_BPALCD2_SHIFT, LCD_WF8B_BPALCD2_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD49[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD49 field. */
#define LCD_RD_WF8B_BPALCD49(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD49_MASK) >> LCD_WF8B_BPALCD49_SHIFT)
#define LCD_BRD_WF8B_BPALCD49(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD49_SHIFT, LCD_WF8B_BPALCD49_WIDTH))

