RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the BPELCD28 field to a new value. */
#define LCD_WR_WF8B_BPELCD28(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD28_MASK, LCD_WF8B_BPELCD28(value)))
#define LCD_BWR_WF8B_BPELCD28(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD28_SHIFT), LCD_WF8B_BPELCD28_SHIFT, LCD_WF8B_BPELCD28_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD2[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD2 field. */
#define LCD_RD_WF8B_BPELCD2(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD2_MASK) >> LCD_WF8B_BPELCD2_SHIFT)
#define LCD_BRD_WF8B_BPELCD2(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD2_SHIFT, LCD_WF8B_BPELCD2_WIDTH))

/*! @brief Set the BPELCD2 field to a new value. */
#define LCD_WR_WF8B_BPELCD2(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD2_MASK, LCD_WF8B_BPELCD2(value)))
#define LCD_BWR_WF8B_BPELCD2(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD2_SHIFT), LCD_WF8B_BPELCD2_SHIFT, LCD_WF8B_BPELCD2_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD27[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD27 field. */
#define LCD_RD_WF8B_BPELCD27(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD27_MASK) >> LCD_WF8B_BPELCD27_SHIFT)
#define LCD_BRD_WF8B_BPELCD27(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD27_SHIFT, LCD_WF8B_BPELCD27_WIDTH))

/*! @brief Set the BPELCD27 field to a new value. */
#define LCD_WR_WF8B_BPELCD27(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD27_MASK, LCD_WF8B_BPELCD27(value)))
#define LCD_BWR_WF8B_BPELCD27(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD27_SHIFT), LCD_WF8B_BPELCD27_SHIFT, LCD_WF8B_BPELCD27_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD46[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD46 field. */
#define LCD_RD_WF8B_BPELCD46(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD46_MASK) >> LCD_WF8B_BPELCD46_SHIFT)
#define LCD_BRD_WF8B_BPELCD46(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD46_SHIFT, LCD_WF8B_BPELCD46_WIDTH))

/*! @brief Set the BPELCD46 field to a new value. */
#define LCD_WR_WF8B_BPELCD46(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD46_MASK, LCD_WF8B_BPELCD46(value)))
#define LCD_BWR_WF8B_BPELCD46(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD46_SHIFT), LCD_WF8B_BPELCD46_SHIFT, LCD_WF8B_BPELCD46_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD26[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD26 field. */
#define LCD_RD_WF8B_BPELCD26(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD26_MASK) >> LCD_WF8B_BPELCD26_SHIFT)
#define LCD_BRD_WF8B_BPELCD26(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD26_SHIFT, LCD_WF8B_BPELCD26_WIDTH))

/*! @brief Set the BPELCD26 field to a new value. */
#define LCD_WR_WF8B_BPELCD26(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD26_MASK, LCD_WF8B_BPELCD26(value)))
#define LCD_BWR_WF8B_BPELCD26(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD26_SHIFT), LCD_WF8B_BPELCD26_SHIFT, LCD_WF8B_BPELCD26_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD10[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD10 field. */
#define LCD_RD_WF8B_BPELCD10(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD10_MASK) >> LCD_WF8B_BPELCD10_SHIFT)
#define LCD_BRD_WF8B_BPELCD10(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD10_SHIFT, LCD_WF8B_BPELCD10_WIDTH))

/*! @brief Set the BPELCD10 field to a new value. */
#define LCD_WR_WF8B_BPELCD10(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD10_MASK, LCD_WF8B_BPELCD10(value)))
#define LCD_BWR_WF8B_BPELCD10(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD10_SHIFT), LCD_WF8B_BPELCD10_SHIFT, LCD_WF8B_BPELCD10_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD13[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD13 field. */
#define LCD_RD_WF8B_BPELCD13(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD13_MASK) >> LCD_WF8B_BPELCD13_SHIFT)
#define LCD_BRD_WF8B_BPELCD13(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD13_SHIFT, LCD_WF8B_BPELCD13_WIDTH))

/*! @brief Set the BPELCD13 field to a new value. */
#define LCD_WR_WF8B_BPELCD13(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD13_MASK, LCD_WF8B_BPELCD13(value)))
#define LCD_BWR_WF8B_BPELCD13(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD13_SHIFT), LCD_WF8B_BPELCD13_SHIFT, LCD_WF8B_BPELCD13_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD25[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD25 field. */
#define LCD_RD_WF8B_BPELCD25(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD25_MASK) >> LCD_WF8B_BPELCD25_SHIFT)
#define LCD_BRD_WF8B_BPELCD25(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD25_SHIFT, LCD_WF8B_BPELCD25_WIDTH))

/*! @brief Set the BPELCD25 field to a new value. */
#define LCD_WR_WF8B_BPELCD25(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD25_MASK, LCD_WF8B_BPELCD25(value)))
#define LCD_BWR_WF8B_BPELCD25(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD25_SHIFT), LCD_WF8B_BPELCD25_SHIFT, LCD_WF8B_BPELCD25_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD5[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD5 field. */
#define LCD_RD_WF8B_BPELCD5(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD5_MASK) >> LCD_WF8B_BPELCD5_SHIFT)
#define LCD_BRD_WF8B_BPELCD5(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD5_SHIFT, LCD_WF8B_BPELCD5_WIDTH))

/*! @brief Set the BPELCD5 field to a new value. */
#define LCD_WR_WF8B_BPELCD5(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD5_MASK, LCD_WF8B_BPELCD5(value)))
#define LCD_BWR_WF8B_BPELCD5(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD5_SHIFT), LCD_WF8B_BPELCD5_SHIFT, LCD_WF8B_BPELCD5_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD24[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD24 field. */
#define LCD_RD_WF8B_BPELCD24(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD24_MASK) >> LCD_WF8B_BPELCD24_SHIFT)
#define LCD_BRD_WF8B_BPELCD24(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD24_SHIFT, LCD_WF8B_BPELCD24_WIDTH))

/*! @brief Set the BPELCD24 field to a new value. */
#define LCD_WR_WF8B_BPELCD24(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD24_MASK, LCD_WF8B_BPELCD24(value)))
#define LCD_BWR_WF8B_BPELCD24(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD24_SHIFT), LCD_WF8B_BPELCD24_SHIFT, LCD_WF8B_BPELCD24_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD47[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD47 field. */
#define LCD_RD_WF8B_BPELCD47(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD47_MASK) >> LCD_WF8B_BPELCD47_SHIFT)
#define LCD_BRD_WF8B_BPELCD47(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD47_SHIFT, LCD_WF8B_BPELCD47_WIDTH))

/*! @brief Set the BPELCD47 field to a new value. */
#define LCD_WR_WF8B_BPELCD47(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD47_MASK, LCD_WF8B_BPELCD47(value)))
#define LCD_BWR_WF8B_BPELCD47(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD47_SHIFT), LCD_WF8B_BPELCD47_SHIFT, LCD_WF8B_BPELCD47_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD23[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD23 field. */
#define LCD_RD_WF8B_BPELCD23(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD23_MASK) >> LCD_WF8B_BPELCD23_SHIFT)
#define LCD_BRD_WF8B_BPELCD23(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD23_SHIFT, LCD_WF8B_BPELCD23_WIDTH))

