RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the BPELCD0 field to a new value. */
#define LCD_WR_WF8B_BPELCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD0_MASK, LCD_WF8B_BPELCD0(value)))
#define LCD_BWR_WF8B_BPELCD0(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD0_SHIFT), LCD_WF8B_BPELCD0_SHIFT, LCD_WF8B_BPELCD0_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD60[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD60 field. */
#define LCD_RD_WF8B_BPELCD60(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD60_MASK) >> LCD_WF8B_BPELCD60_SHIFT)
#define LCD_BRD_WF8B_BPELCD60(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD60_SHIFT, LCD_WF8B_BPELCD60_WIDTH))

/*! @brief Set the BPELCD60 field to a new value. */
#define LCD_WR_WF8B_BPELCD60(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD60_MASK, LCD_WF8B_BPELCD60(value)))
#define LCD_BWR_WF8B_BPELCD60(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD60_SHIFT), LCD_WF8B_BPELCD60_SHIFT, LCD_WF8B_BPELCD60_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD15[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD15 field. */
#define LCD_RD_WF8B_BPELCD15(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD15_MASK) >> LCD_WF8B_BPELCD15_SHIFT)
#define LCD_BRD_WF8B_BPELCD15(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD15_SHIFT, LCD_WF8B_BPELCD15_WIDTH))

/*! @brief Set the BPELCD15 field to a new value. */
#define LCD_WR_WF8B_BPELCD15(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD15_MASK, LCD_WF8B_BPELCD15(value)))
#define LCD_BWR_WF8B_BPELCD15(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD15_SHIFT), LCD_WF8B_BPELCD15_SHIFT, LCD_WF8B_BPELCD15_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD61[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD61 field. */
#define LCD_RD_WF8B_BPELCD61(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD61_MASK) >> LCD_WF8B_BPELCD61_SHIFT)
#define LCD_BRD_WF8B_BPELCD61(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD61_SHIFT, LCD_WF8B_BPELCD61_WIDTH))

/*! @brief Set the BPELCD61 field to a new value. */
#define LCD_WR_WF8B_BPELCD61(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD61_MASK, LCD_WF8B_BPELCD61(value)))
#define LCD_BWR_WF8B_BPELCD61(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD61_SHIFT), LCD_WF8B_BPELCD61_SHIFT, LCD_WF8B_BPELCD61_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD54[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD54 field. */
#define LCD_RD_WF8B_BPELCD54(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD54_MASK) >> LCD_WF8B_BPELCD54_SHIFT)
#define LCD_BRD_WF8B_BPELCD54(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD54_SHIFT, LCD_WF8B_BPELCD54_WIDTH))

/*! @brief Set the BPELCD54 field to a new value. */
#define LCD_WR_WF8B_BPELCD54(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD54_MASK, LCD_WF8B_BPELCD54(value)))
#define LCD_BWR_WF8B_BPELCD54(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD54_SHIFT), LCD_WF8B_BPELCD54_SHIFT, LCD_WF8B_BPELCD54_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD62[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD62 field. */
#define LCD_RD_WF8B_BPELCD62(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD62_MASK) >> LCD_WF8B_BPELCD62_SHIFT)
#define LCD_BRD_WF8B_BPELCD62(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD62_SHIFT, LCD_WF8B_BPELCD62_WIDTH))

/*! @brief Set the BPELCD62 field to a new value. */
#define LCD_WR_WF8B_BPELCD62(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD62_MASK, LCD_WF8B_BPELCD62(value)))
#define LCD_BWR_WF8B_BPELCD62(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD62_SHIFT), LCD_WF8B_BPELCD62_SHIFT, LCD_WF8B_BPELCD62_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD63[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD63 field. */
#define LCD_RD_WF8B_BPELCD63(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD63_MASK) >> LCD_WF8B_BPELCD63_SHIFT)
#define LCD_BRD_WF8B_BPELCD63(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD63_SHIFT, LCD_WF8B_BPELCD63_WIDTH))

/*! @brief Set the BPELCD63 field to a new value. */
#define LCD_WR_WF8B_BPELCD63(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD63_MASK, LCD_WF8B_BPELCD63(value)))
#define LCD_BWR_WF8B_BPELCD63(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD63_SHIFT), LCD_WF8B_BPELCD63_SHIFT, LCD_WF8B_BPELCD63_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD55[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD55 field. */
#define LCD_RD_WF8B_BPELCD55(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD55_MASK) >> LCD_WF8B_BPELCD55_SHIFT)
#define LCD_BRD_WF8B_BPELCD55(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD55_SHIFT, LCD_WF8B_BPELCD55_WIDTH))

/*! @brief Set the BPELCD55 field to a new value. */
#define LCD_WR_WF8B_BPELCD55(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD55_MASK, LCD_WF8B_BPELCD55(value)))
#define LCD_BWR_WF8B_BPELCD55(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD55_SHIFT), LCD_WF8B_BPELCD55_SHIFT, LCD_WF8B_BPELCD55_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD4[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD4 field. */
#define LCD_RD_WF8B_BPELCD4(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD4_MASK) >> LCD_WF8B_BPELCD4_SHIFT)
#define LCD_BRD_WF8B_BPELCD4(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD4_SHIFT, LCD_WF8B_BPELCD4_WIDTH))

/*! @brief Set the BPELCD4 field to a new value. */
#define LCD_WR_WF8B_BPELCD4(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD4_MASK, LCD_WF8B_BPELCD4(value)))
#define LCD_BWR_WF8B_BPELCD4(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD4_SHIFT), LCD_WF8B_BPELCD4_SHIFT, LCD_WF8B_BPELCD4_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD13[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD13 field. */
#define LCD_RD_WF8B_BPFLCD13(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD13_MASK) >> LCD_WF8B_BPFLCD13_SHIFT)
#define LCD_BRD_WF8B_BPFLCD13(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD13_SHIFT, LCD_WF8B_BPFLCD13_WIDTH))

