RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the BPFLCD56 field to a new value. */
#define LCD_WR_WF8B_BPFLCD56(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD56_MASK, LCD_WF8B_BPFLCD56(value)))
#define LCD_BWR_WF8B_BPFLCD56(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD56_SHIFT), LCD_WF8B_BPFLCD56_SHIFT, LCD_WF8B_BPFLCD56_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD1[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD1 field. */
#define LCD_RD_WF8B_BPFLCD1(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD1_MASK) >> LCD_WF8B_BPFLCD1_SHIFT)
#define LCD_BRD_WF8B_BPFLCD1(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD1_SHIFT, LCD_WF8B_BPFLCD1_WIDTH))

/*! @brief Set the BPFLCD1 field to a new value. */
#define LCD_WR_WF8B_BPFLCD1(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD1_MASK, LCD_WF8B_BPFLCD1(value)))
#define LCD_BWR_WF8B_BPFLCD1(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD1_SHIFT), LCD_WF8B_BPFLCD1_SHIFT, LCD_WF8B_BPFLCD1_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD8[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD8 field. */
#define LCD_RD_WF8B_BPFLCD8(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD8_MASK) >> LCD_WF8B_BPFLCD8_SHIFT)
#define LCD_BRD_WF8B_BPFLCD8(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD8_SHIFT, LCD_WF8B_BPFLCD8_WIDTH))

/*! @brief Set the BPFLCD8 field to a new value. */
#define LCD_WR_WF8B_BPFLCD8(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD8_MASK, LCD_WF8B_BPFLCD8(value)))
#define LCD_BWR_WF8B_BPFLCD8(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD8_SHIFT), LCD_WF8B_BPFLCD8_SHIFT, LCD_WF8B_BPFLCD8_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD40[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD40 field. */
#define LCD_RD_WF8B_BPFLCD40(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD40_MASK) >> LCD_WF8B_BPFLCD40_SHIFT)
#define LCD_BRD_WF8B_BPFLCD40(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD40_SHIFT, LCD_WF8B_BPFLCD40_WIDTH))

/*! @brief Set the BPFLCD40 field to a new value. */
#define LCD_WR_WF8B_BPFLCD40(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD40_MASK, LCD_WF8B_BPFLCD40(value)))
#define LCD_BWR_WF8B_BPFLCD40(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD40_SHIFT), LCD_WF8B_BPFLCD40_SHIFT, LCD_WF8B_BPFLCD40_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD51[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD51 field. */
#define LCD_RD_WF8B_BPFLCD51(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD51_MASK) >> LCD_WF8B_BPFLCD51_SHIFT)
#define LCD_BRD_WF8B_BPFLCD51(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD51_SHIFT, LCD_WF8B_BPFLCD51_WIDTH))

/*! @brief Set the BPFLCD51 field to a new value. */
#define LCD_WR_WF8B_BPFLCD51(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD51_MASK, LCD_WF8B_BPFLCD51(value)))
#define LCD_BWR_WF8B_BPFLCD51(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD51_SHIFT), LCD_WF8B_BPFLCD51_SHIFT, LCD_WF8B_BPFLCD51_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD16[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD16 field. */
#define LCD_RD_WF8B_BPFLCD16(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD16_MASK) >> LCD_WF8B_BPFLCD16_SHIFT)
#define LCD_BRD_WF8B_BPFLCD16(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD16_SHIFT, LCD_WF8B_BPFLCD16_WIDTH))

/*! @brief Set the BPFLCD16 field to a new value. */
#define LCD_WR_WF8B_BPFLCD16(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD16_MASK, LCD_WF8B_BPFLCD16(value)))
#define LCD_BWR_WF8B_BPFLCD16(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD16_SHIFT), LCD_WF8B_BPFLCD16_SHIFT, LCD_WF8B_BPFLCD16_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD45[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD45 field. */
#define LCD_RD_WF8B_BPFLCD45(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD45_MASK) >> LCD_WF8B_BPFLCD45_SHIFT)
#define LCD_BRD_WF8B_BPFLCD45(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD45_SHIFT, LCD_WF8B_BPFLCD45_WIDTH))

/*! @brief Set the BPFLCD45 field to a new value. */
#define LCD_WR_WF8B_BPFLCD45(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD45_MASK, LCD_WF8B_BPFLCD45(value)))
#define LCD_BWR_WF8B_BPFLCD45(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD45_SHIFT), LCD_WF8B_BPFLCD45_SHIFT, LCD_WF8B_BPFLCD45_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD6[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD6 field. */
#define LCD_RD_WF8B_BPFLCD6(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD6_MASK) >> LCD_WF8B_BPFLCD6_SHIFT)
#define LCD_BRD_WF8B_BPFLCD6(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD6_SHIFT, LCD_WF8B_BPFLCD6_WIDTH))

/*! @brief Set the BPFLCD6 field to a new value. */
#define LCD_WR_WF8B_BPFLCD6(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD6_MASK, LCD_WF8B_BPFLCD6(value)))
#define LCD_BWR_WF8B_BPFLCD6(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD6_SHIFT), LCD_WF8B_BPFLCD6_SHIFT, LCD_WF8B_BPFLCD6_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD17[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD17 field. */
#define LCD_RD_WF8B_BPFLCD17(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD17_MASK) >> LCD_WF8B_BPFLCD17_SHIFT)
#define LCD_BRD_WF8B_BPFLCD17(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD17_SHIFT, LCD_WF8B_BPFLCD17_WIDTH))

/*! @brief Set the BPFLCD17 field to a new value. */
#define LCD_WR_WF8B_BPFLCD17(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD17_MASK, LCD_WF8B_BPFLCD17(value)))
#define LCD_BWR_WF8B_BPFLCD17(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD17_SHIFT), LCD_WF8B_BPFLCD17_SHIFT, LCD_WF8B_BPFLCD17_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD28[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD28 field. */
#define LCD_RD_WF8B_BPFLCD28(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD28_MASK) >> LCD_WF8B_BPFLCD28_SHIFT)
#define LCD_BRD_WF8B_BPFLCD28(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD28_SHIFT, LCD_WF8B_BPFLCD28_WIDTH))

/*! @brief Set the BPFLCD28 field to a new value. */
#define LCD_WR_WF8B_BPFLCD28(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD28_MASK, LCD_WF8B_BPFLCD28(value)))
#define LCD_BWR_WF8B_BPFLCD28(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD28_SHIFT), LCD_WF8B_BPFLCD28_SHIFT, LCD_WF8B_BPFLCD28_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD42[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD42 field. */
#define LCD_RD_WF8B_BPFLCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD42_MASK) >> LCD_WF8B_BPFLCD42_SHIFT)
#define LCD_BRD_WF8B_BPFLCD42(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD42_SHIFT, LCD_WF8B_BPFLCD42_WIDTH))

/*! @brief Set the BPFLCD42 field to a new value. */
#define LCD_WR_WF8B_BPFLCD42(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD42_MASK, LCD_WF8B_BPFLCD42(value)))
#define LCD_BWR_WF8B_BPFLCD42(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPFLCD42_SHIFT), LCD_WF8B_BPFLCD42_SHIFT, LCD_WF8B_BPFLCD42_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD29[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD29 field. */
#define LCD_RD_WF8B_BPFLCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD29_MASK) >> LCD_WF8B_BPFLCD29_SHIFT)
#define LCD_BRD_WF8B_BPFLCD29(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD29_SHIFT, LCD_WF8B_BPFLCD29_WIDTH))

