RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the BPHLCD60 field to a new value. */
#define LCD_WR_WF8B_BPHLCD60(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD60_MASK, LCD_WF8B_BPHLCD60(value)))
#define LCD_BWR_WF8B_BPHLCD60(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD60_SHIFT), LCD_WF8B_BPHLCD60_SHIFT, LCD_WF8B_BPHLCD60_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD59[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD59 field. */
#define LCD_RD_WF8B_BPHLCD59(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD59_MASK) >> LCD_WF8B_BPHLCD59_SHIFT)
#define LCD_BRD_WF8B_BPHLCD59(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD59_SHIFT, LCD_WF8B_BPHLCD59_WIDTH))

/*! @brief Set the BPHLCD59 field to a new value. */
#define LCD_WR_WF8B_BPHLCD59(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD59_MASK, LCD_WF8B_BPHLCD59(value)))
#define LCD_BWR_WF8B_BPHLCD59(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD59_SHIFT), LCD_WF8B_BPHLCD59_SHIFT, LCD_WF8B_BPHLCD59_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD58[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD58 field. */
#define LCD_RD_WF8B_BPHLCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD58_MASK) >> LCD_WF8B_BPHLCD58_SHIFT)
#define LCD_BRD_WF8B_BPHLCD58(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD58_SHIFT, LCD_WF8B_BPHLCD58_WIDTH))

/*! @brief Set the BPHLCD58 field to a new value. */
#define LCD_WR_WF8B_BPHLCD58(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD58_MASK, LCD_WF8B_BPHLCD58(value)))
#define LCD_BWR_WF8B_BPHLCD58(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD58_SHIFT), LCD_WF8B_BPHLCD58_SHIFT, LCD_WF8B_BPHLCD58_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD57[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD57 field. */
#define LCD_RD_WF8B_BPHLCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD57_MASK) >> LCD_WF8B_BPHLCD57_SHIFT)
#define LCD_BRD_WF8B_BPHLCD57(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD57_SHIFT, LCD_WF8B_BPHLCD57_WIDTH))

/*! @brief Set the BPHLCD57 field to a new value. */
#define LCD_WR_WF8B_BPHLCD57(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD57_MASK, LCD_WF8B_BPHLCD57(value)))
#define LCD_BWR_WF8B_BPHLCD57(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD57_SHIFT), LCD_WF8B_BPHLCD57_SHIFT, LCD_WF8B_BPHLCD57_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD0[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD0 field. */
#define LCD_RD_WF8B_BPHLCD0(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD0_MASK) >> LCD_WF8B_BPHLCD0_SHIFT)
#define LCD_BRD_WF8B_BPHLCD0(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD0_SHIFT, LCD_WF8B_BPHLCD0_WIDTH))

/*! @brief Set the BPHLCD0 field to a new value. */
#define LCD_WR_WF8B_BPHLCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD0_MASK, LCD_WF8B_BPHLCD0(value)))
#define LCD_BWR_WF8B_BPHLCD0(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD0_SHIFT), LCD_WF8B_BPHLCD0_SHIFT, LCD_WF8B_BPHLCD0_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD56[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD56 field. */
#define LCD_RD_WF8B_BPHLCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD56_MASK) >> LCD_WF8B_BPHLCD56_SHIFT)
#define LCD_BRD_WF8B_BPHLCD56(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD56_SHIFT, LCD_WF8B_BPHLCD56_WIDTH))

/*! @brief Set the BPHLCD56 field to a new value. */
#define LCD_WR_WF8B_BPHLCD56(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD56_MASK, LCD_WF8B_BPHLCD56(value)))
#define LCD_BWR_WF8B_BPHLCD56(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD56_SHIFT), LCD_WF8B_BPHLCD56_SHIFT, LCD_WF8B_BPHLCD56_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD55[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD55 field. */
#define LCD_RD_WF8B_BPHLCD55(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD55_MASK) >> LCD_WF8B_BPHLCD55_SHIFT)
#define LCD_BRD_WF8B_BPHLCD55(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD55_SHIFT, LCD_WF8B_BPHLCD55_WIDTH))

/*! @brief Set the BPHLCD55 field to a new value. */
#define LCD_WR_WF8B_BPHLCD55(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD55_MASK, LCD_WF8B_BPHLCD55(value)))
#define LCD_BWR_WF8B_BPHLCD55(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD55_SHIFT), LCD_WF8B_BPHLCD55_SHIFT, LCD_WF8B_BPHLCD55_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD54[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD54 field. */
#define LCD_RD_WF8B_BPHLCD54(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD54_MASK) >> LCD_WF8B_BPHLCD54_SHIFT)
#define LCD_BRD_WF8B_BPHLCD54(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD54_SHIFT, LCD_WF8B_BPHLCD54_WIDTH))

/*! @brief Set the BPHLCD54 field to a new value. */
#define LCD_WR_WF8B_BPHLCD54(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD54_MASK, LCD_WF8B_BPHLCD54(value)))
#define LCD_BWR_WF8B_BPHLCD54(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD54_SHIFT), LCD_WF8B_BPHLCD54_SHIFT, LCD_WF8B_BPHLCD54_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD53[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD53 field. */
#define LCD_RD_WF8B_BPHLCD53(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD53_MASK) >> LCD_WF8B_BPHLCD53_SHIFT)
#define LCD_BRD_WF8B_BPHLCD53(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD53_SHIFT, LCD_WF8B_BPHLCD53_WIDTH))

/*! @brief Set the BPHLCD53 field to a new value. */
#define LCD_WR_WF8B_BPHLCD53(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD53_MASK, LCD_WF8B_BPHLCD53(value)))
#define LCD_BWR_WF8B_BPHLCD53(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPHLCD53_SHIFT), LCD_WF8B_BPHLCD53_SHIFT, LCD_WF8B_BPHLCD53_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD52[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD52 field. */
#define LCD_RD_WF8B_BPHLCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD52_MASK) >> LCD_WF8B_BPHLCD52_SHIFT)
#define LCD_BRD_WF8B_BPHLCD52(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD52_SHIFT, LCD_WF8B_BPHLCD52_WIDTH))

