RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the COARSE_LOLIE field to a new value. */
#define MCG_WR_C8_COARSE_LOLIE(base, value) (MCG_RMW_C8(base, (MCG_C8_COARSE_LOLIE_MASK | MCG_C8_LOCS1_MASK), MCG_C8_COARSE_LOLIE(value)))
#define MCG_BWR_C8_COARSE_LOLIE(base, value) (BME_BFI8(&MCG_C8_REG(base), ((uint8_t)(value) << MCG_C8_COARSE_LOLIE_SHIFT), MCG_C8_COARSE_LOLIE_SHIFT, MCG_C8_COARSE_LOLIE_WIDTH))
/*@}*/

/*!
 * @name Register MCG_C8, field CME1[5] (RW)
 *
 * Enables the loss of clock monitoring circuit for the output of the RTC
 * external reference clock. The LOCRE1 bit will determine whether an interrupt or a
 * reset request is generated following a loss of RTC clock indication. The CME1
 * bit should be set to a logic 1 when the MCG is in an operational mode that uses
 * the RTC as its external reference clock or if the RTC is operational. CME1 bit
 * must be set to a logic 0 before the MCG enters any Stop mode. Otherwise, a
 * reset request may occur when in Stop mode. CME1 should also be set to a logic 0
 * before entering VLPR or VLPW power modes.
 *
 * Values:
 * - 0b0 - External clock monitor is disabled for RTC clock.
 * - 0b1 - External clock monitor is enabled for RTC clock.
 */
/*@{*/
/*! @brief Read current value of the MCG_C8_CME1 field. */
#define MCG_RD_C8_CME1(base) ((MCG_C8_REG(base) & MCG_C8_CME1_MASK) >> MCG_C8_CME1_SHIFT)
#define MCG_BRD_C8_CME1(base) (BME_UBFX8(&MCG_C8_REG(base), MCG_C8_CME1_SHIFT, MCG_C8_CME1_WIDTH))

/*! @brief Set the CME1 field to a new value. */
#define MCG_WR_C8_CME1(base, value) (MCG_RMW_C8(base, (MCG_C8_CME1_MASK | MCG_C8_LOCS1_MASK), MCG_C8_CME1(value)))
#define MCG_BWR_C8_CME1(base, value) (BME_BFI8(&MCG_C8_REG(base), ((uint8_t)(value) << MCG_C8_CME1_SHIFT), MCG_C8_CME1_SHIFT, MCG_C8_CME1_WIDTH))
/*@}*/

/*!
 * @name Register MCG_C8, field LOLRE[6] (RW)
 *
 * Determines if an interrupt or a reset request is made following a PLL loss of
 * lock.
 *
 * Values:
 * - 0b0 - Interrupt request is generated on a PLL loss of lock indication. The
 *     PLL loss of lock interrupt enable bit must also be set to generate the
 *     interrupt request.
 * - 0b1 - Generate a reset request on a PLL loss of lock indication.
 */
/*@{*/
/*! @brief Read current value of the MCG_C8_LOLRE field. */
#define MCG_RD_C8_LOLRE(base) ((MCG_C8_REG(base) & MCG_C8_LOLRE_MASK) >> MCG_C8_LOLRE_SHIFT)
#define MCG_BRD_C8_LOLRE(base) (BME_UBFX8(&MCG_C8_REG(base), MCG_C8_LOLRE_SHIFT, MCG_C8_LOLRE_WIDTH))

/*! @brief Set the LOLRE field to a new value. */
#define MCG_WR_C8_LOLRE(base, value) (MCG_RMW_C8(base, (MCG_C8_LOLRE_MASK | MCG_C8_LOCS1_MASK), MCG_C8_LOLRE(value)))
#define MCG_BWR_C8_LOLRE(base, value) (BME_BFI8(&MCG_C8_REG(base), ((uint8_t)(value) << MCG_C8_LOLRE_SHIFT), MCG_C8_LOLRE_SHIFT, MCG_C8_LOLRE_WIDTH))
/*@}*/

/*!
 * @name Register MCG_C8, field LOCRE1[7] (RW)
 *
 * Determines if a interrupt or a reset request is made following a loss of RTC
 * external reference clock. The LOCRE1 only has an affect when CME1 is set.
 *
 * Values:
 * - 0b0 - Interrupt request is generated on a loss of RTC external reference
 *     clock.
 * - 0b1 - Generate a reset request on a loss of RTC external reference clock
 */
/*@{*/
/*! @brief Read current value of the MCG_C8_LOCRE1 field. */
#define MCG_RD_C8_LOCRE1(base) ((MCG_C8_REG(base) & MCG_C8_LOCRE1_MASK) >> MCG_C8_LOCRE1_SHIFT)
#define MCG_BRD_C8_LOCRE1(base) (BME_UBFX8(&MCG_C8_REG(base), MCG_C8_LOCRE1_SHIFT, MCG_C8_LOCRE1_WIDTH))

/*! @brief Set the LOCRE1 field to a new value. */
#define MCG_WR_C8_LOCRE1(base, value) (MCG_RMW_C8(base, (MCG_C8_LOCRE1_MASK | MCG_C8_LOCS1_MASK), MCG_C8_LOCRE1(value)))
#define MCG_BWR_C8_LOCRE1(base, value) (BME_BFI8(&MCG_C8_REG(base), ((uint8_t)(value) << MCG_C8_LOCRE1_SHIFT), MCG_C8_LOCRE1_SHIFT, MCG_C8_LOCRE1_WIDTH))
/*@}*/

/*******************************************************************************
 * MCG_C9 - MCG Control 9 Register
 ******************************************************************************/

/*!
 * @brief MCG_C9 - MCG Control 9 Register (RO)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire MCG_C9 register
 */
/*@{*/
#define MCG_RD_C9(base)          (MCG_C9_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCG_C9 bitfields
 */

/*!
 * @name Register MCG_C9, field COARSE_LOCK[6] (RO)
 *
 * This bit indicates whether the PLL has acquired coarse lock after the first
 * lock sample (Note: LOCK bit asserts after three lock samples and CRS_LOCK will
 * assert after first lock sample). Lock detection is disabled when not operating
 * in either PEI, PBI, PBE or PEE mode unless PLLCLKEN0 =1 and the MCG is not
 * configured in BLPI or BLPE mode. Loss of PLL reference clock will also cause the
 * COARSE LOCK PLL has reacquired lock. Entry into LLS, VLPS, or regular Stop
 * with PLLSTEN0=0 also causes the coarse lock status bit to clear and stay cleared
 * until the Stop mode is exited and the PLL has reacquired lock after the first
 * sample.
 *
 * Values:
 * - 0b0 - PLL is currently unlocked.
 * - 0b1 - PLL is currently locked after first sample.
 */
/*@{*/
/*! @brief Read current value of the MCG_C9_COARSE_LOCK field. */
#define MCG_RD_C9_COARSE_LOCK(base) ((MCG_C9_REG(base) & MCG_C9_COARSE_LOCK_MASK) >> MCG_C9_COARSE_LOCK_SHIFT)
#define MCG_BRD_C9_COARSE_LOCK(base) (BME_UBFX8(&MCG_C9_REG(base), MCG_C9_COARSE_LOCK_SHIFT, MCG_C9_COARSE_LOCK_WIDTH))
/*@}*/

/*!
 * @name Register MCG_C9, field COARSE_LOLS[7] (RO)
 *
 * This bit is a sticky bit indicating the coarse lock status for the PLL.
 * COARSE_LOLS is set if after acquiring a coarse lock, the PLL output frequency has
 * fallen outside the lock exit frequency tolerance, D unl . COARSE_LOLIE
 * determines whether an interrupt request is made when COARSE_LOLS is set. This bit is
 * cleared by reset or by writing a logic 1 to it when set. Writing a logic 0 to
 * this bit has no effect.
 *
 * Values:
 * - 0b0 - PLL has not lost lock since COARSE_LOLS was last cleared.
 * - 0b1 - PLL has lost lock since COARSE_LOLS was last cleared.
 */
/*@{*/
/*! @brief Read current value of the MCG_C9_COARSE_LOLS field. */
#define MCG_RD_C9_COARSE_LOLS(base) ((MCG_C9_REG(base) & MCG_C9_COARSE_LOLS_MASK) >> MCG_C9_COARSE_LOLS_SHIFT)
#define MCG_BRD_C9_COARSE_LOLS(base) (BME_UBFX8(&MCG_C9_REG(base), MCG_C9_COARSE_LOLS_SHIFT, MCG_C9_COARSE_LOLS_WIDTH))
/*@}*/

