RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*
 * MKM34Z7 MMAU
 *
 * Memory-Mapped Arithmetic Unit
 *
 * Registers defined in this header file:
 * - MMAU_X0 - Operand Register X0
 * - MMAU_X1 - Operand Register X1
 * - MMAU_X2 - Operand Register X2
 * - MMAU_X3 - Operand Register X3
 * - MMAU_A0 - Accumulator Register A0
 * - MMAU_A1 - Accumulator Register A1
 * - MMAU_CSR - Control/Status Register
 */

#define MMAU_INSTANCE_COUNT (1U) /*!< Number of instances of the MMAU module. */
#define MMAU_IDX (0U) /*!< Instance number for MMAU. */

/*******************************************************************************
 * MMAU_X0 - Operand Register X0
 ******************************************************************************/

/*!
 * @brief MMAU_X0 - Operand Register X0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the input X0 operand before a calculation
 * operation is initiated. This register can be accessed (read/write) even when MMAU is
 * busy with the current instruction execution. This is to allow pipeline in
 * setting up next calculation operand. When access to this register, the MMAU
 * address[4:0] need to be 0x00 and the MMAU decoration code bits (address bit[11:5])
 * are ignored.
 */
/*!
 * @name Constants and macros for entire MMAU_X0 register
 */
/*@{*/
#define MMAU_RD_X0(base)         (MMAU_X0_REG(base))
#define MMAU_WR_X0(base, value)  (MMAU_X0_REG(base) = (value))
#define MMAU_RMW_X0(base, mask, value) (MMAU_WR_X0(base, (MMAU_RD_X0(base) & ~(mask)) | (value)))
#define MMAU_SET_X0(base, value) (MMAU_WR_X0(base, MMAU_RD_X0(base) |  (value)))
#define MMAU_CLR_X0(base, value) (MMAU_WR_X0(base, MMAU_RD_X0(base) & ~(value)))
#define MMAU_TOG_X0(base, value) (MMAU_WR_X0(base, MMAU_RD_X0(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * MMAU_X1 - Operand Register X1
 ******************************************************************************/

/*!
 * @brief MMAU_X1 - Operand Register X1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the input X1 operand before a calculation
 * operation is initiated. This register can be accessed (read/write) even when MMAU is
 * busy with the current instruction execution. This is to allow pipeline in
 * setting up next calculation operand. When access to this register, the MMAU
 * address[4:0] need to be 0x04 and the MMAU decoration code bits(address bit[11:5])
 * are ignored.
 */
/*!
 * @name Constants and macros for entire MMAU_X1 register
 */
/*@{*/
#define MMAU_RD_X1(base)         (MMAU_X1_REG(base))
#define MMAU_WR_X1(base, value)  (MMAU_X1_REG(base) = (value))
#define MMAU_RMW_X1(base, mask, value) (MMAU_WR_X1(base, (MMAU_RD_X1(base) & ~(mask)) | (value)))
#define MMAU_SET_X1(base, value) (MMAU_WR_X1(base, MMAU_RD_X1(base) |  (value)))
#define MMAU_CLR_X1(base, value) (MMAU_WR_X1(base, MMAU_RD_X1(base) & ~(value)))
#define MMAU_TOG_X1(base, value) (MMAU_WR_X1(base, MMAU_RD_X1(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * MMAU_X2 - Operand Register X2
 ******************************************************************************/

/*!
 * @brief MMAU_X2 - Operand Register X2 (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the input X2 operand before a calculation
 * operation is initiated. This register can be accessed (read/write) even when MMAU is
 * busy with the current instruction execution. This is to allow pipeline in
 * setting up next calculation operand. When access to this register, the MMAU
 * address[4:0] need to be 0x08 and the MMAU decoration code bits (address bit[11:5])
 * are ignored.
 */
/*!
 * @name Constants and macros for entire MMAU_X2 register
 */
/*@{*/
#define MMAU_RD_X2(base)         (MMAU_X2_REG(base))
#define MMAU_WR_X2(base, value)  (MMAU_X2_REG(base) = (value))
#define MMAU_RMW_X2(base, mask, value) (MMAU_WR_X2(base, (MMAU_RD_X2(base) & ~(mask)) | (value)))
#define MMAU_SET_X2(base, value) (MMAU_WR_X2(base, MMAU_RD_X2(base) |  (value)))
#define MMAU_CLR_X2(base, value) (MMAU_WR_X2(base, MMAU_RD_X2(base) & ~(value)))
#define MMAU_TOG_X2(base, value) (MMAU_WR_X2(base, MMAU_RD_X2(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * MMAU_X3 - Operand Register X3
 ******************************************************************************/

/*!
 * @brief MMAU_X3 - Operand Register X3 (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the input X3 operand together with the
 * instruction to be activated. When write access to X3, the MMAU Address[11:5] defines
 * the decoration code, which is instruction type and the saturation configuration,
 * and address[4:0] need to be 0x0C. Writing to Operand Register X3 will start
 * the execution of the operation defined by the decoration code immediately. For
 * multiply, the calculation completes in single clock cycle, and for divide and
 * square root, the MMAU will be busy until the calculation completes. Any memory
 * write access of the X3 register while the module is busy causes the access to
 * be stalled (using wait states) until the calculation completes. Read access
 * of this register returns the value immediately.
 */
/*!
 * @name Constants and macros for entire MMAU_X3 register
 */
/*@{*/
#define MMAU_RD_X3(base)         (MMAU_X3_REG(base))
#define MMAU_WR_X3(base, value)  (MMAU_X3_REG(base) = (value))
#define MMAU_RMW_X3(base, mask, value) (MMAU_WR_X3(base, (MMAU_RD_X3(base) & ~(mask)) | (value)))
#define MMAU_SET_X3(base, value) (MMAU_WR_X3(base, MMAU_RD_X3(base) |  (value)))
#define MMAU_CLR_X3(base, value) (MMAU_WR_X3(base, MMAU_RD_X3(base) & ~(value)))
#define MMAU_TOG_X3(base, value) (MMAU_WR_X3(base, MMAU_RD_X3(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * MMAU_A0 - Accumulator Register A0
 ******************************************************************************/

/*!
 * @brief MMAU_A0 - Accumulator Register A0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the lower 32-bit result of a calculation
 * operation from divide, square root or multiply, or multiply with accumulation. It
 * also serve as the lower 32-bit of the 64-bit operand for certain type of
 * instruction. Any access (read or write) of this register while the module is busy
 * during a calculation causes the access to be stalled (using wait states) until the
 * calculation completes. Together with A1, it provides a 64-bit result or
 * operand. When access to this register, the MMAU address[4:0] need to be 0x10 and
 * the MMAU decoration code bits (address bit[11:5]) are ignored if they are not
 * matching QSQRDA. For unsigned square root calculation on A10 where there is no
 * need input operands from X0-3, reading to A0 with decoration code Address[11:5]
 * to be USQRDA will launching the calculation immediately and the read will be
 * pending until the computation completes with the result returned.
 */
/*!
 * @name Constants and macros for entire MMAU_A0 register
 */
/*@{*/
#define MMAU_RD_A0(base)         (MMAU_A0_REG(base))
#define MMAU_WR_A0(base, value)  (MMAU_A0_REG(base) = (value))
#define MMAU_RMW_A0(base, mask, value) (MMAU_WR_A0(base, (MMAU_RD_A0(base) & ~(mask)) | (value)))
#define MMAU_SET_A0(base, value) (MMAU_WR_A0(base, MMAU_RD_A0(base) |  (value)))
#define MMAU_CLR_A0(base, value) (MMAU_WR_A0(base, MMAU_RD_A0(base) & ~(value)))
#define MMAU_TOG_A0(base, value) (MMAU_WR_A0(base, MMAU_RD_A0(base) ^  (value)))
/*@}*/

