RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * MMAU_A1 - Accumulator Register A1
 ******************************************************************************/

/*!
 * @brief MMAU_A1 - Accumulator Register A1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the higher 32-bit result of a calculation
 * operation from divide, square root or multiply, or multiply with accumulation. It
 * also serve as the higher 32-bit of the 64-bit operand for certain type of
 * instruction. Any access (read or write) of this register while the module is busy
 * during a calculation causes the access to be stalled (using wait states) until
 * the calculation completes. Together with A0, it provides a 64-bit result or
 * operand in the operation involved 64-bit. When access to this register, the MMAU
 * address[4:0] need to be 0x14 and the MMAU decoration code bits (address
 * bit[11:5]) are ignored if they are not matching to QSQRDA. For fractional numeric
 * square root calculation on A10 where there is no need input operands from X0-3,
 * reading to A1 with decoration code Address[11:5] to be QSQRDA will launching
 * the calculation immediately and the read will be pending until the computation
 * completes with the result returned.
 */
/*!
 * @name Constants and macros for entire MMAU_A1 register
 */
/*@{*/
#define MMAU_RD_A1(base)         (MMAU_A1_REG(base))
#define MMAU_WR_A1(base, value)  (MMAU_A1_REG(base) = (value))
#define MMAU_RMW_A1(base, mask, value) (MMAU_WR_A1(base, (MMAU_RD_A1(base) & ~(mask)) | (value)))
#define MMAU_SET_A1(base, value) (MMAU_WR_A1(base, MMAU_RD_A1(base) |  (value)))
#define MMAU_CLR_A1(base, value) (MMAU_WR_A1(base, MMAU_RD_A1(base) & ~(value)))
#define MMAU_TOG_A1(base, value) (MMAU_WR_A1(base, MMAU_RD_A1(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * MMAU_CSR - Control/Status Register
 ******************************************************************************/

/*!
 * @brief MMAU_CSR - Control/Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the operating configuration and the computation result
 * status of MMAU. It includes the busy status indicators, computation result
 * status on overflow for multiply, divide and accumulation, error status flag for
 * divide by zero. It has the Interrupt Flag bits of the overflow, divide by zero
 * bits too. It also include supervisor lock bit, the MMAU can only be access in
 * Supervisor mode when set. It has DMA enable, interrupt enable control bits
 * too. A memory write access of the CSR register while the MMAU is busy during a
 * calculation causes the access to be stalled (using wait states) until the
 * calculation completes, read to CSR return the register value immediately even when
 * MMAU is in busy. When access to this register, the MMAU address[4:0] need to be
 * 0x8C and the MMAU decoration code bits (address bit[11:5]) are ignored. The
 * Interrupt Flag bits are read-only from the address offset of 0x18, MMAU
 * provides another register entry (CSR_IF_CLR) of address[4:0]=0x1C for clearing CSR
 * status and the Interrupt flag bits, where the interrupt flag bits can be cleared
 * by W1C (write one to clear).
 */
/*!
 * @name Constants and macros for entire MMAU_CSR register
 */
/*@{*/
#define MMAU_RD_CSR(base)        (MMAU_CSR_REG(base))
#define MMAU_WR_CSR(base, value) (MMAU_CSR_REG(base) = (value))
#define MMAU_RMW_CSR(base, mask, value) (MMAU_WR_CSR(base, (MMAU_RD_CSR(base) & ~(mask)) | (value)))
#define MMAU_SET_CSR(base, value) (MMAU_WR_CSR(base, MMAU_RD_CSR(base) |  (value)))
#define MMAU_CLR_CSR(base, value) (MMAU_WR_CSR(base, MMAU_RD_CSR(base) & ~(value)))
#define MMAU_TOG_CSR(base, value) (MMAU_WR_CSR(base, MMAU_RD_CSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MMAU_CSR bitfields
 */

/*!
 * @name Register MMAU_CSR, field Q[0] (RW)
 *
 * For computation of multiply with accumulation, this bit is set when the
 * accumulation computation results overflow. It is updated on each calculation. It
 * can be set/cleared by user software code too.
 *
 * Values:
 * - 0b0 - No accumulation operation or accumulation operation does not overflow
 * - 0b1 - Accumulation overflows during a MAC instruction
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_Q field. */
#define MMAU_RD_CSR_Q(base)  ((MMAU_CSR_REG(base) & MMAU_CSR_Q_MASK) >> MMAU_CSR_Q_SHIFT)
#define MMAU_BRD_CSR_Q(base) (MMAU_RD_CSR_Q(base))

/*! @brief Set the Q field to a new value. */
#define MMAU_WR_CSR_Q(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_Q_MASK, MMAU_CSR_Q(value)))
#define MMAU_BWR_CSR_Q(base, value) (MMAU_WR_CSR_Q(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field V[1] (RW)
 *
 * For divide or multiply operation, if the divide quotient or multiply product
 * computation overflows, this V flag bit will be set. It is updated on each
 * calculation. It can be set/cleared by user software code too.
 *
 * Values:
 * - 0b0 - Calculation is not include divider or multiply, or the
 *     product/quotient does not overflow
 * - 0b1 - Product in multiply or multiply with accumulation, or quotient of a
 *     divide overflows
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_V field. */
#define MMAU_RD_CSR_V(base)  ((MMAU_CSR_REG(base) & MMAU_CSR_V_MASK) >> MMAU_CSR_V_SHIFT)
#define MMAU_BRD_CSR_V(base) (MMAU_RD_CSR_V(base))

/*! @brief Set the V field to a new value. */
#define MMAU_WR_CSR_V(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_V_MASK, MMAU_CSR_V(value)))
#define MMAU_BWR_CSR_V(base, value) (MMAU_WR_CSR_V(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field DZ[2] (RW)
 *
 * This DZ flag indicates that the divisor is zero for a divide operation when
 * set. It is updated on each calculation. It can be set/cleared by user software
 * code too.
 *
 * Values:
 * - 0b0 - For divide, the divisor is not zero, or the calculation is not divide
 * - 0b1 - For divide, the divisor is zero, which is a divide-by-zero error
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_DZ field. */
#define MMAU_RD_CSR_DZ(base) ((MMAU_CSR_REG(base) & MMAU_CSR_DZ_MASK) >> MMAU_CSR_DZ_SHIFT)
#define MMAU_BRD_CSR_DZ(base) (MMAU_RD_CSR_DZ(base))

/*! @brief Set the DZ field to a new value. */
#define MMAU_WR_CSR_DZ(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_DZ_MASK, MMAU_CSR_DZ(value)))
#define MMAU_BWR_CSR_DZ(base, value) (MMAU_WR_CSR_DZ(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field N[3] (RW)
 *
 * For signed arithmetic calculation, if the raw computation result is negative
 * (before overflows or saturation), this N flag bit will be set. It is updated
 * on each calculation. It can be set/cleared by software code too.
 *
 * Values:
 * - 0b0 - Calculation raw result is zero or positive, or unsigned number
 * - 0b1 - Calculation raw result is negative
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_N field. */
#define MMAU_RD_CSR_N(base)  ((MMAU_CSR_REG(base) & MMAU_CSR_N_MASK) >> MMAU_CSR_N_SHIFT)
#define MMAU_BRD_CSR_N(base) (MMAU_RD_CSR_N(base))

/*! @brief Set the N field to a new value. */
#define MMAU_WR_CSR_N(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_N_MASK, MMAU_CSR_N(value)))
#define MMAU_BWR_CSR_N(base, value) (MMAU_WR_CSR_N(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field QIF[4] (RO)
 *
 * The QIF is the Accumulation Overflow Interrupt Flag bit, and it is the sticky
 * version of CSR[Q]. It can only be set by MMAU execution of instruction. Once
 * it is set, it can only be cleared by user software through writing "1" to this
 * bit from register entry of CSR_IF_CLR at address offset 0x1C. When this bit
 * is set, and if the accumulation interrupt is enable by setting CSR[QIE], MMAU
 * will issue interrupt to CPU.
 *
 * Values:
 * - 0b0 - No accumulation operation or accumulation operation does not overflow
 * - 0b1 - Accumulation overflows during a MAC instruction
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_QIF field. */
#define MMAU_RD_CSR_QIF(base) ((MMAU_CSR_REG(base) & MMAU_CSR_QIF_MASK) >> MMAU_CSR_QIF_SHIFT)
#define MMAU_BRD_CSR_QIF(base) (MMAU_RD_CSR_QIF(base))
/*@}*/

/*!
 * @name Register MMAU_CSR, field VIF[5] (RO)
 *
 * The VIF is the Multiply or Divide Overflow Interrupt Flag bit, and it is the
 * sticky version of CSR[V]. It can only be set by MMAU execution of instruction.
 * Once it is set, it can only be cleared by user software code through writing
 * "1" to this bit from register entry of CSR_IF_CLR at address offset 0x1C. When
 * this bit is set, and if the Multiply or Divide Overflow Interrupt is enable
 * by setting CSR[VIE], MMAU will issue interrupt to CPU.
 *
 * Values:
 * - 0b0 - Calculation is not include divider or multiply, or the
 *     product/quotient does not overflow
 * - 0b1 - Product in multiply or multiply with accumulation, or quotient of a
 *     divide overflows
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_VIF field. */
#define MMAU_RD_CSR_VIF(base) ((MMAU_CSR_REG(base) & MMAU_CSR_VIF_MASK) >> MMAU_CSR_VIF_SHIFT)
#define MMAU_BRD_CSR_VIF(base) (MMAU_RD_CSR_VIF(base))
/*@}*/

/*!
 * @name Register MMAU_CSR, field DZIF[6] (RO)
 *
 * The DZIF is the Divide by Zero Interrupt Flag bit, and it is the sticky
 * version of CSR[DZ]. It can only be set by MMAU execution of instruction. Once it is
 * set, it can only be cleared by user software code through writing "1" to this
 * bit from register entry of CSR_IF_CLR at address offset 0x1C. When this bit
 * is set, and if the Divide by Zero Interrupt is enable by setting CSR[DZIE],
 * MMAU will issue interrupt to CPU.
 *
 * Values:
 * - 0b0 - For divide, the divisor is not zero, or the calculation is not divide
 * - 0b1 - For divide, the divisor is zero, which is a divide-by-zero error
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_DZIF field. */
#define MMAU_RD_CSR_DZIF(base) ((MMAU_CSR_REG(base) & MMAU_CSR_DZIF_MASK) >> MMAU_CSR_DZIF_SHIFT)
#define MMAU_BRD_CSR_DZIF(base) (MMAU_RD_CSR_DZIF(base))
/*@}*/

/*!
 * @name Register MMAU_CSR, field QIE[12] (RW)
 *
 * This control bit is used to enable/disable QIF flag interrupt.
 *
 * Values:
 * - 0b0 - Q flag (CSR[QIF]) set will not generate interrupt.
 * - 0b1 - Q flag (CSR[QIF]) set will generate interrupt to inform an
 *     accumulation overflow
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_QIE field. */
#define MMAU_RD_CSR_QIE(base) ((MMAU_CSR_REG(base) & MMAU_CSR_QIE_MASK) >> MMAU_CSR_QIE_SHIFT)
#define MMAU_BRD_CSR_QIE(base) (MMAU_RD_CSR_QIE(base))

/*! @brief Set the QIE field to a new value. */
#define MMAU_WR_CSR_QIE(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_QIE_MASK, MMAU_CSR_QIE(value)))
#define MMAU_BWR_CSR_QIE(base, value) (MMAU_WR_CSR_QIE(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field VIE[13] (RW)
 *
 * This control bit is used to enable/disable VIF flag interrupt.
 *
 * Values:
 * - 0b0 - V flag (CSR[VIF]) set will not generate interrupt.
 * - 0b1 - V flag (CSR[VIF]) set will generate interrupt to inform a divide or
 *     multiply overflow
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_VIE field. */
#define MMAU_RD_CSR_VIE(base) ((MMAU_CSR_REG(base) & MMAU_CSR_VIE_MASK) >> MMAU_CSR_VIE_SHIFT)
#define MMAU_BRD_CSR_VIE(base) (MMAU_RD_CSR_VIE(base))

/*! @brief Set the VIE field to a new value. */
#define MMAU_WR_CSR_VIE(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_VIE_MASK, MMAU_CSR_VIE(value)))
#define MMAU_BWR_CSR_VIE(base, value) (MMAU_WR_CSR_VIE(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field DZIE[14] (RW)
 *
 * This indicator configures the MMAU's interrupt when a divide-by-zero
 * calculations is detected. If both CSR[DZIF] and CSR[DZE] are set, MMAU will generate
 * an interrupt to CPU.
 *
 * Values:
 * - 0b0 - MMAU will not generate interrupt even CSR[DZIF]=1
 * - 0b1 - If CSR[DZIF] = 1, MMAU will generate an interrupt to signal a
 *     divide-by-zero.
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_DZIE field. */
#define MMAU_RD_CSR_DZIE(base) ((MMAU_CSR_REG(base) & MMAU_CSR_DZIE_MASK) >> MMAU_CSR_DZIE_SHIFT)
#define MMAU_BRD_CSR_DZIE(base) (MMAU_RD_CSR_DZIE(base))

/*! @brief Set the DZIE field to a new value. */
#define MMAU_WR_CSR_DZIE(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_DZIE_MASK, MMAU_CSR_DZIE(value)))
#define MMAU_BWR_CSR_DZIE(base, value) (MMAU_WR_CSR_DZIE(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field DRE[16] (RW)
 *
 * MMAU provide interface for DMA to configure the MMAU and launch the
 * calculation. When MMAU completes the execution of instruction, it will be in IDLE state
 * (not busy). It can be configured optional to generate the DMA request so that
 * user can use DMA to fetch the result and program the new computation
 * instruction.
 *
 * Values:
 * - 0b0 - MMAU will not generate DMA request when in IDLE (not busy) state
 * - 0b1 - MMAU will generate DMA request when in IDLE (not busy) state
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_DRE field. */
#define MMAU_RD_CSR_DRE(base) ((MMAU_CSR_REG(base) & MMAU_CSR_DRE_MASK) >> MMAU_CSR_DRE_SHIFT)
#define MMAU_BRD_CSR_DRE(base) (MMAU_RD_CSR_DRE(base))

/*! @brief Set the DRE field to a new value. */
#define MMAU_WR_CSR_DRE(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_DRE_MASK, MMAU_CSR_DRE(value)))
#define MMAU_BWR_CSR_DRE(base, value) (MMAU_WR_CSR_DRE(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field SO[17] (RW)
 *
 * This is the Supervisor Only bit. When this bit is set, CPU/DMA can only
 * access MMAU in supervisor mode; when it is access through user mode, MMAU will
 * terminate the access with an bus error. This bit can only be changed by CPU in
 * supervisor mode, write access in User Mode will be ignored by MMAU.
 *
 * Values:
 * - 0b0 - MMAU registers can be access in both User Mode or Supervisor Mode
 * - 0b1 - MMAU registers can only be access in Supervisor Mode
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_SO field. */
#define MMAU_RD_CSR_SO(base) ((MMAU_CSR_REG(base) & MMAU_CSR_SO_MASK) >> MMAU_CSR_SO_SHIFT)
#define MMAU_BRD_CSR_SO(base) (MMAU_RD_CSR_SO(base))

/*! @brief Set the SO field to a new value. */
#define MMAU_WR_CSR_SO(base, value) (MMAU_RMW_CSR(base, MMAU_CSR_SO_MASK, MMAU_CSR_SO(value)))
#define MMAU_BWR_CSR_SO(base, value) (MMAU_WR_CSR_SO(base, value))
/*@}*/

/*!
 * @name Register MMAU_CSR, field HDR[23:20] (RO)
 *
 * This HDR field is read-only and tells the Hardware Revision Level of MMAU, it
 * will changes with different version of MMAU.
 *
 * Values:
 * - 0b0000 - Current Hardware Revision Level is 0000
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_HDR field. */
#define MMAU_RD_CSR_HDR(base) ((MMAU_CSR_REG(base) & MMAU_CSR_HDR_MASK) >> MMAU_CSR_HDR_SHIFT)
#define MMAU_BRD_CSR_HDR(base) (MMAU_RD_CSR_HDR(base))
/*@}*/

/*!
 * @name Register MMAU_CSR, field BUSY[31] (RO)
 *
 * This read-only bit is asserted when the MMAU is performing a divide or square
 * root. Multiply operation completes in single cycle. When an operation is
 * initiated, the hardware sets this flag. It remains asserted until the operation
 * completes and the hardware automatically clears the indicator. This bit can be
 * used to poll the MMAU's execution status.
 *
 * Values:
 * - 0b0 - MMAU is idle
 * - 0b1 - MMAU is busy performing a divide or square root calculation
 */
/*@{*/
/*! @brief Read current value of the MMAU_CSR_BUSY field. */
#define MMAU_RD_CSR_BUSY(base) ((MMAU_CSR_REG(base) & MMAU_CSR_BUSY_MASK) >> MMAU_CSR_BUSY_SHIFT)
#define MMAU_BRD_CSR_BUSY(base) (MMAU_RD_CSR_BUSY(base))
/*@}*/

/* Constants and macros for entire MMAU_CSR registers */
#define MMAU_WR_CSR_IF_CLR(base, value) (MMAU_CSR_IF_CLR_REG(base) = (value))

