RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*
 * Constants & macros for individual PDB_S bitfields
 */

/*!
 * @name Register PDB_S, field ERR[7:0] (RW)
 *
 * Only the lower M bits are implemented in this MCU.
 *
 * Values:
 * - 0b00000000 - Sequence error not detected on PDB channel's corresponding
 *     pre-trigger.
 * - 0b00000001 - Sequence error detected on PDB channel's corresponding
 *     pre-trigger. ADCn block can be triggered for a conversion by one pre-trigger from
 *     PDB channel n. When one conversion, which is triggered by one of the
 *     pre-triggers from PDB channel n, is in progress, new trigger from PDB
 *     channel's corresponding pre-trigger m cannot be accepted by ADCn, and ERR[m] is
 *     set. Writing 0's to clear the sequence error flags.
 */
/*@{*/
/*! @brief Read current value of the PDB_S_ERR field. */
#define PDB_RD_S_ERR(base, index) ((PDB_S_REG(base, index) & PDB_S_ERR_MASK) >> PDB_S_ERR_SHIFT)
#define PDB_BRD_S_ERR(base, index) (BME_UBFX32(&PDB_S_REG(base, index), PDB_S_ERR_SHIFT, PDB_S_ERR_WIDTH))

/*! @brief Set the ERR field to a new value. */
#define PDB_WR_S_ERR(base, index, value) (PDB_RMW_S(base, index, PDB_S_ERR_MASK, PDB_S_ERR(value)))
#define PDB_BWR_S_ERR(base, index, value) (BME_BFI32(&PDB_S_REG(base, index), ((uint32_t)(value) << PDB_S_ERR_SHIFT), PDB_S_ERR_SHIFT, PDB_S_ERR_WIDTH))
/*@}*/

/*!
 * @name Register PDB_S, field CF[23:16] (RW)
 *
 * The CF[m] field is set when the PDB counter matches the CHnDLYm. Write 0 to
 * clear these bits.
 */
/*@{*/
/*! @brief Read current value of the PDB_S_CF field. */
#define PDB_RD_S_CF(base, index) ((PDB_S_REG(base, index) & PDB_S_CF_MASK) >> PDB_S_CF_SHIFT)
#define PDB_BRD_S_CF(base, index) (BME_UBFX32(&PDB_S_REG(base, index), PDB_S_CF_SHIFT, PDB_S_CF_WIDTH))

/*! @brief Set the CF field to a new value. */
#define PDB_WR_S_CF(base, index, value) (PDB_RMW_S(base, index, PDB_S_CF_MASK, PDB_S_CF(value)))
#define PDB_BWR_S_CF(base, index, value) (BME_BFI32(&PDB_S_REG(base, index), ((uint32_t)(value) << PDB_S_CF_SHIFT), PDB_S_CF_SHIFT, PDB_S_CF_WIDTH))
/*@}*/

/*******************************************************************************
 * PDB_DLY - Channel n Delay 0 register
 ******************************************************************************/

/*!
 * @brief PDB_DLY - Channel n Delay 0 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_DLY register
 */
/*@{*/
#define PDB_RD_DLY(base, index, index2) (PDB_DLY_REG(base, index, index2))
#define PDB_WR_DLY(base, index, index2, value) (PDB_DLY_REG(base, index, index2) = (value))
#define PDB_RMW_DLY(base, index, index2, mask, value) (PDB_WR_DLY(base, index, index2, (PDB_RD_DLY(base, index, index2) & ~(mask)) | (value)))
#define PDB_SET_DLY(base, index, index2, value) (BME_OR32(&PDB_DLY_REG(base, index, index2), (uint32_t)(value)))
#define PDB_CLR_DLY(base, index, index2, value) (BME_AND32(&PDB_DLY_REG(base, index, index2), (uint32_t)(~(value))))
#define PDB_TOG_DLY(base, index, index2, value) (BME_XOR32(&PDB_DLY_REG(base, index, index2), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PDB_DLY bitfields
 */

/*!
 * @name Register PDB_DLY, field DLY[15:0] (RW)
 *
 * Specifies the delay value for the channel's corresponding pre-trigger. The
 * pre-trigger asserts when the counter is equal to DLY. Reading this field returns
 * the value of internal register that is effective for the current PDB cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_DLY_DLY field. */
#define PDB_RD_DLY_DLY(base, index, index2) ((PDB_DLY_REG(base, index, index2) & PDB_DLY_DLY_MASK) >> PDB_DLY_DLY_SHIFT)
#define PDB_BRD_DLY_DLY(base, index, index2) (BME_UBFX32(&PDB_DLY_REG(base, index, index2), PDB_DLY_DLY_SHIFT, PDB_DLY_DLY_WIDTH))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_DLY_DLY(base, index, index2, value) (PDB_RMW_DLY(base, index, index2, PDB_DLY_DLY_MASK, PDB_DLY_DLY(value)))
#define PDB_BWR_DLY_DLY(base, index, index2, value) (BME_BFI32(&PDB_DLY_REG(base, index, index2), ((uint32_t)(value) << PDB_DLY_DLY_SHIFT), PDB_DLY_DLY_SHIFT, PDB_DLY_DLY_WIDTH))
/*@}*/

/*******************************************************************************
 * PDB_CHDLY2 - Channel n Delay 2 register
 ******************************************************************************/

/*!
 * @brief PDB_CHDLY2 - Channel n Delay 2 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CHDLY2 register
 */
/*@{*/
#define PDB_RD_CHDLY2(base, index) (PDB_CHDLY2_REG(base, index))
#define PDB_WR_CHDLY2(base, index, value) (PDB_CHDLY2_REG(base, index) = (value))
#define PDB_RMW_CHDLY2(base, index, mask, value) (PDB_WR_CHDLY2(base, index, (PDB_RD_CHDLY2(base, index) & ~(mask)) | (value)))
#define PDB_SET_CHDLY2(base, index, value) (BME_OR32(&PDB_CHDLY2_REG(base, index), (uint32_t)(value)))
#define PDB_CLR_CHDLY2(base, index, value) (BME_AND32(&PDB_CHDLY2_REG(base, index), (uint32_t)(~(value))))
#define PDB_TOG_CHDLY2(base, index, value) (BME_XOR32(&PDB_CHDLY2_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CHDLY2 bitfields
 */

/*!
 * @name Register PDB_CHDLY2, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CHDLY2_DLY field. */
#define PDB_RD_CHDLY2_DLY(base, index) ((PDB_CHDLY2_REG(base, index) & PDB_CHDLY2_DLY_MASK) >> PDB_CHDLY2_DLY_SHIFT)
#define PDB_BRD_CHDLY2_DLY(base, index) (BME_UBFX32(&PDB_CHDLY2_REG(base, index), PDB_CHDLY2_DLY_SHIFT, PDB_CHDLY2_DLY_WIDTH))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CHDLY2_DLY(base, index, value) (PDB_RMW_CHDLY2(base, index, PDB_CHDLY2_DLY_MASK, PDB_CHDLY2_DLY(value)))
#define PDB_BWR_CHDLY2_DLY(base, index, value) (BME_BFI32(&PDB_CHDLY2_REG(base, index), ((uint32_t)(value) << PDB_CHDLY2_DLY_SHIFT), PDB_CHDLY2_DLY_SHIFT, PDB_CHDLY2_DLY_WIDTH))
/*@}*/

