RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * PDB_CHDLY3 - Channel n Delay 3 register
 ******************************************************************************/

/*!
 * @brief PDB_CHDLY3 - Channel n Delay 3 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CHDLY3 register
 */
/*@{*/
#define PDB_RD_CHDLY3(base, index) (PDB_CHDLY3_REG(base, index))
#define PDB_WR_CHDLY3(base, index, value) (PDB_CHDLY3_REG(base, index) = (value))
#define PDB_RMW_CHDLY3(base, index, mask, value) (PDB_WR_CHDLY3(base, index, (PDB_RD_CHDLY3(base, index) & ~(mask)) | (value)))
#define PDB_SET_CHDLY3(base, index, value) (BME_OR32(&PDB_CHDLY3_REG(base, index), (uint32_t)(value)))
#define PDB_CLR_CHDLY3(base, index, value) (BME_AND32(&PDB_CHDLY3_REG(base, index), (uint32_t)(~(value))))
#define PDB_TOG_CHDLY3(base, index, value) (BME_XOR32(&PDB_CHDLY3_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CHDLY3 bitfields
 */

/*!
 * @name Register PDB_CHDLY3, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CHDLY3_DLY field. */
#define PDB_RD_CHDLY3_DLY(base, index) ((PDB_CHDLY3_REG(base, index) & PDB_CHDLY3_DLY_MASK) >> PDB_CHDLY3_DLY_SHIFT)
#define PDB_BRD_CHDLY3_DLY(base, index) (BME_UBFX32(&PDB_CHDLY3_REG(base, index), PDB_CHDLY3_DLY_SHIFT, PDB_CHDLY3_DLY_WIDTH))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CHDLY3_DLY(base, index, value) (PDB_RMW_CHDLY3(base, index, PDB_CHDLY3_DLY_MASK, PDB_CHDLY3_DLY(value)))
#define PDB_BWR_CHDLY3_DLY(base, index, value) (BME_BFI32(&PDB_CHDLY3_REG(base, index), ((uint32_t)(value) << PDB_CHDLY3_DLY_SHIFT), PDB_CHDLY3_DLY_SHIFT, PDB_CHDLY3_DLY_WIDTH))
/*@}*/

/*******************************************************************************
 * PDB_POEN - Pulse-Out n Enable register
 ******************************************************************************/

/*!
 * @brief PDB_POEN - Pulse-Out n Enable register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_POEN register
 */
/*@{*/
#define PDB_RD_POEN(base)        (PDB_POEN_REG(base))
#define PDB_WR_POEN(base, value) (PDB_POEN_REG(base) = (value))
#define PDB_RMW_POEN(base, mask, value) (PDB_WR_POEN(base, (PDB_RD_POEN(base) & ~(mask)) | (value)))
#define PDB_SET_POEN(base, value) (BME_OR32(&PDB_POEN_REG(base), (uint32_t)(value)))
#define PDB_CLR_POEN(base, value) (BME_AND32(&PDB_POEN_REG(base), (uint32_t)(~(value))))
#define PDB_TOG_POEN(base, value) (BME_XOR32(&PDB_POEN_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PDB_POEN bitfields
 */

/*!
 * @name Register PDB_POEN, field POEN[7:0] (RW)
 *
 * Enables the pulse output. Only lower Y bits are implemented in this MCU.
 *
 * Values:
 * - 0b00000000 - PDB Pulse-Out disabled
 * - 0b00000001 - PDB Pulse-Out enabled
 */
/*@{*/
/*! @brief Read current value of the PDB_POEN_POEN field. */
#define PDB_RD_POEN_POEN(base) ((PDB_POEN_REG(base) & PDB_POEN_POEN_MASK) >> PDB_POEN_POEN_SHIFT)
#define PDB_BRD_POEN_POEN(base) (BME_UBFX32(&PDB_POEN_REG(base), PDB_POEN_POEN_SHIFT, PDB_POEN_POEN_WIDTH))

/*! @brief Set the POEN field to a new value. */
#define PDB_WR_POEN_POEN(base, value) (PDB_RMW_POEN(base, PDB_POEN_POEN_MASK, PDB_POEN_POEN(value)))
#define PDB_BWR_POEN_POEN(base, value) (BME_BFI32(&PDB_POEN_REG(base), ((uint32_t)(value) << PDB_POEN_POEN_SHIFT), PDB_POEN_POEN_SHIFT, PDB_POEN_POEN_WIDTH))
/*@}*/

/*******************************************************************************
 * PDB_PODLY - Pulse-Out n Delay register
 ******************************************************************************/

/*!
 * @brief PDB_PODLY - Pulse-Out n Delay register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_PODLY register
 */
/*@{*/
#define PDB_RD_PODLY(base, index) (PDB_PODLY_REG(base, index))
#define PDB_WR_PODLY(base, index, value) (PDB_PODLY_REG(base, index) = (value))
#define PDB_RMW_PODLY(base, index, mask, value) (PDB_WR_PODLY(base, index, (PDB_RD_PODLY(base, index) & ~(mask)) | (value)))
#define PDB_SET_PODLY(base, index, value) (BME_OR32(&PDB_PODLY_REG(base, index), (uint32_t)(value)))
#define PDB_CLR_PODLY(base, index, value) (BME_AND32(&PDB_PODLY_REG(base, index), (uint32_t)(~(value))))
#define PDB_TOG_PODLY(base, index, value) (BME_XOR32(&PDB_PODLY_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PDB_PODLY bitfields
 */

/*!
 * @name Register PDB_PODLY, field DLY2[15:0] (RW)
 *
 * These bits specify the delay 2 value for the PDB Pulse-Out. Pulse-Out goes
 * low when the PDB counter is equal to the DLY2. Reading these bits returns the
 * value of internal register that is effective for the current PDB cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_PODLY_DLY2 field. */
#define PDB_RD_PODLY_DLY2(base, index) ((PDB_PODLY_REG(base, index) & PDB_PODLY_DLY2_MASK) >> PDB_PODLY_DLY2_SHIFT)
#define PDB_BRD_PODLY_DLY2(base, index) (BME_UBFX32(&PDB_PODLY_REG(base, index), PDB_PODLY_DLY2_SHIFT, PDB_PODLY_DLY2_WIDTH))

/*! @brief Set the DLY2 field to a new value. */
#define PDB_WR_PODLY_DLY2(base, index, value) (PDB_RMW_PODLY(base, index, PDB_PODLY_DLY2_MASK, PDB_PODLY_DLY2(value)))
#define PDB_BWR_PODLY_DLY2(base, index, value) (BME_BFI32(&PDB_PODLY_REG(base, index), ((uint32_t)(value) << PDB_PODLY_DLY2_SHIFT), PDB_PODLY_DLY2_SHIFT, PDB_PODLY_DLY2_WIDTH))
/*@}*/

/*!
 * @name Register PDB_PODLY, field DLY1[31:16] (RW)
 *
 * These bits specify the delay 1 value for the PDB Pulse-Out. Pulse-Out goes
 * high when the PDB counter is equal to the DLY1. Reading these bits returns the
 * value of internal register that is effective for the current PDB cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_PODLY_DLY1 field. */
#define PDB_RD_PODLY_DLY1(base, index) ((PDB_PODLY_REG(base, index) & PDB_PODLY_DLY1_MASK) >> PDB_PODLY_DLY1_SHIFT)
#define PDB_BRD_PODLY_DLY1(base, index) (BME_UBFX32(&PDB_PODLY_REG(base, index), PDB_PODLY_DLY1_SHIFT, PDB_PODLY_DLY1_WIDTH))

/*! @brief Set the DLY1 field to a new value. */
#define PDB_WR_PODLY_DLY1(base, index, value) (PDB_RMW_PODLY(base, index, PDB_PODLY_DLY1_MASK, PDB_PODLY_DLY1(value)))
#define PDB_BWR_PODLY_DLY1(base, index, value) (BME_BFI32(&PDB_PODLY_REG(base, index), ((uint32_t)(value) << PDB_PODLY_DLY1_SHIFT), PDB_PODLY_DLY1_SHIFT, PDB_PODLY_DLY1_WIDTH))
/*@}*/

