RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * RTC_DAYS - RTC Days and Day-of-Week Counters Register
 ******************************************************************************/

/*!
 * @brief RTC_DAYS - RTC Days and Day-of-Week Counters Register (RW)
 *
 * Reset value: 0x0001U
 *
 * This read/write register shows the current value of the day-of-week counter
 * and days counter. Reading this register returns the latest value of the counter
 * s . Writing to this register loads the value to the day-of-week and days
 * counters and the counters continue to count from this new value. The day-of-week
 * is not calculated automatically and should be written by CPU. This register is
 * unaffected by software reset. User software should first determine the state
 * of the INVAL bit in the STATUS (bit 0) to determine that the counters are
 * stable before their value can be read or changed. The assertion of INVAL bit
 * ensures that no operation is done at the boundary of a second when counters change
 * value.
 */
/*!
 * @name Constants and macros for entire RTC_DAYS register
 */
/*@{*/
#define RTC_RD_DAYS(base)        (RTC_DAYS_REG(base))
#define RTC_WR_DAYS(base, value) (RTC_DAYS_REG(base) = (value))
#define RTC_RMW_DAYS(base, mask, value) (RTC_WR_DAYS(base, (RTC_RD_DAYS(base) & ~(mask)) | (value)))
#define RTC_SET_DAYS(base, value) (BME_OR16(&RTC_DAYS_REG(base), (uint16_t)(value)))
#define RTC_CLR_DAYS(base, value) (BME_AND16(&RTC_DAYS_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_DAYS(base, value) (BME_XOR16(&RTC_DAYS_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_DAYS bitfields
 */

/*!
 * @name Register RTC_DAYS, field DAY_CNT[4:0] (RW)
 *
 * Valid values are '1' to '31'.
 */
/*@{*/
/*! @brief Read current value of the RTC_DAYS_DAY_CNT field. */
#define RTC_RD_DAYS_DAY_CNT(base) ((RTC_DAYS_REG(base) & RTC_DAYS_DAY_CNT_MASK) >> RTC_DAYS_DAY_CNT_SHIFT)
#define RTC_BRD_DAYS_DAY_CNT(base) (BME_UBFX16(&RTC_DAYS_REG(base), RTC_DAYS_DAY_CNT_SHIFT, RTC_DAYS_DAY_CNT_WIDTH))

/*! @brief Set the DAY_CNT field to a new value. */
#define RTC_WR_DAYS_DAY_CNT(base, value) (RTC_RMW_DAYS(base, RTC_DAYS_DAY_CNT_MASK, RTC_DAYS_DAY_CNT(value)))
#define RTC_BWR_DAYS_DAY_CNT(base, value) (BME_BFI16(&RTC_DAYS_REG(base), ((uint16_t)(value) << RTC_DAYS_DAY_CNT_SHIFT), RTC_DAYS_DAY_CNT_SHIFT, RTC_DAYS_DAY_CNT_WIDTH))
/*@}*/

/*!
 * @name Register RTC_DAYS, field DOW[10:8] (RW)
 *
 * Values:
 * - 0b000 - Sunday
 * - 0b001 - Monday
 */
/*@{*/
/*! @brief Read current value of the RTC_DAYS_DOW field. */
#define RTC_RD_DAYS_DOW(base) ((RTC_DAYS_REG(base) & RTC_DAYS_DOW_MASK) >> RTC_DAYS_DOW_SHIFT)
#define RTC_BRD_DAYS_DOW(base) (BME_UBFX16(&RTC_DAYS_REG(base), RTC_DAYS_DOW_SHIFT, RTC_DAYS_DOW_WIDTH))

/*! @brief Set the DOW field to a new value. */
#define RTC_WR_DAYS_DOW(base, value) (RTC_RMW_DAYS(base, RTC_DAYS_DOW_MASK, RTC_DAYS_DOW(value)))
#define RTC_BWR_DAYS_DOW(base, value) (BME_BFI16(&RTC_DAYS_REG(base), ((uint16_t)(value) << RTC_DAYS_DOW_SHIFT), RTC_DAYS_DOW_SHIFT, RTC_DAYS_DOW_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_HOURMIN - RTC Hours and Minutes Counters Register
 ******************************************************************************/

/*!
 * @brief RTC_HOURMIN - RTC Hours and Minutes Counters Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is used to program the hours and minutes counter. It can be
 * read anytime to get the current value of the counters. Only power-on reset can
 * reset this register. Hours counter can be set anything between 0 and 23. Minutes
 * counter can be set anything between 0 and 59. This register is unaffected by
 * software reset. User software should first determine the state of the INVAL
 * bit in the STATUS (bit 0) to determine that the counters are stable before their
 * value can be read or changed. The assertion of INVAL bit ensures that no
 * operation is done at the boundary of a second when counters change value.
 */
/*!
 * @name Constants and macros for entire RTC_HOURMIN register
 */
/*@{*/
#define RTC_RD_HOURMIN(base)     (RTC_HOURMIN_REG(base))
#define RTC_WR_HOURMIN(base, value) (RTC_HOURMIN_REG(base) = (value))
#define RTC_RMW_HOURMIN(base, mask, value) (RTC_WR_HOURMIN(base, (RTC_RD_HOURMIN(base) & ~(mask)) | (value)))
#define RTC_SET_HOURMIN(base, value) (BME_OR16(&RTC_HOURMIN_REG(base), (uint16_t)(value)))
#define RTC_CLR_HOURMIN(base, value) (BME_AND16(&RTC_HOURMIN_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_HOURMIN(base, value) (BME_XOR16(&RTC_HOURMIN_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_HOURMIN bitfields
 */

/*!
 * @name Register RTC_HOURMIN, field MIN_CNT[5:0] (RW)
 *
 * Valid count values are 0 to 59.
 */
/*@{*/
/*! @brief Read current value of the RTC_HOURMIN_MIN_CNT field. */
#define RTC_RD_HOURMIN_MIN_CNT(base) ((RTC_HOURMIN_REG(base) & RTC_HOURMIN_MIN_CNT_MASK) >> RTC_HOURMIN_MIN_CNT_SHIFT)
#define RTC_BRD_HOURMIN_MIN_CNT(base) (BME_UBFX16(&RTC_HOURMIN_REG(base), RTC_HOURMIN_MIN_CNT_SHIFT, RTC_HOURMIN_MIN_CNT_WIDTH))

/*! @brief Set the MIN_CNT field to a new value. */
#define RTC_WR_HOURMIN_MIN_CNT(base, value) (RTC_RMW_HOURMIN(base, RTC_HOURMIN_MIN_CNT_MASK, RTC_HOURMIN_MIN_CNT(value)))
#define RTC_BWR_HOURMIN_MIN_CNT(base, value) (BME_BFI16(&RTC_HOURMIN_REG(base), ((uint16_t)(value) << RTC_HOURMIN_MIN_CNT_SHIFT), RTC_HOURMIN_MIN_CNT_SHIFT, RTC_HOURMIN_MIN_CNT_WIDTH))
/*@}*/

/*!
 * @name Register RTC_HOURMIN, field HOUR_CNT[12:8] (RW)
 *
 * Valid count values are 0 to 23.
 */
/*@{*/
/*! @brief Read current value of the RTC_HOURMIN_HOUR_CNT field. */
#define RTC_RD_HOURMIN_HOUR_CNT(base) ((RTC_HOURMIN_REG(base) & RTC_HOURMIN_HOUR_CNT_MASK) >> RTC_HOURMIN_HOUR_CNT_SHIFT)
#define RTC_BRD_HOURMIN_HOUR_CNT(base) (BME_UBFX16(&RTC_HOURMIN_REG(base), RTC_HOURMIN_HOUR_CNT_SHIFT, RTC_HOURMIN_HOUR_CNT_WIDTH))

/*! @brief Set the HOUR_CNT field to a new value. */
#define RTC_WR_HOURMIN_HOUR_CNT(base, value) (RTC_RMW_HOURMIN(base, RTC_HOURMIN_HOUR_CNT_MASK, RTC_HOURMIN_HOUR_CNT(value)))
#define RTC_BWR_HOURMIN_HOUR_CNT(base, value) (BME_BFI16(&RTC_HOURMIN_REG(base), ((uint16_t)(value) << RTC_HOURMIN_HOUR_CNT_SHIFT), RTC_HOURMIN_HOUR_CNT_SHIFT, RTC_HOURMIN_HOUR_CNT_WIDTH))
/*@}*/

