RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * RTC_SECONDS - RTC Seconds Counters Register
 ******************************************************************************/

/*!
 * @brief RTC_SECONDS - RTC Seconds Counters Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is used to program the seconds counter. It can be read anytime
 * to get the current value of the counter. Only power-on reset can reset this
 * register. Seconds counter can be set anything between 0 and 59 both included.
 * This register is unaffected by software reset. User software should first
 * determine the state of the INVAL bit in the STATUS (bit 0) to determine that the
 * counters are stable before their value can be read or changed. The assertion of
 * INVAL bit ensures that no operation is done at the boundary of a second when
 * counters change value.
 */
/*!
 * @name Constants and macros for entire RTC_SECONDS register
 */
/*@{*/
#define RTC_RD_SECONDS(base)     (RTC_SECONDS_REG(base))
#define RTC_WR_SECONDS(base, value) (RTC_SECONDS_REG(base) = (value))
#define RTC_RMW_SECONDS(base, mask, value) (RTC_WR_SECONDS(base, (RTC_RD_SECONDS(base) & ~(mask)) | (value)))
#define RTC_SET_SECONDS(base, value) (BME_OR16(&RTC_SECONDS_REG(base), (uint16_t)(value)))
#define RTC_CLR_SECONDS(base, value) (BME_AND16(&RTC_SECONDS_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_SECONDS(base, value) (BME_XOR16(&RTC_SECONDS_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_SECONDS bitfields
 */

/*!
 * @name Register RTC_SECONDS, field SEC_CNT[5:0] (RW)
 *
 * Valid count values are 0 to 59.
 */
/*@{*/
/*! @brief Read current value of the RTC_SECONDS_SEC_CNT field. */
#define RTC_RD_SECONDS_SEC_CNT(base) ((RTC_SECONDS_REG(base) & RTC_SECONDS_SEC_CNT_MASK) >> RTC_SECONDS_SEC_CNT_SHIFT)
#define RTC_BRD_SECONDS_SEC_CNT(base) (BME_UBFX16(&RTC_SECONDS_REG(base), RTC_SECONDS_SEC_CNT_SHIFT, RTC_SECONDS_SEC_CNT_WIDTH))

/*! @brief Set the SEC_CNT field to a new value. */
#define RTC_WR_SECONDS_SEC_CNT(base, value) (RTC_RMW_SECONDS(base, RTC_SECONDS_SEC_CNT_MASK, RTC_SECONDS_SEC_CNT(value)))
#define RTC_BWR_SECONDS_SEC_CNT(base, value) (BME_BFI16(&RTC_SECONDS_REG(base), ((uint16_t)(value) << RTC_SECONDS_SEC_CNT_SHIFT), RTC_SECONDS_SEC_CNT_SHIFT, RTC_SECONDS_SEC_CNT_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_ALM_YEARMON - RTC Year and Months Alarm Register
 ******************************************************************************/

/*!
 * @brief RTC_ALM_YEARMON - RTC Year and Months Alarm Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is used to configure the months and year setting of the alarm.
 * The alarm setting can be read or written anytime. This register is reset to
 * its default state on software reset. Alarm interrupt bit is set when all values
 * of alarm seconds, minutes, hours, days, month, and year match their respective
 * counter values. User software can configure the type of alarm using the
 * ALM_TYPE bits in the CTRL register.
 */
/*!
 * @name Constants and macros for entire RTC_ALM_YEARMON register
 */
/*@{*/
#define RTC_RD_ALM_YEARMON(base) (RTC_ALM_YEARMON_REG(base))
#define RTC_WR_ALM_YEARMON(base, value) (RTC_ALM_YEARMON_REG(base) = (value))
#define RTC_RMW_ALM_YEARMON(base, mask, value) (RTC_WR_ALM_YEARMON(base, (RTC_RD_ALM_YEARMON(base) & ~(mask)) | (value)))
#define RTC_SET_ALM_YEARMON(base, value) (BME_OR16(&RTC_ALM_YEARMON_REG(base), (uint16_t)(value)))
#define RTC_CLR_ALM_YEARMON(base, value) (BME_AND16(&RTC_ALM_YEARMON_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_ALM_YEARMON(base, value) (BME_XOR16(&RTC_ALM_YEARMON_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_ALM_YEARMON bitfields
 */

/*!
 * @name Register RTC_ALM_YEARMON, field ALM_MON[3:0] (RW)
 *
 * Same as Months Counter Value in YEARMONRTC Year and Month Counters Register .
 */
/*@{*/
/*! @brief Read current value of the RTC_ALM_YEARMON_ALM_MON field. */
#define RTC_RD_ALM_YEARMON_ALM_MON(base) ((RTC_ALM_YEARMON_REG(base) & RTC_ALM_YEARMON_ALM_MON_MASK) >> RTC_ALM_YEARMON_ALM_MON_SHIFT)
#define RTC_BRD_ALM_YEARMON_ALM_MON(base) (BME_UBFX16(&RTC_ALM_YEARMON_REG(base), RTC_ALM_YEARMON_ALM_MON_SHIFT, RTC_ALM_YEARMON_ALM_MON_WIDTH))

/*! @brief Set the ALM_MON field to a new value. */
#define RTC_WR_ALM_YEARMON_ALM_MON(base, value) (RTC_RMW_ALM_YEARMON(base, RTC_ALM_YEARMON_ALM_MON_MASK, RTC_ALM_YEARMON_ALM_MON(value)))
#define RTC_BWR_ALM_YEARMON_ALM_MON(base, value) (BME_BFI16(&RTC_ALM_YEARMON_REG(base), ((uint16_t)(value) << RTC_ALM_YEARMON_ALM_MON_SHIFT), RTC_ALM_YEARMON_ALM_MON_SHIFT, RTC_ALM_YEARMON_ALM_MON_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ALM_YEARMON, field ALM_YEAR[15:8] (RW)
 *
 * Same as Years Offset Value in YEARMONRTC Year and Month Counters Register .
 */
/*@{*/
/*! @brief Read current value of the RTC_ALM_YEARMON_ALM_YEAR field. */
#define RTC_RD_ALM_YEARMON_ALM_YEAR(base) ((RTC_ALM_YEARMON_REG(base) & RTC_ALM_YEARMON_ALM_YEAR_MASK) >> RTC_ALM_YEARMON_ALM_YEAR_SHIFT)
#define RTC_BRD_ALM_YEARMON_ALM_YEAR(base) (BME_UBFX16(&RTC_ALM_YEARMON_REG(base), RTC_ALM_YEARMON_ALM_YEAR_SHIFT, RTC_ALM_YEARMON_ALM_YEAR_WIDTH))

/*! @brief Set the ALM_YEAR field to a new value. */
#define RTC_WR_ALM_YEARMON_ALM_YEAR(base, value) (RTC_RMW_ALM_YEARMON(base, RTC_ALM_YEARMON_ALM_YEAR_MASK, RTC_ALM_YEARMON_ALM_YEAR(value)))
#define RTC_BWR_ALM_YEARMON_ALM_YEAR(base, value) (BME_BFI16(&RTC_ALM_YEARMON_REG(base), ((uint16_t)(value) << RTC_ALM_YEARMON_ALM_YEAR_SHIFT), RTC_ALM_YEARMON_ALM_YEAR_SHIFT, RTC_ALM_YEARMON_ALM_YEAR_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_ALM_DAYS - RTC Days Alarm Register
 ******************************************************************************/

/*!
 * @brief RTC_ALM_DAYS - RTC Days Alarm Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The days alarm register is used to configure the day setting of the alarm.
 * The alarm setting can be read or written anytime. This register is reset to its
 * default state on software reset. Alarm interrupt bit is set when all values of
 * alarm seconds, minutes, hours, days, month and year match their respective
 * counter values. User software can configure the type of alarm using the ALM_TYPE
 * bits in the CTRL register.
 */
/*!
 * @name Constants and macros for entire RTC_ALM_DAYS register
 */
/*@{*/
#define RTC_RD_ALM_DAYS(base)    (RTC_ALM_DAYS_REG(base))
#define RTC_WR_ALM_DAYS(base, value) (RTC_ALM_DAYS_REG(base) = (value))
#define RTC_RMW_ALM_DAYS(base, mask, value) (RTC_WR_ALM_DAYS(base, (RTC_RD_ALM_DAYS(base) & ~(mask)) | (value)))
#define RTC_SET_ALM_DAYS(base, value) (BME_OR16(&RTC_ALM_DAYS_REG(base), (uint16_t)(value)))
#define RTC_CLR_ALM_DAYS(base, value) (BME_AND16(&RTC_ALM_DAYS_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_ALM_DAYS(base, value) (BME_XOR16(&RTC_ALM_DAYS_REG(base), (uint16_t)(value)))
/*@}*/

