RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * SIM_CTRL_REG - System Control Register
 ******************************************************************************/

/*!
 * @brief SIM_CTRL_REG - System Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_CTRL_REG register
 */
/*@{*/
#define SIM_RD_CTRL_REG(base)    (SIM_CTRL_REG_REG(base))
#define SIM_WR_CTRL_REG(base, value) (SIM_CTRL_REG_REG(base) = (value))
#define SIM_RMW_CTRL_REG(base, mask, value) (SIM_WR_CTRL_REG(base, (SIM_RD_CTRL_REG(base) & ~(mask)) | (value)))
#define SIM_SET_CTRL_REG(base, value) (BME_OR32(&SIM_CTRL_REG_REG(base), (uint32_t)(value)))
#define SIM_CLR_CTRL_REG(base, value) (BME_AND32(&SIM_CTRL_REG_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_CTRL_REG(base, value) (BME_XOR32(&SIM_CTRL_REG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CTRL_REG bitfields
 */

/*!
 * @name Register SIM_CTRL_REG, field NMIDIS[0] (RW)
 *
 * This field is used as an alternate to FTFL_FOPT[2] to disable the NMI
 * temporarily. It is also advised to program this bit while changing the state of the
 * NMI pin from NMI to GPIO functionality.
 *
 * Values:
 * - 0b0 - NMI enabled
 * - 0b1 - NMI disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_NMIDIS field. */
#define SIM_RD_CTRL_REG_NMIDIS(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_NMIDIS_MASK) >> SIM_CTRL_REG_NMIDIS_SHIFT)
#define SIM_BRD_CTRL_REG_NMIDIS(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_NMIDIS_SHIFT, SIM_CTRL_REG_NMIDIS_WIDTH))

/*! @brief Set the NMIDIS field to a new value. */
#define SIM_WR_CTRL_REG_NMIDIS(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_NMIDIS_MASK, SIM_CTRL_REG_NMIDIS(value)))
#define SIM_BWR_CTRL_REG_NMIDIS(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_NMIDIS_SHIFT), SIM_CTRL_REG_NMIDIS_SHIFT, SIM_CTRL_REG_NMIDIS_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field PLLVLPEN[1] (RW)
 *
 * When set, this bit enables the PLL in VLP modes. Valid operating mode
 * transitions with PLLVLPEN enabled are: RUN->VLPR(also with PSTOP1)->RUN and
 * RUN->VLPR(+PSTOP1)->RESET. MCG must be set to BLPI mode by software, if PLLVLPEN is
 * enabled before entering VLPR mode. Prior to entering any low power mode, disable
 * PLLVLPEN. When in VLPR mode with PLL module operating, do not disable the PMC
 * bandgap.
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_PLLVLPEN field. */
#define SIM_RD_CTRL_REG_PLLVLPEN(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_PLLVLPEN_MASK) >> SIM_CTRL_REG_PLLVLPEN_SHIFT)
#define SIM_BRD_CTRL_REG_PLLVLPEN(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_PLLVLPEN_SHIFT, SIM_CTRL_REG_PLLVLPEN_WIDTH))

/*! @brief Set the PLLVLPEN field to a new value. */
#define SIM_WR_CTRL_REG_PLLVLPEN(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_PLLVLPEN_MASK, SIM_CTRL_REG_PLLVLPEN(value)))
#define SIM_BWR_CTRL_REG_PLLVLPEN(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_PLLVLPEN_SHIFT), SIM_CTRL_REG_PLLVLPEN_SHIFT, SIM_CTRL_REG_PLLVLPEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field ADCTRGSEL[4:3] (RW)
 *
 * Selects the clock used to generate the ADC triggers.
 *
 * Values:
 * - 0b00 - Bus ClockDuring Low Power Modes such as stop, the Bus clock is not
 *     available for conversion and should not be selected in case a conversion
 *     needs to be performed while in stop.
 * - 0b01 - ADC asynchronous Clock
 * - 0b10 - ERCLK32K
 * - 0b11 - OSCCLK
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_ADCTRGSEL field. */
#define SIM_RD_CTRL_REG_ADCTRGSEL(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_ADCTRGSEL_MASK) >> SIM_CTRL_REG_ADCTRGSEL_SHIFT)
#define SIM_BRD_CTRL_REG_ADCTRGSEL(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_ADCTRGSEL_SHIFT, SIM_CTRL_REG_ADCTRGSEL_WIDTH))

/*! @brief Set the ADCTRGSEL field to a new value. */
#define SIM_WR_CTRL_REG_ADCTRGSEL(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_ADCTRGSEL_MASK, SIM_CTRL_REG_ADCTRGSEL(value)))
#define SIM_BWR_CTRL_REG_ADCTRGSEL(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_ADCTRGSEL_SHIFT), SIM_CTRL_REG_ADCTRGSEL_SHIFT, SIM_CTRL_REG_ADCTRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field CLKOUT[7:5] (RW)
 *
 * This field can be used to select one of the following clocks for CLKOUT pin.
 *
 * Values:
 * - 0b000 - Disabled
 * - 0b001 - Gated Core Clk
 * - 0b010 - Bus Clk
 * - 0b011 - LPO clock from PMC
 * - 0b100 - IRC clock from MCG
 * - 0b101 - Muxed 32Khz source (please refer to SOPT1[19:18] for possible
 *     options)
 * - 0b110 - MHz Oscillator external reference clock
 * - 0b111 - PLL clock output from MCG
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_CLKOUT field. */
#define SIM_RD_CTRL_REG_CLKOUT(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_CLKOUT_MASK) >> SIM_CTRL_REG_CLKOUT_SHIFT)
#define SIM_BRD_CTRL_REG_CLKOUT(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_CLKOUT_SHIFT, SIM_CTRL_REG_CLKOUT_WIDTH))

/*! @brief Set the CLKOUT field to a new value. */
#define SIM_WR_CTRL_REG_CLKOUT(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_CLKOUT_MASK, SIM_CTRL_REG_CLKOUT(value)))
#define SIM_BWR_CTRL_REG_CLKOUT(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_CLKOUT_SHIFT), SIM_CTRL_REG_CLKOUT_SHIFT, SIM_CTRL_REG_CLKOUT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SPI0_INV0[8] (RW)
 *
 * This bit inverts the SPI0 signal output.
 *
 * Values:
 * - 0b0 - not inverted
 * - 0b1 - inverts SS
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SPI0_INV0 field. */
#define SIM_RD_CTRL_REG_SPI0_INV0(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SPI0_INV0_MASK) >> SIM_CTRL_REG_SPI0_INV0_SHIFT)
#define SIM_BRD_CTRL_REG_SPI0_INV0(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SPI0_INV0_SHIFT, SIM_CTRL_REG_SPI0_INV0_WIDTH))

/*! @brief Set the SPI0_INV0 field to a new value. */
#define SIM_WR_CTRL_REG_SPI0_INV0(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SPI0_INV0_MASK, SIM_CTRL_REG_SPI0_INV0(value)))
#define SIM_BWR_CTRL_REG_SPI0_INV0(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SPI0_INV0_SHIFT), SIM_CTRL_REG_SPI0_INV0_SHIFT, SIM_CTRL_REG_SPI0_INV0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SPI0_INV1[9] (RW)
 *
 * This bit inverts the SPI0 signal output.
 *
 * Values:
 * - 0b0 - not inverted
 * - 0b1 - inverts SCK
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SPI0_INV1 field. */
#define SIM_RD_CTRL_REG_SPI0_INV1(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SPI0_INV1_MASK) >> SIM_CTRL_REG_SPI0_INV1_SHIFT)
#define SIM_BRD_CTRL_REG_SPI0_INV1(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SPI0_INV1_SHIFT, SIM_CTRL_REG_SPI0_INV1_WIDTH))

/*! @brief Set the SPI0_INV1 field to a new value. */
#define SIM_WR_CTRL_REG_SPI0_INV1(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SPI0_INV1_MASK, SIM_CTRL_REG_SPI0_INV1(value)))
#define SIM_BWR_CTRL_REG_SPI0_INV1(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SPI0_INV1_SHIFT), SIM_CTRL_REG_SPI0_INV1_SHIFT, SIM_CTRL_REG_SPI0_INV1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SPI0_INV2[10] (RW)
 *
 * This bit inverts the SPI0 signal output.
 *
 * Values:
 * - 0b0 - not inverted
 * - 0b1 - inverts MOSI
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SPI0_INV2 field. */
#define SIM_RD_CTRL_REG_SPI0_INV2(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SPI0_INV2_MASK) >> SIM_CTRL_REG_SPI0_INV2_SHIFT)
#define SIM_BRD_CTRL_REG_SPI0_INV2(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SPI0_INV2_SHIFT, SIM_CTRL_REG_SPI0_INV2_WIDTH))

/*! @brief Set the SPI0_INV2 field to a new value. */
#define SIM_WR_CTRL_REG_SPI0_INV2(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SPI0_INV2_MASK, SIM_CTRL_REG_SPI0_INV2(value)))
#define SIM_BWR_CTRL_REG_SPI0_INV2(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SPI0_INV2_SHIFT), SIM_CTRL_REG_SPI0_INV2_SHIFT, SIM_CTRL_REG_SPI0_INV2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SPI0_INV3[11] (RW)
 *
 * This bit inverts the SPI0 signal output.
 *
 * Values:
 * - 0b0 - not inverted
 * - 0b1 - inverts MISO
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SPI0_INV3 field. */
#define SIM_RD_CTRL_REG_SPI0_INV3(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SPI0_INV3_MASK) >> SIM_CTRL_REG_SPI0_INV3_SHIFT)
#define SIM_BRD_CTRL_REG_SPI0_INV3(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SPI0_INV3_SHIFT, SIM_CTRL_REG_SPI0_INV3_WIDTH))

/*! @brief Set the SPI0_INV3 field to a new value. */
#define SIM_WR_CTRL_REG_SPI0_INV3(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SPI0_INV3_MASK, SIM_CTRL_REG_SPI0_INV3(value)))
#define SIM_BWR_CTRL_REG_SPI0_INV3(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SPI0_INV3_SHIFT), SIM_CTRL_REG_SPI0_INV3_SHIFT, SIM_CTRL_REG_SPI0_INV3_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SPI1_INV0[12] (RW)
 *
 * This bit inverts the SPI1 signal output.
 *
 * Values:
 * - 0b0 - not inverted
 * - 0b1 - inverts SS
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SPI1_INV0 field. */
#define SIM_RD_CTRL_REG_SPI1_INV0(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SPI1_INV0_MASK) >> SIM_CTRL_REG_SPI1_INV0_SHIFT)
#define SIM_BRD_CTRL_REG_SPI1_INV0(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SPI1_INV0_SHIFT, SIM_CTRL_REG_SPI1_INV0_WIDTH))

