RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the SPI1_INV0 field to a new value. */
#define SIM_WR_CTRL_REG_SPI1_INV0(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SPI1_INV0_MASK, SIM_CTRL_REG_SPI1_INV0(value)))
#define SIM_BWR_CTRL_REG_SPI1_INV0(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SPI1_INV0_SHIFT), SIM_CTRL_REG_SPI1_INV0_SHIFT, SIM_CTRL_REG_SPI1_INV0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SPI1_INV1[13] (RW)
 *
 * This bit inverts the SPI1 signal output.
 *
 * Values:
 * - 0b0 - not inverted
 * - 0b1 - inverts SCK
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SPI1_INV1 field. */
#define SIM_RD_CTRL_REG_SPI1_INV1(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SPI1_INV1_MASK) >> SIM_CTRL_REG_SPI1_INV1_SHIFT)
#define SIM_BRD_CTRL_REG_SPI1_INV1(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SPI1_INV1_SHIFT, SIM_CTRL_REG_SPI1_INV1_WIDTH))

/*! @brief Set the SPI1_INV1 field to a new value. */
#define SIM_WR_CTRL_REG_SPI1_INV1(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SPI1_INV1_MASK, SIM_CTRL_REG_SPI1_INV1(value)))
#define SIM_BWR_CTRL_REG_SPI1_INV1(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SPI1_INV1_SHIFT), SIM_CTRL_REG_SPI1_INV1_SHIFT, SIM_CTRL_REG_SPI1_INV1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SPI1_INV2[14] (RW)
 *
 * This bit inverts the SPI1 signal output.
 *
 * Values:
 * - 0b0 - not inverted
 * - 0b1 - inverts MOSI
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SPI1_INV2 field. */
#define SIM_RD_CTRL_REG_SPI1_INV2(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SPI1_INV2_MASK) >> SIM_CTRL_REG_SPI1_INV2_SHIFT)
#define SIM_BRD_CTRL_REG_SPI1_INV2(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SPI1_INV2_SHIFT, SIM_CTRL_REG_SPI1_INV2_WIDTH))

/*! @brief Set the SPI1_INV2 field to a new value. */
#define SIM_WR_CTRL_REG_SPI1_INV2(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SPI1_INV2_MASK, SIM_CTRL_REG_SPI1_INV2(value)))
#define SIM_BWR_CTRL_REG_SPI1_INV2(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SPI1_INV2_SHIFT), SIM_CTRL_REG_SPI1_INV2_SHIFT, SIM_CTRL_REG_SPI1_INV2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field SPI1_INV3[15] (RW)
 *
 * This bit inverts the SPI1 signal output.
 *
 * Values:
 * - 0b0 - not inverted
 * - 0b1 - inverts MISO
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_SPI1_INV3 field. */
#define SIM_RD_CTRL_REG_SPI1_INV3(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_SPI1_INV3_MASK) >> SIM_CTRL_REG_SPI1_INV3_SHIFT)
#define SIM_BRD_CTRL_REG_SPI1_INV3(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_SPI1_INV3_SHIFT, SIM_CTRL_REG_SPI1_INV3_WIDTH))

/*! @brief Set the SPI1_INV3 field to a new value. */
#define SIM_WR_CTRL_REG_SPI1_INV3(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_SPI1_INV3_MASK, SIM_CTRL_REG_SPI1_INV3(value)))
#define SIM_BWR_CTRL_REG_SPI1_INV3(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_SPI1_INV3_SHIFT), SIM_CTRL_REG_SPI1_INV3_SHIFT, SIM_CTRL_REG_SPI1_INV3_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field PLLFLLSEL[17:16] (RW)
 *
 * This bitfield configures the MCGPLLCLK/MCGFLLCLK.
 *
 * Values:
 * - 0b00 - MCGFLLCLK
 * - 0b01 - MCGPLLCLK
 * - 0b10 - BUSCLK
 * - 0b11 - OSC32KCLK (RTC Oscillator output)
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_PLLFLLSEL field. */
#define SIM_RD_CTRL_REG_PLLFLLSEL(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_PLLFLLSEL_MASK) >> SIM_CTRL_REG_PLLFLLSEL_SHIFT)
#define SIM_BRD_CTRL_REG_PLLFLLSEL(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_PLLFLLSEL_SHIFT, SIM_CTRL_REG_PLLFLLSEL_WIDTH))

/*! @brief Set the PLLFLLSEL field to a new value. */
#define SIM_WR_CTRL_REG_PLLFLLSEL(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_PLLFLLSEL_MASK, SIM_CTRL_REG_PLLFLLSEL(value)))
#define SIM_BWR_CTRL_REG_PLLFLLSEL(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_PLLFLLSEL_SHIFT), SIM_CTRL_REG_PLLFLLSEL_SHIFT, SIM_CTRL_REG_PLLFLLSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field XBARCLKOUT[23:21] (RW)
 *
 * Selects the clock to XBAR_IN[5]
 *
 * Values:
 * - 0b000 - Disabled
 * - 0b001 - Gated Core Clk
 * - 0b010 - Bus Clk
 * - 0b011 - LPO clock from PMC
 * - 0b100 - IRC clock from MCG
 * - 0b101 - MUXed 32 kHz source (please refer to SOPT1[19:18] for possible
 *     options)
 * - 0b110 - MHz Oscillator external reference clock
 * - 0b111 - PLL clock output from MCG
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_XBARCLKOUT field. */
#define SIM_RD_CTRL_REG_XBARCLKOUT(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_XBARCLKOUT_MASK) >> SIM_CTRL_REG_XBARCLKOUT_SHIFT)
#define SIM_BRD_CTRL_REG_XBARCLKOUT(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_XBARCLKOUT_SHIFT, SIM_CTRL_REG_XBARCLKOUT_WIDTH))

/*! @brief Set the XBARCLKOUT field to a new value. */
#define SIM_WR_CTRL_REG_XBARCLKOUT(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_XBARCLKOUT_MASK, SIM_CTRL_REG_XBARCLKOUT(value)))
#define SIM_BWR_CTRL_REG_XBARCLKOUT(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_XBARCLKOUT_SHIFT), SIM_CTRL_REG_XBARCLKOUT_SHIFT, SIM_CTRL_REG_XBARCLKOUT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field AFEOUTCLKSEL[24] (RW)
 *
 * Values:
 * - 0b0 - AFE output clock is divided by AFE clock prescaler.
 * - 0b1 - AFE output clock is NOT divided by AFE clock prescaler.
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_AFEOUTCLKSEL field. */
#define SIM_RD_CTRL_REG_AFEOUTCLKSEL(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_AFEOUTCLKSEL_MASK) >> SIM_CTRL_REG_AFEOUTCLKSEL_SHIFT)
#define SIM_BRD_CTRL_REG_AFEOUTCLKSEL(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_AFEOUTCLKSEL_SHIFT, SIM_CTRL_REG_AFEOUTCLKSEL_WIDTH))

/*! @brief Set the AFEOUTCLKSEL field to a new value. */
#define SIM_WR_CTRL_REG_AFEOUTCLKSEL(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_AFEOUTCLKSEL_MASK, SIM_CTRL_REG_AFEOUTCLKSEL(value)))
#define SIM_BWR_CTRL_REG_AFEOUTCLKSEL(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_AFEOUTCLKSEL_SHIFT), SIM_CTRL_REG_AFEOUTCLKSEL_SHIFT, SIM_CTRL_REG_AFEOUTCLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field LPUARTSRC[27:26] (RW)
 *
 * Values:
 * - 0b00 - Clock disabled
 * - 0b01 - MCGPLLCLK/MCGFLLCLK
 * - 0b10 - OSCERCLK
 * - 0b11 - MCGIRCLK
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_LPUARTSRC field. */
#define SIM_RD_CTRL_REG_LPUARTSRC(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_LPUARTSRC_MASK) >> SIM_CTRL_REG_LPUARTSRC_SHIFT)
#define SIM_BRD_CTRL_REG_LPUARTSRC(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_LPUARTSRC_SHIFT, SIM_CTRL_REG_LPUARTSRC_WIDTH))

/*! @brief Set the LPUARTSRC field to a new value. */
#define SIM_WR_CTRL_REG_LPUARTSRC(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_LPUARTSRC_MASK, SIM_CTRL_REG_LPUARTSRC(value)))
#define SIM_BWR_CTRL_REG_LPUARTSRC(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_LPUARTSRC_SHIFT), SIM_CTRL_REG_LPUARTSRC_SHIFT, SIM_CTRL_REG_LPUARTSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CTRL_REG, field TMRFREEZE[31] (RW)
 *
 * Values:
 * - 0b0 - QTMR counters operate normally.
 * - 0b1 - QTMR counters and OFLAGs are reset. Clearing this bit will resume
 *     QTMR operation.
 */
/*@{*/
/*! @brief Read current value of the SIM_CTRL_REG_TMRFREEZE field. */
#define SIM_RD_CTRL_REG_TMRFREEZE(base) ((SIM_CTRL_REG_REG(base) & SIM_CTRL_REG_TMRFREEZE_MASK) >> SIM_CTRL_REG_TMRFREEZE_SHIFT)
#define SIM_BRD_CTRL_REG_TMRFREEZE(base) (BME_UBFX32(&SIM_CTRL_REG_REG(base), SIM_CTRL_REG_TMRFREEZE_SHIFT, SIM_CTRL_REG_TMRFREEZE_WIDTH))

/*! @brief Set the TMRFREEZE field to a new value. */
#define SIM_WR_CTRL_REG_TMRFREEZE(base, value) (SIM_RMW_CTRL_REG(base, SIM_CTRL_REG_TMRFREEZE_MASK, SIM_CTRL_REG_TMRFREEZE(value)))
#define SIM_BWR_CTRL_REG_TMRFREEZE(base, value) (BME_BFI32(&SIM_CTRL_REG_REG(base), ((uint32_t)(value) << SIM_CTRL_REG_TMRFREEZE_SHIFT), SIM_CTRL_REG_TMRFREEZE_SHIFT, SIM_CTRL_REG_TMRFREEZE_WIDTH))
/*@}*/

