RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the PORTC field to a new value. */
#define SIM_WR_SCGC5_PORTC(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTC_MASK, SIM_SCGC5_PORTC(value)))
#define SIM_BWR_SCGC5_PORTC(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTC_SHIFT), SIM_SCGC5_PORTC_SHIFT, SIM_SCGC5_PORTC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTD[9] (RW)
 *
 * This bit controls the clock gate to the PCTLD module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTD field. */
#define SIM_RD_SCGC5_PORTD(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTD_MASK) >> SIM_SCGC5_PORTD_SHIFT)
#define SIM_BRD_SCGC5_PORTD(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTD_SHIFT, SIM_SCGC5_PORTD_WIDTH))

/*! @brief Set the PORTD field to a new value. */
#define SIM_WR_SCGC5_PORTD(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTD_MASK, SIM_SCGC5_PORTD(value)))
#define SIM_BWR_SCGC5_PORTD(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTD_SHIFT), SIM_SCGC5_PORTD_SHIFT, SIM_SCGC5_PORTD_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTE[10] (RW)
 *
 * This bit controls the clock gate to the PCTLE module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTE field. */
#define SIM_RD_SCGC5_PORTE(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTE_MASK) >> SIM_SCGC5_PORTE_SHIFT)
#define SIM_BRD_SCGC5_PORTE(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTE_SHIFT, SIM_SCGC5_PORTE_WIDTH))

/*! @brief Set the PORTE field to a new value. */
#define SIM_WR_SCGC5_PORTE(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTE_MASK, SIM_SCGC5_PORTE(value)))
#define SIM_BWR_SCGC5_PORTE(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTE_SHIFT), SIM_SCGC5_PORTE_SHIFT, SIM_SCGC5_PORTE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTF[11] (RW)
 *
 * This bit controls the clock gate to the PCTLF module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTF field. */
#define SIM_RD_SCGC5_PORTF(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTF_MASK) >> SIM_SCGC5_PORTF_SHIFT)
#define SIM_BRD_SCGC5_PORTF(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTF_SHIFT, SIM_SCGC5_PORTF_WIDTH))

/*! @brief Set the PORTF field to a new value. */
#define SIM_WR_SCGC5_PORTF(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTF_MASK, SIM_SCGC5_PORTF(value)))
#define SIM_BWR_SCGC5_PORTF(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTF_SHIFT), SIM_SCGC5_PORTF_SHIFT, SIM_SCGC5_PORTF_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTG[12] (RW)
 *
 * This bit controls the clock gate to the PCTLG module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTG field. */
#define SIM_RD_SCGC5_PORTG(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTG_MASK) >> SIM_SCGC5_PORTG_SHIFT)
#define SIM_BRD_SCGC5_PORTG(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTG_SHIFT, SIM_SCGC5_PORTG_WIDTH))

/*! @brief Set the PORTG field to a new value. */
#define SIM_WR_SCGC5_PORTG(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTG_MASK, SIM_SCGC5_PORTG(value)))
#define SIM_BWR_SCGC5_PORTG(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTG_SHIFT), SIM_SCGC5_PORTG_SHIFT, SIM_SCGC5_PORTG_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTH[13] (RW)
 *
 * This bit controls the clock gate to the PCTLH module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTH field. */
#define SIM_RD_SCGC5_PORTH(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTH_MASK) >> SIM_SCGC5_PORTH_SHIFT)
#define SIM_BRD_SCGC5_PORTH(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTH_SHIFT, SIM_SCGC5_PORTH_WIDTH))

/*! @brief Set the PORTH field to a new value. */
#define SIM_WR_SCGC5_PORTH(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTH_MASK, SIM_SCGC5_PORTH(value)))
#define SIM_BWR_SCGC5_PORTH(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTH_SHIFT), SIM_SCGC5_PORTH_SHIFT, SIM_SCGC5_PORTH_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTI[14] (RW)
 *
 * This bit controls the clock gate to the PCTLI module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTI field. */
#define SIM_RD_SCGC5_PORTI(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTI_MASK) >> SIM_SCGC5_PORTI_SHIFT)
#define SIM_BRD_SCGC5_PORTI(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTI_SHIFT, SIM_SCGC5_PORTI_WIDTH))

/*! @brief Set the PORTI field to a new value. */
#define SIM_WR_SCGC5_PORTI(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTI_MASK, SIM_SCGC5_PORTI(value)))
#define SIM_BWR_SCGC5_PORTI(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_PORTI_SHIFT), SIM_SCGC5_PORTI_SHIFT, SIM_SCGC5_PORTI_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field RTC[16] (RW)
 *
 * This bit controls the clock gate to the iRTC module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_RTC field. */
#define SIM_RD_SCGC5_RTC(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_RTC_MASK) >> SIM_SCGC5_RTC_SHIFT)
#define SIM_BRD_SCGC5_RTC(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_RTC_SHIFT, SIM_SCGC5_RTC_WIDTH))

/*! @brief Set the RTC field to a new value. */
#define SIM_WR_SCGC5_RTC(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_RTC_MASK, SIM_SCGC5_RTC(value)))
#define SIM_BWR_SCGC5_RTC(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_RTC_SHIFT), SIM_SCGC5_RTC_SHIFT, SIM_SCGC5_RTC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field RTCREG[17] (RW)
 *
 * This bit controls the clock gate to the iRTC_REG_FILE.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_RTCREG field. */
#define SIM_RD_SCGC5_RTCREG(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_RTCREG_MASK) >> SIM_SCGC5_RTCREG_SHIFT)
#define SIM_BRD_SCGC5_RTCREG(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_RTCREG_SHIFT, SIM_SCGC5_RTCREG_WIDTH))

