RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the RTCREG field to a new value. */
#define SIM_WR_SCGC5_RTCREG(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_RTCREG_MASK, SIM_SCGC5_RTCREG(value)))
#define SIM_BWR_SCGC5_RTCREG(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_RTCREG_SHIFT), SIM_SCGC5_RTCREG_SHIFT, SIM_SCGC5_RTCREG_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field XBAR[21] (RW)
 *
 * This bit controls the clock gate to the XBAR module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_XBAR field. */
#define SIM_RD_SCGC5_XBAR(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_XBAR_MASK) >> SIM_SCGC5_XBAR_SHIFT)
#define SIM_BRD_SCGC5_XBAR(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_XBAR_SHIFT, SIM_SCGC5_XBAR_WIDTH))

/*! @brief Set the XBAR field to a new value. */
#define SIM_WR_SCGC5_XBAR(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_XBAR_MASK, SIM_SCGC5_XBAR(value)))
#define SIM_BWR_SCGC5_XBAR(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_XBAR_SHIFT), SIM_SCGC5_XBAR_SHIFT, SIM_SCGC5_XBAR_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field TMR0[23] (RW)
 *
 * This bit controls the clock gate to the QTMR0_TMR0.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_TMR0 field. */
#define SIM_RD_SCGC5_TMR0(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_TMR0_MASK) >> SIM_SCGC5_TMR0_SHIFT)
#define SIM_BRD_SCGC5_TMR0(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_TMR0_SHIFT, SIM_SCGC5_TMR0_WIDTH))

/*! @brief Set the TMR0 field to a new value. */
#define SIM_WR_SCGC5_TMR0(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_TMR0_MASK, SIM_SCGC5_TMR0(value)))
#define SIM_BWR_SCGC5_TMR0(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_TMR0_SHIFT), SIM_SCGC5_TMR0_SHIFT, SIM_SCGC5_TMR0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field TMR1[24] (RW)
 *
 * This bit controls the clock gate to the QTMR0_TMR1.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_TMR1 field. */
#define SIM_RD_SCGC5_TMR1(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_TMR1_MASK) >> SIM_SCGC5_TMR1_SHIFT)
#define SIM_BRD_SCGC5_TMR1(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_TMR1_SHIFT, SIM_SCGC5_TMR1_WIDTH))

/*! @brief Set the TMR1 field to a new value. */
#define SIM_WR_SCGC5_TMR1(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_TMR1_MASK, SIM_SCGC5_TMR1(value)))
#define SIM_BWR_SCGC5_TMR1(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_TMR1_SHIFT), SIM_SCGC5_TMR1_SHIFT, SIM_SCGC5_TMR1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field TMR2[25] (RW)
 *
 * This bit controls the clock gate to the QTMR0_TMR2.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_TMR2 field. */
#define SIM_RD_SCGC5_TMR2(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_TMR2_MASK) >> SIM_SCGC5_TMR2_SHIFT)
#define SIM_BRD_SCGC5_TMR2(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_TMR2_SHIFT, SIM_SCGC5_TMR2_WIDTH))

/*! @brief Set the TMR2 field to a new value. */
#define SIM_WR_SCGC5_TMR2(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_TMR2_MASK, SIM_SCGC5_TMR2(value)))
#define SIM_BWR_SCGC5_TMR2(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_TMR2_SHIFT), SIM_SCGC5_TMR2_SHIFT, SIM_SCGC5_TMR2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field TMR3[26] (RW)
 *
 * This bit controls the clock gate to the QTMR0_TMR3.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_TMR3 field. */
#define SIM_RD_SCGC5_TMR3(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_TMR3_MASK) >> SIM_SCGC5_TMR3_SHIFT)
#define SIM_BRD_SCGC5_TMR3(base) (BME_UBFX32(&SIM_SCGC5_REG(base), SIM_SCGC5_TMR3_SHIFT, SIM_SCGC5_TMR3_WIDTH))

/*! @brief Set the TMR3 field to a new value. */
#define SIM_WR_SCGC5_TMR3(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_TMR3_MASK, SIM_SCGC5_TMR3(value)))
#define SIM_BWR_SCGC5_TMR3(base, value) (BME_BFI32(&SIM_SCGC5_REG(base), ((uint32_t)(value) << SIM_SCGC5_TMR3_SHIFT), SIM_SCGC5_TMR3_SHIFT, SIM_SCGC5_TMR3_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SCGC6 - System Clock Gating Control Register 6
 ******************************************************************************/

/*!
 * @brief SIM_SCGC6 - System Clock Gating Control Register 6 (RW)
 *
 * Reset value: 0xC0000001U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_SCGC6 register
 */
/*@{*/
#define SIM_RD_SCGC6(base)       (SIM_SCGC6_REG(base))
#define SIM_WR_SCGC6(base, value) (SIM_SCGC6_REG(base) = (value))
#define SIM_RMW_SCGC6(base, mask, value) (SIM_WR_SCGC6(base, (SIM_RD_SCGC6(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC6(base, value) (BME_OR32(&SIM_SCGC6_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC6(base, value) (BME_AND32(&SIM_SCGC6_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC6(base, value) (BME_XOR32(&SIM_SCGC6_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC6 bitfields
 */

/*!
 * @name Register SIM_SCGC6, field FTFA[0] (RW)
 *
 * This bit controls the clock gate to the FTFA Module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_FTFA field. */
#define SIM_RD_SCGC6_FTFA(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_FTFA_MASK) >> SIM_SCGC6_FTFA_SHIFT)
#define SIM_BRD_SCGC6_FTFA(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_FTFA_SHIFT, SIM_SCGC6_FTFA_WIDTH))

/*! @brief Set the FTFA field to a new value. */
#define SIM_WR_SCGC6_FTFA(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_FTFA_MASK, SIM_SCGC6_FTFA(value)))
#define SIM_BWR_SCGC6_FTFA(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_FTFA_SHIFT), SIM_SCGC6_FTFA_SHIFT, SIM_SCGC6_FTFA_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field DMACHMUX[1] (RW)
 *
 * This bit controls the clock gate to the DMA channel MUX module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DMACHMUX field. */
#define SIM_RD_SCGC6_DMACHMUX(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DMACHMUX_MASK) >> SIM_SCGC6_DMACHMUX_SHIFT)
#define SIM_BRD_SCGC6_DMACHMUX(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMACHMUX_SHIFT, SIM_SCGC6_DMACHMUX_WIDTH))

/*! @brief Set the DMACHMUX field to a new value. */
#define SIM_WR_SCGC6_DMACHMUX(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_DMACHMUX_MASK, SIM_SCGC6_DMACHMUX(value)))
#define SIM_BWR_SCGC6_DMACHMUX(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_DMACHMUX_SHIFT), SIM_SCGC6_DMACHMUX_SHIFT, SIM_SCGC6_DMACHMUX_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field RNGA[9] (RW)
 *
 * This bit controls the clock gate to the RNGA module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_RNGA field. */
#define SIM_RD_SCGC6_RNGA(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_RNGA_MASK) >> SIM_SCGC6_RNGA_SHIFT)
#define SIM_BRD_SCGC6_RNGA(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_RNGA_SHIFT, SIM_SCGC6_RNGA_WIDTH))

/*! @brief Set the RNGA field to a new value. */
#define SIM_WR_SCGC6_RNGA(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_RNGA_MASK, SIM_SCGC6_RNGA(value)))
#define SIM_BWR_SCGC6_RNGA(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_RNGA_SHIFT), SIM_SCGC6_RNGA_SHIFT, SIM_SCGC6_RNGA_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field LPUART[10] (RW)
 *
 * This bit controls the clock gate to the LPUART module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_LPUART field. */
#define SIM_RD_SCGC6_LPUART(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_LPUART_MASK) >> SIM_SCGC6_LPUART_SHIFT)
#define SIM_BRD_SCGC6_LPUART(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_LPUART_SHIFT, SIM_SCGC6_LPUART_WIDTH))

/*! @brief Set the LPUART field to a new value. */
#define SIM_WR_SCGC6_LPUART(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_LPUART_MASK, SIM_SCGC6_LPUART(value)))
#define SIM_BWR_SCGC6_LPUART(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_LPUART_SHIFT), SIM_SCGC6_LPUART_SHIFT, SIM_SCGC6_LPUART_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field ADC[11] (RW)
 *
 * This bit controls the clock gate to the SAR ADC module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_ADC field. */
#define SIM_RD_SCGC6_ADC(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_ADC_MASK) >> SIM_SCGC6_ADC_SHIFT)
#define SIM_BRD_SCGC6_ADC(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_ADC_SHIFT, SIM_SCGC6_ADC_WIDTH))

/*! @brief Set the ADC field to a new value. */
#define SIM_WR_SCGC6_ADC(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_ADC_MASK, SIM_SCGC6_ADC(value)))
#define SIM_BWR_SCGC6_ADC(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_ADC_SHIFT), SIM_SCGC6_ADC_SHIFT, SIM_SCGC6_ADC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PIT0[13] (RW)
 *
 * This bit controls the clock gate to the PIT0 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PIT0 field. */
#define SIM_RD_SCGC6_PIT0(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PIT0_MASK) >> SIM_SCGC6_PIT0_SHIFT)
#define SIM_BRD_SCGC6_PIT0(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PIT0_SHIFT, SIM_SCGC6_PIT0_WIDTH))

/*! @brief Set the PIT0 field to a new value. */
#define SIM_WR_SCGC6_PIT0(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PIT0_MASK, SIM_SCGC6_PIT0(value)))
#define SIM_BWR_SCGC6_PIT0(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PIT0_SHIFT), SIM_SCGC6_PIT0_SHIFT, SIM_SCGC6_PIT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PIT1[14] (RW)
 *
 * This bit controls the clock gate to the PIT1 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PIT1 field. */
#define SIM_RD_SCGC6_PIT1(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PIT1_MASK) >> SIM_SCGC6_PIT1_SHIFT)
#define SIM_BRD_SCGC6_PIT1(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PIT1_SHIFT, SIM_SCGC6_PIT1_WIDTH))

/*! @brief Set the PIT1 field to a new value. */
#define SIM_WR_SCGC6_PIT1(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PIT1_MASK, SIM_SCGC6_PIT1(value)))
#define SIM_BWR_SCGC6_PIT1(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PIT1_SHIFT), SIM_SCGC6_PIT1_SHIFT, SIM_SCGC6_PIT1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field AFE[16] (RW)
 *
 * This bit controls the clock to all four AFE channels.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_AFE field. */
#define SIM_RD_SCGC6_AFE(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_AFE_MASK) >> SIM_SCGC6_AFE_SHIFT)
#define SIM_BRD_SCGC6_AFE(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_AFE_SHIFT, SIM_SCGC6_AFE_WIDTH))

/*! @brief Set the AFE field to a new value. */
#define SIM_WR_SCGC6_AFE(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_AFE_MASK, SIM_SCGC6_AFE(value)))
#define SIM_BWR_SCGC6_AFE(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_AFE_SHIFT), SIM_SCGC6_AFE_SHIFT, SIM_SCGC6_AFE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field CRC[20] (RW)
 *
 * This bit controls the clock gate to the PCRC module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_CRC field. */
#define SIM_RD_SCGC6_CRC(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_CRC_MASK) >> SIM_SCGC6_CRC_SHIFT)
#define SIM_BRD_SCGC6_CRC(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_CRC_SHIFT, SIM_SCGC6_CRC_WIDTH))

/*! @brief Set the CRC field to a new value. */
#define SIM_WR_SCGC6_CRC(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_CRC_MASK, SIM_SCGC6_CRC(value)))
#define SIM_BWR_SCGC6_CRC(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_CRC_SHIFT), SIM_SCGC6_CRC_SHIFT, SIM_SCGC6_CRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PDB[22] (RW)
 *
 * This bit controls the clock gate to the PDB module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PDB field. */
#define SIM_RD_SCGC6_PDB(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PDB_MASK) >> SIM_SCGC6_PDB_SHIFT)
#define SIM_BRD_SCGC6_PDB(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PDB_SHIFT, SIM_SCGC6_PDB_WIDTH))

/*! @brief Set the PDB field to a new value. */
#define SIM_WR_SCGC6_PDB(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PDB_MASK, SIM_SCGC6_PDB(value)))
#define SIM_BWR_SCGC6_PDB(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PDB_SHIFT), SIM_SCGC6_PDB_SHIFT, SIM_SCGC6_PDB_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PORTJ[23] (RW)
 *
 * This bit controls the clock gate to the PCTLJ module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PORTJ field. */
#define SIM_RD_SCGC6_PORTJ(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PORTJ_MASK) >> SIM_SCGC6_PORTJ_SHIFT)
#define SIM_BRD_SCGC6_PORTJ(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PORTJ_SHIFT, SIM_SCGC6_PORTJ_WIDTH))

/*! @brief Set the PORTJ field to a new value. */
#define SIM_WR_SCGC6_PORTJ(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PORTJ_MASK, SIM_SCGC6_PORTJ(value)))
#define SIM_BWR_SCGC6_PORTJ(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PORTJ_SHIFT), SIM_SCGC6_PORTJ_SHIFT, SIM_SCGC6_PORTJ_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PORTK[24] (RW)
 *
 * This bit controls the clock gate to the PCTLK module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PORTK field. */
#define SIM_RD_SCGC6_PORTK(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PORTK_MASK) >> SIM_SCGC6_PORTK_SHIFT)
#define SIM_BRD_SCGC6_PORTK(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PORTK_SHIFT, SIM_SCGC6_PORTK_WIDTH))

