RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the PORTK field to a new value. */
#define SIM_WR_SCGC6_PORTK(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PORTK_MASK, SIM_SCGC6_PORTK(value)))
#define SIM_BWR_SCGC6_PORTK(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PORTK_SHIFT), SIM_SCGC6_PORTK_SHIFT, SIM_SCGC6_PORTK_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PORTL[25] (RW)
 *
 * This bit controls the clock gate to the PCTLL module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PORTL field. */
#define SIM_RD_SCGC6_PORTL(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PORTL_MASK) >> SIM_SCGC6_PORTL_SHIFT)
#define SIM_BRD_SCGC6_PORTL(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PORTL_SHIFT, SIM_SCGC6_PORTL_WIDTH))

/*! @brief Set the PORTL field to a new value. */
#define SIM_WR_SCGC6_PORTL(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PORTL_MASK, SIM_SCGC6_PORTL(value)))
#define SIM_BWR_SCGC6_PORTL(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PORTL_SHIFT), SIM_SCGC6_PORTL_SHIFT, SIM_SCGC6_PORTL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field PORTM[26] (RW)
 *
 * This bit controls the clock gate to the PCTLM module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_PORTM field. */
#define SIM_RD_SCGC6_PORTM(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_PORTM_MASK) >> SIM_SCGC6_PORTM_SHIFT)
#define SIM_BRD_SCGC6_PORTM(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_PORTM_SHIFT, SIM_SCGC6_PORTM_WIDTH))

/*! @brief Set the PORTM field to a new value. */
#define SIM_WR_SCGC6_PORTM(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_PORTM_MASK, SIM_SCGC6_PORTM(value)))
#define SIM_BWR_SCGC6_PORTM(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_PORTM_SHIFT), SIM_SCGC6_PORTM_SHIFT, SIM_SCGC6_PORTM_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field LPTMR[28] (RW)
 *
 * This bit controls the clock gate to the LPTMR module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_LPTMR field. */
#define SIM_RD_SCGC6_LPTMR(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_LPTMR_MASK) >> SIM_SCGC6_LPTMR_SHIFT)
#define SIM_BRD_SCGC6_LPTMR(base) (BME_UBFX32(&SIM_SCGC6_REG(base), SIM_SCGC6_LPTMR_SHIFT, SIM_SCGC6_LPTMR_WIDTH))

/*! @brief Set the LPTMR field to a new value. */
#define SIM_WR_SCGC6_LPTMR(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_LPTMR_MASK, SIM_SCGC6_LPTMR(value)))
#define SIM_BWR_SCGC6_LPTMR(base, value) (BME_BFI32(&SIM_SCGC6_REG(base), ((uint32_t)(value) << SIM_SCGC6_LPTMR_SHIFT), SIM_SCGC6_LPTMR_SHIFT, SIM_SCGC6_LPTMR_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SCGC7 - System Clock Gating Control Register 7
 ******************************************************************************/

/*!
 * @brief SIM_SCGC7 - System Clock Gating Control Register 7 (RW)
 *
 * Reset value: 0x00000003U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_SCGC7 register
 */
/*@{*/
#define SIM_RD_SCGC7(base)       (SIM_SCGC7_REG(base))
#define SIM_WR_SCGC7(base, value) (SIM_SCGC7_REG(base) = (value))
#define SIM_RMW_SCGC7(base, mask, value) (SIM_WR_SCGC7(base, (SIM_RD_SCGC7(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC7(base, value) (BME_OR32(&SIM_SCGC7_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC7(base, value) (BME_AND32(&SIM_SCGC7_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC7(base, value) (BME_XOR32(&SIM_SCGC7_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC7 bitfields
 */

/*!
 * @name Register SIM_SCGC7, field MPU[0] (RW)
 *
 * This bit controls the clock gate to the MPU module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC7_MPU field. */
#define SIM_RD_SCGC7_MPU(base) ((SIM_SCGC7_REG(base) & SIM_SCGC7_MPU_MASK) >> SIM_SCGC7_MPU_SHIFT)
#define SIM_BRD_SCGC7_MPU(base) (BME_UBFX32(&SIM_SCGC7_REG(base), SIM_SCGC7_MPU_SHIFT, SIM_SCGC7_MPU_WIDTH))

/*! @brief Set the MPU field to a new value. */
#define SIM_WR_SCGC7_MPU(base, value) (SIM_RMW_SCGC7(base, SIM_SCGC7_MPU_MASK, SIM_SCGC7_MPU(value)))
#define SIM_BWR_SCGC7_MPU(base, value) (BME_BFI32(&SIM_SCGC7_REG(base), ((uint32_t)(value) << SIM_SCGC7_MPU_SHIFT), SIM_SCGC7_MPU_SHIFT, SIM_SCGC7_MPU_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC7, field DMA[1] (RW)
 *
 * This bit controls the clock gate to the DMA module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC7_DMA field. */
#define SIM_RD_SCGC7_DMA(base) ((SIM_SCGC7_REG(base) & SIM_SCGC7_DMA_MASK) >> SIM_SCGC7_DMA_SHIFT)
#define SIM_BRD_SCGC7_DMA(base) (BME_UBFX32(&SIM_SCGC7_REG(base), SIM_SCGC7_DMA_SHIFT, SIM_SCGC7_DMA_WIDTH))

/*! @brief Set the DMA field to a new value. */
#define SIM_WR_SCGC7_DMA(base, value) (SIM_RMW_SCGC7(base, SIM_SCGC7_DMA_MASK, SIM_SCGC7_DMA(value)))
#define SIM_BWR_SCGC7_DMA(base, value) (BME_BFI32(&SIM_SCGC7_REG(base), ((uint32_t)(value) << SIM_SCGC7_DMA_SHIFT), SIM_SCGC7_DMA_SHIFT, SIM_SCGC7_DMA_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC7, field CAU[2] (RW)
 *
 * This bit controls the clock gate to the CAU module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC7_CAU field. */
#define SIM_RD_SCGC7_CAU(base) ((SIM_SCGC7_REG(base) & SIM_SCGC7_CAU_MASK) >> SIM_SCGC7_CAU_SHIFT)
#define SIM_BRD_SCGC7_CAU(base) (BME_UBFX32(&SIM_SCGC7_REG(base), SIM_SCGC7_CAU_SHIFT, SIM_SCGC7_CAU_WIDTH))

/*! @brief Set the CAU field to a new value. */
#define SIM_WR_SCGC7_CAU(base, value) (SIM_RMW_SCGC7(base, SIM_SCGC7_CAU_MASK, SIM_SCGC7_CAU(value)))
#define SIM_BWR_SCGC7_CAU(base, value) (BME_BFI32(&SIM_SCGC7_REG(base), ((uint32_t)(value) << SIM_SCGC7_CAU_SHIFT), SIM_SCGC7_CAU_SHIFT, SIM_SCGC7_CAU_WIDTH))
/*@}*/

