RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * SIM_CLKDIV1 - System Clock Divider Register 1
 ******************************************************************************/

/*!
 * @brief SIM_CLKDIV1 - System Clock Divider Register 1 (RW)
 *
 * Reset value: 0x01000000U
 *
 * Writes to this register can only be performed in Supervisor mode.
 */
/*!
 * @name Constants and macros for entire SIM_CLKDIV1 register
 */
/*@{*/
#define SIM_RD_CLKDIV1(base)     (SIM_CLKDIV1_REG(base))
#define SIM_WR_CLKDIV1(base, value) (SIM_CLKDIV1_REG(base) = (value))
#define SIM_RMW_CLKDIV1(base, mask, value) (SIM_WR_CLKDIV1(base, (SIM_RD_CLKDIV1(base) & ~(mask)) | (value)))
#define SIM_SET_CLKDIV1(base, value) (BME_OR32(&SIM_CLKDIV1_REG(base), (uint32_t)(value)))
#define SIM_CLR_CLKDIV1(base, value) (BME_AND32(&SIM_CLKDIV1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_CLKDIV1(base, value) (BME_XOR32(&SIM_CLKDIV1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CLKDIV1 bitfields
 */

/*!
 * @name Register SIM_CLKDIV1, field FLASHCLKMODE[16] (RW)
 *
 * This field is used to select the Flash clock mode.
 *
 * Values:
 * - 0b0 - Flash Clock is the same as BUS clock.
 * - 0b1 - Flash Clock is a half of BUS clock.
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV1_FLASHCLKMODE field. */
#define SIM_RD_CLKDIV1_FLASHCLKMODE(base) ((SIM_CLKDIV1_REG(base) & SIM_CLKDIV1_FLASHCLKMODE_MASK) >> SIM_CLKDIV1_FLASHCLKMODE_SHIFT)
#define SIM_BRD_CLKDIV1_FLASHCLKMODE(base) (BME_UBFX32(&SIM_CLKDIV1_REG(base), SIM_CLKDIV1_FLASHCLKMODE_SHIFT, SIM_CLKDIV1_FLASHCLKMODE_WIDTH))

/*! @brief Set the FLASHCLKMODE field to a new value. */
#define SIM_WR_CLKDIV1_FLASHCLKMODE(base, value) (SIM_RMW_CLKDIV1(base, SIM_CLKDIV1_FLASHCLKMODE_MASK, SIM_CLKDIV1_FLASHCLKMODE(value)))
#define SIM_BWR_CLKDIV1_FLASHCLKMODE(base, value) (BME_BFI32(&SIM_CLKDIV1_REG(base), ((uint32_t)(value) << SIM_CLKDIV1_FLASHCLKMODE_SHIFT), SIM_CLKDIV1_FLASHCLKMODE_SHIFT, SIM_CLKDIV1_FLASHCLKMODE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CLKDIV1, field CLKDIVBUS[25:24] (RW)
 *
 * This field can be used to program Bus clock divider.
 *
 * Values:
 * - 0b00 - SYSCLK:BUSCLK = 1:1
 * - 0b01 - SYSCLK:BUSCLK = 2:1
 * - 0b10 - SYSCLK:BUSCLK = 3:1
 * - 0b11 - SYSCLK:BUSCLK = 4:1
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV1_CLKDIVBUS field. */
#define SIM_RD_CLKDIV1_CLKDIVBUS(base) ((SIM_CLKDIV1_REG(base) & SIM_CLKDIV1_CLKDIVBUS_MASK) >> SIM_CLKDIV1_CLKDIVBUS_SHIFT)
#define SIM_BRD_CLKDIV1_CLKDIVBUS(base) (BME_UBFX32(&SIM_CLKDIV1_REG(base), SIM_CLKDIV1_CLKDIVBUS_SHIFT, SIM_CLKDIV1_CLKDIVBUS_WIDTH))

/*! @brief Set the CLKDIVBUS field to a new value. */
#define SIM_WR_CLKDIV1_CLKDIVBUS(base, value) (SIM_RMW_CLKDIV1(base, SIM_CLKDIV1_CLKDIVBUS_MASK, SIM_CLKDIV1_CLKDIVBUS(value)))
#define SIM_BWR_CLKDIV1_CLKDIVBUS(base, value) (BME_BFI32(&SIM_CLKDIV1_REG(base), ((uint32_t)(value) << SIM_CLKDIV1_CLKDIVBUS_SHIFT), SIM_CLKDIV1_CLKDIVBUS_SHIFT, SIM_CLKDIV1_CLKDIVBUS_WIDTH))
/*@}*/

/*!
 * @name Register SIM_CLKDIV1, field CLKDIVSYS[31:28] (RW)
 *
 * This field can be used to program Core/Platform divider.
 *
 * Values:
 * - 0b0000 - Divide by 1
 * - 0b0001 - Divide by 2
 * - 0b0010 - Divide by 3
 * - 0b0011 - Divide by 4 and so on... If FOPT[0] is 0, the divider is set to
 *     div-by-8 after system reset is deasserted (after completion of system
 *     initialization sequence).
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV1_CLKDIVSYS field. */
#define SIM_RD_CLKDIV1_CLKDIVSYS(base) ((SIM_CLKDIV1_REG(base) & SIM_CLKDIV1_CLKDIVSYS_MASK) >> SIM_CLKDIV1_CLKDIVSYS_SHIFT)
#define SIM_BRD_CLKDIV1_CLKDIVSYS(base) (BME_UBFX32(&SIM_CLKDIV1_REG(base), SIM_CLKDIV1_CLKDIVSYS_SHIFT, SIM_CLKDIV1_CLKDIVSYS_WIDTH))

/*! @brief Set the CLKDIVSYS field to a new value. */
#define SIM_WR_CLKDIV1_CLKDIVSYS(base, value) (SIM_RMW_CLKDIV1(base, SIM_CLKDIV1_CLKDIVSYS_MASK, SIM_CLKDIV1_CLKDIVSYS(value)))
#define SIM_BWR_CLKDIV1_CLKDIVSYS(base, value) (BME_BFI32(&SIM_CLKDIV1_REG(base), ((uint32_t)(value) << SIM_CLKDIV1_CLKDIVSYS_SHIFT), SIM_CLKDIV1_CLKDIVSYS_SHIFT, SIM_CLKDIV1_CLKDIVSYS_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_FCFG1 - Flash Configuration Register 1
 ******************************************************************************/

/*!
 * @brief SIM_FCFG1 - Flash Configuration Register 1 (RW)
 *
 * Reset value: 0x070F0000U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_FCFG1 register
 */
/*@{*/
#define SIM_RD_FCFG1(base)       (SIM_FCFG1_REG(base))
#define SIM_WR_FCFG1(base, value) (SIM_FCFG1_REG(base) = (value))
#define SIM_RMW_FCFG1(base, mask, value) (SIM_WR_FCFG1(base, (SIM_RD_FCFG1(base) & ~(mask)) | (value)))
#define SIM_SET_FCFG1(base, value) (BME_OR32(&SIM_FCFG1_REG(base), (uint32_t)(value)))
#define SIM_CLR_FCFG1(base, value) (BME_AND32(&SIM_FCFG1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_FCFG1(base, value) (BME_XOR32(&SIM_FCFG1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_FCFG1 bitfields
 */

/*!
 * @name Register SIM_FCFG1, field FLASHDIS[0] (RW)
 *
 * Flash accesses are disabled (and generate a bus error) and the Flash memory
 * is placed in a low power state. This bit should not be changed during VLP
 * modes. Relocate the interrupt vectors out of Flash memory before disabling the
 * Flash.
 *
 * Values:
 * - 0b0 - Flash is enabled
 * - 0b1 - Flash is disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_FLASHDIS field. */
#define SIM_RD_FCFG1_FLASHDIS(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_FLASHDIS_MASK) >> SIM_FCFG1_FLASHDIS_SHIFT)
#define SIM_BRD_FCFG1_FLASHDIS(base) (BME_UBFX32(&SIM_FCFG1_REG(base), SIM_FCFG1_FLASHDIS_SHIFT, SIM_FCFG1_FLASHDIS_WIDTH))

/*! @brief Set the FLASHDIS field to a new value. */
#define SIM_WR_FCFG1_FLASHDIS(base, value) (SIM_RMW_FCFG1(base, SIM_FCFG1_FLASHDIS_MASK, SIM_FCFG1_FLASHDIS(value)))
#define SIM_BWR_FCFG1_FLASHDIS(base, value) (BME_BFI32(&SIM_FCFG1_REG(base), ((uint32_t)(value) << SIM_FCFG1_FLASHDIS_SHIFT), SIM_FCFG1_FLASHDIS_SHIFT, SIM_FCFG1_FLASHDIS_WIDTH))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field FLASHDOZE[1] (RW)
 *
 * When set, Flash memory is disabled for the duration of Wait mode. An attempt
 * by the DMA or other bus master to access the Flash when the Flash is disabled
 * will result in a bus error. This bit should be clear during VLP modes. The
 * Flash will be automatically enabled again at the end of Wait mode so interrupt
 * vectors do not need to be relocated out of Flash memory. The wakeup time from
 * Wait mode is extended when this bit is set.
 *
 * Values:
 * - 0b0 - Flash remains enabled during Wait mode
 * - 0b1 - Flash is disabled for the duration of Wait mode
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_FLASHDOZE field. */
#define SIM_RD_FCFG1_FLASHDOZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_FLASHDOZE_MASK) >> SIM_FCFG1_FLASHDOZE_SHIFT)
#define SIM_BRD_FCFG1_FLASHDOZE(base) (BME_UBFX32(&SIM_FCFG1_REG(base), SIM_FCFG1_FLASHDOZE_SHIFT, SIM_FCFG1_FLASHDOZE_WIDTH))

/*! @brief Set the FLASHDOZE field to a new value. */
#define SIM_WR_FCFG1_FLASHDOZE(base, value) (SIM_RMW_FCFG1(base, SIM_FCFG1_FLASHDOZE_MASK, SIM_FCFG1_FLASHDOZE(value)))
#define SIM_BWR_FCFG1_FLASHDOZE(base, value) (BME_BFI32(&SIM_FCFG1_REG(base), ((uint32_t)(value) << SIM_FCFG1_FLASHDOZE_SHIFT), SIM_FCFG1_FLASHDOZE_SHIFT, SIM_FCFG1_FLASHDOZE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field PFSIZE[27:24] (RO)
 *
 * This field specifies the amount of program flash memory available on the
 * device . Undefined values are reserved.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - Reserved
 * - 0b0011 - Reserved
 * - 0b0100 - Reserved
 * - 0b0101 - Reserved
 * - 0b0110 - Reserved
 * - 0b0111 - 128 KB of program flash memory
 * - 0b1000 - Reserved
 * - 0b1001 - 256 KB of program flash memory
 * - 0b1111 - (Default)
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_PFSIZE field. */
#define SIM_RD_FCFG1_PFSIZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_PFSIZE_MASK) >> SIM_FCFG1_PFSIZE_SHIFT)
#define SIM_BRD_FCFG1_PFSIZE(base) (BME_UBFX32(&SIM_FCFG1_REG(base), SIM_FCFG1_PFSIZE_SHIFT, SIM_FCFG1_PFSIZE_WIDTH))
/*@}*/

