RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * SIM_FCFG2 - Flash Configuration Register 2
 ******************************************************************************/

/*!
 * @brief SIM_FCFG2 - Flash Configuration Register 2 (RO)
 *
 * Reset value: 0x10000000U
 *
 * Writes to this register can only be performed in Supervisor mode.
 */
/*!
 * @name Constants and macros for entire SIM_FCFG2 register
 */
/*@{*/
#define SIM_RD_FCFG2(base)       (SIM_FCFG2_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_FCFG2 bitfields
 */

/*!
 * @name Register SIM_FCFG2, field MAXADDR[30:24] (RO)
 *
 * This field concatenated with 13 trailing zeros indicates the first invalid
 * address of each program flash block. For example, if MAXADDR0 = 0x20, the first
 * invalid address of flash is 0x0004_0000. This would be the MAXADDR value for a
 * device with 256 KB program flash in flash memory.
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG2_MAXADDR field. */
#define SIM_RD_FCFG2_MAXADDR(base) ((SIM_FCFG2_REG(base) & SIM_FCFG2_MAXADDR_MASK) >> SIM_FCFG2_MAXADDR_SHIFT)
#define SIM_BRD_FCFG2_MAXADDR(base) (BME_UBFX32(&SIM_FCFG2_REG(base), SIM_FCFG2_MAXADDR_SHIFT, SIM_FCFG2_MAXADDR_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_UIDH - Unique Identification Register High
 ******************************************************************************/

/*!
 * @brief SIM_UIDH - Unique Identification Register High (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDH register
 */
/*@{*/
#define SIM_RD_UIDH(base)        (SIM_UIDH_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDMH - Unique Identification Register Mid-High
 ******************************************************************************/

/*!
 * @brief SIM_UIDMH - Unique Identification Register Mid-High (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDMH register
 */
/*@{*/
#define SIM_RD_UIDMH(base)       (SIM_UIDMH_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDML - Unique Identification Register Mid-Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDML - Unique Identification Register Mid-Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDML register
 */
/*@{*/
#define SIM_RD_UIDML(base)       (SIM_UIDML_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDL - Unique Identification Register Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDL - Unique Identification Register Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDL register
 */
/*@{*/
#define SIM_RD_UIDL(base)        (SIM_UIDL_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_MISC_CTL - Miscellaneous Control Register
 ******************************************************************************/

/*!
 * @brief SIM_MISC_CTL - Miscellaneous Control Register (RW)
 *
 * Reset value: 0x80000000U
 *
 * This register contains various fields to control miscellaneous features such
 * as receive/ transmit select for UART, PIT output selection, EWM input
 * selection, ClkOut selection, etc. Writes to this register can only be performed in
 * Supervisor mode.
 */
/*!
 * @name Constants and macros for entire SIM_MISC_CTL register
 */
/*@{*/
#define SIM_RD_MISC_CTL(base)    (SIM_MISC_CTL_REG(base))
#define SIM_WR_MISC_CTL(base, value) (SIM_MISC_CTL_REG(base) = (value))
#define SIM_RMW_MISC_CTL(base, mask, value) (SIM_WR_MISC_CTL(base, (SIM_RD_MISC_CTL(base) & ~(mask)) | (value)))
#define SIM_SET_MISC_CTL(base, value) (BME_OR32(&SIM_MISC_CTL_REG(base), (uint32_t)(value)))
#define SIM_CLR_MISC_CTL(base, value) (BME_AND32(&SIM_MISC_CTL_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_MISC_CTL(base, value) (BME_XOR32(&SIM_MISC_CTL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_MISC_CTL bitfields
 */

/*!
 * @name Register SIM_MISC_CTL, field OSCON[0] (RO)
 *
 * This field shows the status of RTC oscillator.
 *
 * Values:
 * - 0b0 - RTC oscillator is disabled.
 * - 0b1 - RTC oscillator is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_OSCON field. */
#define SIM_RD_MISC_CTL_OSCON(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_OSCON_MASK) >> SIM_MISC_CTL_OSCON_SHIFT)
#define SIM_BRD_MISC_CTL_OSCON(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_OSCON_SHIFT, SIM_MISC_CTL_OSCON_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field PDBADCTRG[1] (RW)
 *
 * This field can make PDB to trigger ADC directly.
 *
 * Values:
 * - 0b0 - XBAR to trigger ADC
 * - 0b1 - PDB output to trigger ADC
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_PDBADCTRG field. */
#define SIM_RD_MISC_CTL_PDBADCTRG(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_PDBADCTRG_MASK) >> SIM_MISC_CTL_PDBADCTRG_SHIFT)
#define SIM_BRD_MISC_CTL_PDBADCTRG(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_PDBADCTRG_SHIFT, SIM_MISC_CTL_PDBADCTRG_WIDTH))

/*! @brief Set the PDBADCTRG field to a new value. */
#define SIM_WR_MISC_CTL_PDBADCTRG(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_PDBADCTRG_MASK, SIM_MISC_CTL_PDBADCTRG(value)))
#define SIM_BWR_MISC_CTL_PDBADCTRG(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_PDBADCTRG_SHIFT), SIM_MISC_CTL_PDBADCTRG_SHIFT, SIM_MISC_CTL_PDBADCTRG_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field DMADONESEL[3:2] (RW)
 *
 * This field can be used to select the DMA Done flag to drive XBAR_IN[32]
 *
 * Values:
 * - 0b00 - DMA0
 * - 0b01 - DMA1
 * - 0b10 - DMA2
 * - 0b11 - DMA3
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_DMADONESEL field. */
#define SIM_RD_MISC_CTL_DMADONESEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_DMADONESEL_MASK) >> SIM_MISC_CTL_DMADONESEL_SHIFT)
#define SIM_BRD_MISC_CTL_DMADONESEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_DMADONESEL_SHIFT, SIM_MISC_CTL_DMADONESEL_WIDTH))

