RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the DMADONESEL field to a new value. */
#define SIM_WR_MISC_CTL_DMADONESEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_DMADONESEL_MASK, SIM_MISC_CTL_DMADONESEL(value)))
#define SIM_BWR_MISC_CTL_DMADONESEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_DMADONESEL_SHIFT), SIM_MISC_CTL_DMADONESEL_SHIFT, SIM_MISC_CTL_DMADONESEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field AFECLKSEL[5:4] (RW)
 *
 * Selects between PLL, FLL and OSC clock as the source for the PLL clock branch
 * for AFE Clock Mux
 *
 * Values:
 * - 0b00 - MCG PLL Clock selected
 * - 0b01 - MCG FLL Clock selected
 * - 0b10 - OSC Clock selected
 * - 0b11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_AFECLKSEL field. */
#define SIM_RD_MISC_CTL_AFECLKSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_AFECLKSEL_MASK) >> SIM_MISC_CTL_AFECLKSEL_SHIFT)
#define SIM_BRD_MISC_CTL_AFECLKSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_AFECLKSEL_SHIFT, SIM_MISC_CTL_AFECLKSEL_WIDTH))

/*! @brief Set the AFECLKSEL field to a new value. */
#define SIM_WR_MISC_CTL_AFECLKSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_AFECLKSEL_MASK, SIM_MISC_CTL_AFECLKSEL(value)))
#define SIM_BWR_MISC_CTL_AFECLKSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_AFECLKSEL_SHIFT), SIM_MISC_CTL_AFECLKSEL_SHIFT, SIM_MISC_CTL_AFECLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field AFECLKPADDIR[6] (RW)
 *
 * Controls the direction of the AFE CLK pin
 *
 * Values:
 * - 0b0 - AFE CLK PAD is input
 * - 0b1 - AFE CLK PAD is output
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_AFECLKPADDIR field. */
#define SIM_RD_MISC_CTL_AFECLKPADDIR(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_AFECLKPADDIR_MASK) >> SIM_MISC_CTL_AFECLKPADDIR_SHIFT)
#define SIM_BRD_MISC_CTL_AFECLKPADDIR(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_AFECLKPADDIR_SHIFT, SIM_MISC_CTL_AFECLKPADDIR_WIDTH))

/*! @brief Set the AFECLKPADDIR field to a new value. */
#define SIM_WR_MISC_CTL_AFECLKPADDIR(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_AFECLKPADDIR_MASK, SIM_MISC_CTL_AFECLKPADDIR(value)))
#define SIM_BWR_MISC_CTL_AFECLKPADDIR(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_AFECLKPADDIR_SHIFT), SIM_MISC_CTL_AFECLKPADDIR_SHIFT, SIM_MISC_CTL_AFECLKPADDIR_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UARTMODTYPE[7] (RW)
 *
 * Selects between TypeA and TypeB modulation for IrDA support
 *
 * Values:
 * - 0b0 - TypeA (OR'ed) Modulation selected for IrDA
 * - 0b1 - TypeB (AND'ed) Modulation selected for IrDA
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UARTMODTYPE field. */
#define SIM_RD_MISC_CTL_UARTMODTYPE(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UARTMODTYPE_MASK) >> SIM_MISC_CTL_UARTMODTYPE_SHIFT)
#define SIM_BRD_MISC_CTL_UARTMODTYPE(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UARTMODTYPE_SHIFT, SIM_MISC_CTL_UARTMODTYPE_WIDTH))

/*! @brief Set the UARTMODTYPE field to a new value. */
#define SIM_WR_MISC_CTL_UARTMODTYPE(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UARTMODTYPE_MASK, SIM_MISC_CTL_UARTMODTYPE(value)))
#define SIM_BWR_MISC_CTL_UARTMODTYPE(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UARTMODTYPE_SHIFT), SIM_MISC_CTL_UARTMODTYPE_SHIFT, SIM_MISC_CTL_UARTMODTYPE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UART0IRSEL[8] (RW)
 *
 * Exclusive selection with other UARTs. Do not select while another UART is
 * selected for the same functionality
 *
 * Values:
 * - 0b0 - Pad RX input (PTD[0], PTF[3] or PTK[3], as selected in Pinmux
 *     control) selected for RX input of UART0 and UART0 TX signal is not used for
 *     modulation
 * - 0b1 - UART0 selected for IrDA modulation. UART0 TX modulated by
 *     XBAR_OUT[14] and UART0 RX input connected to XBAR_OUT[13]. UARTxIRSEL cannot
 *     configure XBAR_OUT[14] and XBAR_OUT[13] automatically, and they need extra
 *     configuration in XBAR. User should configure XBAR[14:13] accordingly.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UART0IRSEL field. */
#define SIM_RD_MISC_CTL_UART0IRSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UART0IRSEL_MASK) >> SIM_MISC_CTL_UART0IRSEL_SHIFT)
#define SIM_BRD_MISC_CTL_UART0IRSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UART0IRSEL_SHIFT, SIM_MISC_CTL_UART0IRSEL_WIDTH))

/*! @brief Set the UART0IRSEL field to a new value. */
#define SIM_WR_MISC_CTL_UART0IRSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UART0IRSEL_MASK, SIM_MISC_CTL_UART0IRSEL(value)))
#define SIM_BWR_MISC_CTL_UART0IRSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UART0IRSEL_SHIFT), SIM_MISC_CTL_UART0IRSEL_SHIFT, SIM_MISC_CTL_UART0IRSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UART1IRSEL[9] (RW)
 *
 * Exclusive selection with other UARTs. Do not select while another UART is
 * selected for the same functionality
 *
 * Values:
 * - 0b0 - Pad RX input (PTD[2], PTI[0] or PTK[5], as selected in Pinmux
 *     control) selected for RX input of UART1 and UART1 TX signal is not used for
 *     modulation
 * - 0b1 - UART1 selected for IrDA modulation. UART1 TX modulated by
 *     XBAR_OUT[14] and UART1 RX input connected to XBAR_OUT[13].UARTxIRSEL cannot configure
 *     XBAR_OUT[14] and XBAR_OUT[13] automatically, and they need extra
 *     configuration in XBAR. User should configure XBAR[14:13] accordingly.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UART1IRSEL field. */
#define SIM_RD_MISC_CTL_UART1IRSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UART1IRSEL_MASK) >> SIM_MISC_CTL_UART1IRSEL_SHIFT)
#define SIM_BRD_MISC_CTL_UART1IRSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UART1IRSEL_SHIFT, SIM_MISC_CTL_UART1IRSEL_WIDTH))

/*! @brief Set the UART1IRSEL field to a new value. */
#define SIM_WR_MISC_CTL_UART1IRSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UART1IRSEL_MASK, SIM_MISC_CTL_UART1IRSEL(value)))
#define SIM_BWR_MISC_CTL_UART1IRSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UART1IRSEL_SHIFT), SIM_MISC_CTL_UART1IRSEL_SHIFT, SIM_MISC_CTL_UART1IRSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UART2IRSEL[10] (RW)
 *
 * Exclusive selection with other UARTs. Do not select while another UART is
 * selected for the same functionality
 *
 * Values:
 * - 0b0 - Pad RX input PTI[6] or PTE[6] selected for RX input of UART2 and
 *     UART2 TX signal is not used for modulation
 * - 0b1 - UART2 selected for IrDA modulation. UART2 TX modulated by
 *     XBAR_OUT[14] and UART2 RX input connected to XBAR_OUT[13].UARTxIRSEL cannot configure
 *     XBAR_OUT[14] and XBAR_OUT[13] automatically, and they need extra
 *     configuration in XBAR. User should configure XBAR[14:13] accordingly.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UART2IRSEL field. */
#define SIM_RD_MISC_CTL_UART2IRSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UART2IRSEL_MASK) >> SIM_MISC_CTL_UART2IRSEL_SHIFT)
#define SIM_BRD_MISC_CTL_UART2IRSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UART2IRSEL_SHIFT, SIM_MISC_CTL_UART2IRSEL_WIDTH))

/*! @brief Set the UART2IRSEL field to a new value. */
#define SIM_WR_MISC_CTL_UART2IRSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UART2IRSEL_MASK, SIM_MISC_CTL_UART2IRSEL(value)))
#define SIM_BWR_MISC_CTL_UART2IRSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UART2IRSEL_SHIFT), SIM_MISC_CTL_UART2IRSEL_SHIFT, SIM_MISC_CTL_UART2IRSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field UART3IRSEL[11] (RW)
 *
 * Exclusive selection with other UARTs. Do not select while another UART is
 * selected for the same functionality
 *
 * Values:
 * - 0b0 - Pad RX input (PTC[3] or PTD[7], as selected in Pinmux control)
 *     selected for RX input of UART3 and UART3 TX signal is not used for modulation
 * - 0b1 - UART3 selected for IrDA modulation. UART3 TX modulated by
 *     XBAR_OUT[14] and UART3 RX input connected to XBAR_OUT[13]. UARTxIRSEL cannot
 *     configure XBAR_OUT[14] and XBAR_OUT[13] automatically, and they need extra
 *     configuration in XBAR. User should configure XBAR[14:13] accordingly.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_UART3IRSEL field. */
#define SIM_RD_MISC_CTL_UART3IRSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_UART3IRSEL_MASK) >> SIM_MISC_CTL_UART3IRSEL_SHIFT)
#define SIM_BRD_MISC_CTL_UART3IRSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_UART3IRSEL_SHIFT, SIM_MISC_CTL_UART3IRSEL_WIDTH))

/*! @brief Set the UART3IRSEL field to a new value. */
#define SIM_WR_MISC_CTL_UART3IRSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_UART3IRSEL_MASK, SIM_MISC_CTL_UART3IRSEL(value)))
#define SIM_BWR_MISC_CTL_UART3IRSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_UART3IRSEL_SHIFT), SIM_MISC_CTL_UART3IRSEL_SHIFT, SIM_MISC_CTL_UART3IRSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field EWMINSEL[14] (RW)
 *
 * This field is used to select input for external watchdog monitor.
 *
 * Values:
 * - 0b0 - Input from PAD (PTL[3], PTE[2] or PTE[3] as selected from Pinmux
 *     control )
 * - 0b1 - Peripheral Crossbar (XBAR) Output[32]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_EWMINSEL field. */
#define SIM_RD_MISC_CTL_EWMINSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_EWMINSEL_MASK) >> SIM_MISC_CTL_EWMINSEL_SHIFT)
#define SIM_BRD_MISC_CTL_EWMINSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_EWMINSEL_SHIFT, SIM_MISC_CTL_EWMINSEL_WIDTH))

