RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the EWMINSEL field to a new value. */
#define SIM_WR_MISC_CTL_EWMINSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_EWMINSEL_MASK, SIM_MISC_CTL_EWMINSEL(value)))
#define SIM_BWR_MISC_CTL_EWMINSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_EWMINSEL_SHIFT), SIM_MISC_CTL_EWMINSEL_SHIFT, SIM_MISC_CTL_EWMINSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR0PLLSEL[15] (RW)
 *
 * Values:
 * - 0b0 - Selects Bus Clock as source for the Timer CH0
 * - 0b1 - Selects the PLL_AFE clock as the source for Timer CH0. The PLL_AFE
 *     clock source is itself selected using the MISC_CTL[5:4]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR0PLLSEL field. */
#define SIM_RD_MISC_CTL_TMR0PLLSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR0PLLSEL_MASK) >> SIM_MISC_CTL_TMR0PLLSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR0PLLSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR0PLLSEL_SHIFT, SIM_MISC_CTL_TMR0PLLSEL_WIDTH))

/*! @brief Set the TMR0PLLSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR0PLLSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR0PLLSEL_MASK, SIM_MISC_CTL_TMR0PLLSEL(value)))
#define SIM_BWR_MISC_CTL_TMR0PLLSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR0PLLSEL_SHIFT), SIM_MISC_CTL_TMR0PLLSEL_SHIFT, SIM_MISC_CTL_TMR0PLLSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR0SCSEL[16] (RW)
 *
 * This field is used to select secondary count input source for Quadtimer
 * Channel0. Configure TMR0_CTRL[SCS] = 00b to route selected secondary source to the
 * timer Channel0.
 *
 * Values:
 * - 0b0 - Pad PTF1 or PTD5, depending upon PCTL configuration.
 * - 0b1 - Peripheral Crossbar (XBAR) Output[5]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR0SCSEL field. */
#define SIM_RD_MISC_CTL_TMR0SCSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR0SCSEL_MASK) >> SIM_MISC_CTL_TMR0SCSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR0SCSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR0SCSEL_SHIFT, SIM_MISC_CTL_TMR0SCSEL_WIDTH))

/*! @brief Set the TMR0SCSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR0SCSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR0SCSEL_MASK, SIM_MISC_CTL_TMR0SCSEL(value)))
#define SIM_BWR_MISC_CTL_TMR0SCSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR0SCSEL_SHIFT), SIM_MISC_CTL_TMR0SCSEL_SHIFT, SIM_MISC_CTL_TMR0SCSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR1SCSEL[17] (RW)
 *
 * This field is used to select secondary count input source for Quadtimer
 * Channel1. Configure TMR1_CTRL[SCS] = 01b to route selected secondary source to the
 * timer Channel1.
 *
 * Values:
 * - 0b0 - Pad PTG0 or PTC6, depending upon PCTL configuration.
 * - 0b1 - Peripheral Crossbar (XBAR) Output[6]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR1SCSEL field. */
#define SIM_RD_MISC_CTL_TMR1SCSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR1SCSEL_MASK) >> SIM_MISC_CTL_TMR1SCSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR1SCSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR1SCSEL_SHIFT, SIM_MISC_CTL_TMR1SCSEL_WIDTH))

/*! @brief Set the TMR1SCSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR1SCSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR1SCSEL_MASK, SIM_MISC_CTL_TMR1SCSEL(value)))
#define SIM_BWR_MISC_CTL_TMR1SCSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR1SCSEL_SHIFT), SIM_MISC_CTL_TMR1SCSEL_SHIFT, SIM_MISC_CTL_TMR1SCSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR2SCSEL[18] (RW)
 *
 * This field is used to select secondary count input source for Quadtimer
 * Channel2. Configure TMR2_CTRL[SCS] = 10b to route selected secondary source to the
 * timer Channel2.
 *
 * Values:
 * - 0b0 - Pad PTF7 or PTF0, depending upon PCTL configuration.
 * - 0b1 - Peripheral Crossbar (XBAR) Output[7]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR2SCSEL field. */
#define SIM_RD_MISC_CTL_TMR2SCSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR2SCSEL_MASK) >> SIM_MISC_CTL_TMR2SCSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR2SCSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR2SCSEL_SHIFT, SIM_MISC_CTL_TMR2SCSEL_WIDTH))

/*! @brief Set the TMR2SCSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR2SCSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR2SCSEL_MASK, SIM_MISC_CTL_TMR2SCSEL(value)))
#define SIM_BWR_MISC_CTL_TMR2SCSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR2SCSEL_SHIFT), SIM_MISC_CTL_TMR2SCSEL_SHIFT, SIM_MISC_CTL_TMR2SCSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR3SCSEL[19] (RW)
 *
 * This field is used to select secondary count input source for Quadtimer
 * Channel3. Configure TMR3_CTRL[SCS] = 11b to route selected secondary source to the
 * timer Channel3.
 *
 * Values:
 * - 0b0 - Pad PTE5 or PTD1, depending upon PCTL configuration.
 * - 0b1 - Peripheral Crossbar (XBAR) Output[8]
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR3SCSEL field. */
#define SIM_RD_MISC_CTL_TMR3SCSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR3SCSEL_MASK) >> SIM_MISC_CTL_TMR3SCSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR3SCSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR3SCSEL_SHIFT, SIM_MISC_CTL_TMR3SCSEL_WIDTH))

/*! @brief Set the TMR3SCSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR3SCSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR3SCSEL_MASK, SIM_MISC_CTL_TMR3SCSEL(value)))
#define SIM_BWR_MISC_CTL_TMR3SCSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR3SCSEL_SHIFT), SIM_MISC_CTL_TMR3SCSEL_SHIFT, SIM_MISC_CTL_TMR3SCSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR0PCSSEL[21:20] (RW)
 *
 * This is used to select primary count source (clock) for Quadtimer Channel0.
 * Configure TMR0_CTRL[PCS] = 1xxxb to route selected primary clock source to the
 * timer Channel0.
 *
 * Values:
 * - 0b00 - Bus Clock
 * - 0b01 - Peripheral Crossbar Output [9]
 * - 0b10 - Peripheral Crossbar Output [10]
 * - 0b11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR0PCSSEL field. */
#define SIM_RD_MISC_CTL_TMR0PCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR0PCSSEL_MASK) >> SIM_MISC_CTL_TMR0PCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR0PCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR0PCSSEL_SHIFT, SIM_MISC_CTL_TMR0PCSSEL_WIDTH))

/*! @brief Set the TMR0PCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR0PCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR0PCSSEL_MASK, SIM_MISC_CTL_TMR0PCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR0PCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR0PCSSEL_SHIFT), SIM_MISC_CTL_TMR0PCSSEL_SHIFT, SIM_MISC_CTL_TMR0PCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR1PCSSEL[23:22] (RW)
 *
 * This is used to select primary count source (clock) for Quadtimer Channel1.
 * Configure TMR1_CTRL[PCS] = 1xxxb to route selected primary clock source to the
 * timer Channel1.
 *
 * Values:
 * - 0b00 - Bus Clock
 * - 0b01 - Peripheral Crossbar Output [9]
 * - 0b10 - Peripheral Crossbar Output [10]
 * - 0b11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR1PCSSEL field. */
#define SIM_RD_MISC_CTL_TMR1PCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR1PCSSEL_MASK) >> SIM_MISC_CTL_TMR1PCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR1PCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR1PCSSEL_SHIFT, SIM_MISC_CTL_TMR1PCSSEL_WIDTH))

/*! @brief Set the TMR1PCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR1PCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR1PCSSEL_MASK, SIM_MISC_CTL_TMR1PCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR1PCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR1PCSSEL_SHIFT), SIM_MISC_CTL_TMR1PCSSEL_SHIFT, SIM_MISC_CTL_TMR1PCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR2PCSSEL[25:24] (RW)
 *
 * This is used to select primary count source (clock) for Quadtimer Channel2.
 * Configure TMR2_CTRL[PCS] = 1xxxb to route selected primary clock source to the
 * timer Channel2.
 *
 * Values:
 * - 0b00 - Bus Clock
 * - 0b01 - Peripheral Crossbar Output [9]
 * - 0b10 - Peripheral Crossbar Output [10]
 * - 0b11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR2PCSSEL field. */
#define SIM_RD_MISC_CTL_TMR2PCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR2PCSSEL_MASK) >> SIM_MISC_CTL_TMR2PCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR2PCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR2PCSSEL_SHIFT, SIM_MISC_CTL_TMR2PCSSEL_WIDTH))

/*! @brief Set the TMR2PCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR2PCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR2PCSSEL_MASK, SIM_MISC_CTL_TMR2PCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR2PCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR2PCSSEL_SHIFT), SIM_MISC_CTL_TMR2PCSSEL_SHIFT, SIM_MISC_CTL_TMR2PCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field TMR3PCSSEL[27:26] (RW)
 *
 * This is used to select primary count source (clock) for Quadtimer Channel3.
 * Configure TMR3_CTRL[PCS] = 1xxxb to route selected primary clock source to the
 * timer Channel3.
 *
 * Values:
 * - 0b00 - Bus Clock
 * - 0b01 - Peripheral Crossbar Output [9]
 * - 0b10 - Peripheral Crossbar Output [10]
 * - 0b11 - Disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_TMR3PCSSEL field. */
#define SIM_RD_MISC_CTL_TMR3PCSSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_TMR3PCSSEL_MASK) >> SIM_MISC_CTL_TMR3PCSSEL_SHIFT)
#define SIM_BRD_MISC_CTL_TMR3PCSSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_TMR3PCSSEL_SHIFT, SIM_MISC_CTL_TMR3PCSSEL_WIDTH))

