RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the TMR3PCSSEL field to a new value. */
#define SIM_WR_MISC_CTL_TMR3PCSSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_TMR3PCSSEL_MASK, SIM_MISC_CTL_TMR3PCSSEL(value)))
#define SIM_BWR_MISC_CTL_TMR3PCSSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_TMR3PCSSEL_SHIFT), SIM_MISC_CTL_TMR3PCSSEL_SHIFT, SIM_MISC_CTL_TMR3PCSSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field RTCCLKSEL[28] (RW)
 *
 * Selects between MCGIRCLK and OSC_32K clk for RTC operation
 *
 * Values:
 * - 0b0 - RTC OSC_32K clock selected
 * - 0b1 - MCGIRCLK selected
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_RTCCLKSEL field. */
#define SIM_RD_MISC_CTL_RTCCLKSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_RTCCLKSEL_MASK) >> SIM_MISC_CTL_RTCCLKSEL_SHIFT)
#define SIM_BRD_MISC_CTL_RTCCLKSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_RTCCLKSEL_SHIFT, SIM_MISC_CTL_RTCCLKSEL_WIDTH))

/*! @brief Set the RTCCLKSEL field to a new value. */
#define SIM_WR_MISC_CTL_RTCCLKSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_RTCCLKSEL_MASK, SIM_MISC_CTL_RTCCLKSEL(value)))
#define SIM_BWR_MISC_CTL_RTCCLKSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_RTCCLKSEL_SHIFT), SIM_MISC_CTL_RTCCLKSEL_SHIFT, SIM_MISC_CTL_RTCCLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field VREFBUFOUTEN[29] (RW)
 *
 * Operates switch in VrefBuffer to enable the internal 1.2v reference to be
 * driven to VREF pad.
 *
 * Values:
 * - 0b0 - Buffer does not drive PAD
 * - 0b1 - Buffer drives selected voltage (selected by vref_buffer_sel) on pad
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_VREFBUFOUTEN field. */
#define SIM_RD_MISC_CTL_VREFBUFOUTEN(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_VREFBUFOUTEN_MASK) >> SIM_MISC_CTL_VREFBUFOUTEN_SHIFT)
#define SIM_BRD_MISC_CTL_VREFBUFOUTEN(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_VREFBUFOUTEN_SHIFT, SIM_MISC_CTL_VREFBUFOUTEN_WIDTH))

/*! @brief Set the VREFBUFOUTEN field to a new value. */
#define SIM_WR_MISC_CTL_VREFBUFOUTEN(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_VREFBUFOUTEN_MASK, SIM_MISC_CTL_VREFBUFOUTEN(value)))
#define SIM_BWR_MISC_CTL_VREFBUFOUTEN(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_VREFBUFOUTEN_SHIFT), SIM_MISC_CTL_VREFBUFOUTEN_SHIFT, SIM_MISC_CTL_VREFBUFOUTEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field VREFBUFINSEL[30] (RW)
 *
 * Selects Between Internal 1.2v reference and external reference for SAR and DAC
 *
 * Values:
 * - 0b0 - Internal Reference selected as Buffer Input
 * - 0b1 - External Reference selected as Buffer Input
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_VREFBUFINSEL field. */
#define SIM_RD_MISC_CTL_VREFBUFINSEL(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_VREFBUFINSEL_MASK) >> SIM_MISC_CTL_VREFBUFINSEL_SHIFT)
#define SIM_BRD_MISC_CTL_VREFBUFINSEL(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_VREFBUFINSEL_SHIFT, SIM_MISC_CTL_VREFBUFINSEL_WIDTH))

/*! @brief Set the VREFBUFINSEL field to a new value. */
#define SIM_WR_MISC_CTL_VREFBUFINSEL(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_VREFBUFINSEL_MASK, SIM_MISC_CTL_VREFBUFINSEL(value)))
#define SIM_BWR_MISC_CTL_VREFBUFINSEL(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_VREFBUFINSEL_SHIFT), SIM_MISC_CTL_VREFBUFINSEL_SHIFT, SIM_MISC_CTL_VREFBUFINSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISC_CTL, field VREFBUFPD[31] (RW)
 *
 * Powers down VrefBuffer when set
 *
 * Values:
 * - 0b0 - Buffer Enabled
 * - 0b1 - Buffer Powered Down
 */
/*@{*/
/*! @brief Read current value of the SIM_MISC_CTL_VREFBUFPD field. */
#define SIM_RD_MISC_CTL_VREFBUFPD(base) ((SIM_MISC_CTL_REG(base) & SIM_MISC_CTL_VREFBUFPD_MASK) >> SIM_MISC_CTL_VREFBUFPD_SHIFT)
#define SIM_BRD_MISC_CTL_VREFBUFPD(base) (BME_UBFX32(&SIM_MISC_CTL_REG(base), SIM_MISC_CTL_VREFBUFPD_SHIFT, SIM_MISC_CTL_VREFBUFPD_WIDTH))

/*! @brief Set the VREFBUFPD field to a new value. */
#define SIM_WR_MISC_CTL_VREFBUFPD(base, value) (SIM_RMW_MISC_CTL(base, SIM_MISC_CTL_VREFBUFPD_MASK, SIM_MISC_CTL_VREFBUFPD(value)))
#define SIM_BWR_MISC_CTL_VREFBUFPD(base, value) (BME_BFI32(&SIM_MISC_CTL_REG(base), ((uint32_t)(value) << SIM_MISC_CTL_VREFBUFPD_SHIFT), SIM_MISC_CTL_VREFBUFPD_SHIFT, SIM_MISC_CTL_VREFBUFPD_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_ADC_COMP0 - ADC Compensation Register 0
 ******************************************************************************/

/*!
 * @brief SIM_ADC_COMP0 - ADC Compensation Register 0 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_ADC_COMP0 register
 */
/*@{*/
#define SIM_RD_ADC_COMP0(base)   (SIM_ADC_COMP0_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_ADC_COMP0 bitfields
 */

/*!
 * @name Register SIM_ADC_COMP0, field ADCCOMPVAL0[15:0] (RO)
 *
 * ADC Temperature Compensation Value at 25℃ (ambient).
 */
/*@{*/
/*! @brief Read current value of the SIM_ADC_COMP0_ADCCOMPVAL0 field. */
#define SIM_RD_ADC_COMP0_ADCCOMPVAL0(base) ((SIM_ADC_COMP0_REG(base) & SIM_ADC_COMP0_ADCCOMPVAL0_MASK) >> SIM_ADC_COMP0_ADCCOMPVAL0_SHIFT)
#define SIM_BRD_ADC_COMP0_ADCCOMPVAL0(base) (BME_UBFX32(&SIM_ADC_COMP0_REG(base), SIM_ADC_COMP0_ADCCOMPVAL0_SHIFT, SIM_ADC_COMP0_ADCCOMPVAL0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_ADC_COMP0, field ADCCOMPVAL1[31:16] (RO)
 *
 * ADC Temperature Compensation Value at -40℃ (ambient).
 */
/*@{*/
/*! @brief Read current value of the SIM_ADC_COMP0_ADCCOMPVAL1 field. */
#define SIM_RD_ADC_COMP0_ADCCOMPVAL1(base) ((SIM_ADC_COMP0_REG(base) & SIM_ADC_COMP0_ADCCOMPVAL1_MASK) >> SIM_ADC_COMP0_ADCCOMPVAL1_SHIFT)
#define SIM_BRD_ADC_COMP0_ADCCOMPVAL1(base) (BME_UBFX32(&SIM_ADC_COMP0_REG(base), SIM_ADC_COMP0_ADCCOMPVAL1_SHIFT, SIM_ADC_COMP0_ADCCOMPVAL1_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_ADC_COMP1 - ADC Compensation Register 1
 ******************************************************************************/

/*!
 * @brief SIM_ADC_COMP1 - ADC Compensation Register 1 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_ADC_COMP1 register
 */
/*@{*/
#define SIM_RD_ADC_COMP1(base)   (SIM_ADC_COMP1_REG(base))
/*@}*/

