RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the ICOMPEN field to a new value. */
#define VREF_WR_VREFH_SC_ICOMPEN(base, value) (VREF_RMW_VREFH_SC(base, VREF_VREFH_SC_ICOMPEN_MASK, VREF_VREFH_SC_ICOMPEN(value)))
#define VREF_BWR_VREFH_SC_ICOMPEN(base, value) (BME_BFI8(&VREF_VREFH_SC_REG(base), ((uint8_t)(value) << VREF_VREFH_SC_ICOMPEN_SHIFT), VREF_VREFH_SC_ICOMPEN_SHIFT, VREF_VREFH_SC_ICOMPEN_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFH_SC, field REGEN[6] (RW)
 *
 * This bit is used to enable the internal 1.75 V regulator to produce a
 * constant internal voltage supply in order to reduce the sensitivity to external
 * supply noise and variation. If it is desired to keep the regulator enabled in very
 * low power modes, refer to the Chip Configuration chapter for a description on
 * how this can be achieved. This bit is set during factory trimming of the VREF
 * voltage. This bit should be written to 1 to achieve the performance stated in
 * the data sheet.
 *
 * Values:
 * - 0b0 - Internal 1.75 V regulator is disabled.
 * - 0b1 - Internal 1.75 V regulator is enabled.
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_SC_REGEN field. */
#define VREF_RD_VREFH_SC_REGEN(base) ((VREF_VREFH_SC_REG(base) & VREF_VREFH_SC_REGEN_MASK) >> VREF_VREFH_SC_REGEN_SHIFT)
#define VREF_BRD_VREFH_SC_REGEN(base) (BME_UBFX8(&VREF_VREFH_SC_REG(base), VREF_VREFH_SC_REGEN_SHIFT, VREF_VREFH_SC_REGEN_WIDTH))

/*! @brief Set the REGEN field to a new value. */
#define VREF_WR_VREFH_SC_REGEN(base, value) (VREF_RMW_VREFH_SC(base, VREF_VREFH_SC_REGEN_MASK, VREF_VREFH_SC_REGEN(value)))
#define VREF_BWR_VREFH_SC_REGEN(base, value) (BME_BFI8(&VREF_VREFH_SC_REG(base), ((uint8_t)(value) << VREF_VREFH_SC_REGEN_SHIFT), VREF_VREFH_SC_REGEN_SHIFT, VREF_VREFH_SC_REGEN_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFH_SC, field VREFEN[7] (RW)
 *
 * This bit is used to enable the bandgap reference within the Voltage Reference
 * module. After the VREF is enabled, turning off the clock to the VREF module
 * via the corresponding clock gate register will not disable the VREF. VREF must
 * be disabled via this VREFEN bit.
 *
 * Values:
 * - 0b0 - The module is disabled.
 * - 0b1 - The module is enabled.
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFH_SC_VREFEN field. */
#define VREF_RD_VREFH_SC_VREFEN(base) ((VREF_VREFH_SC_REG(base) & VREF_VREFH_SC_VREFEN_MASK) >> VREF_VREFH_SC_VREFEN_SHIFT)
#define VREF_BRD_VREFH_SC_VREFEN(base) (BME_UBFX8(&VREF_VREFH_SC_REG(base), VREF_VREFH_SC_VREFEN_SHIFT, VREF_VREFH_SC_VREFEN_WIDTH))

/*! @brief Set the VREFEN field to a new value. */
#define VREF_WR_VREFH_SC_VREFEN(base, value) (VREF_RMW_VREFH_SC(base, VREF_VREFH_SC_VREFEN_MASK, VREF_VREFH_SC_VREFEN(value)))
#define VREF_BWR_VREFH_SC_VREFEN(base, value) (BME_BFI8(&VREF_VREFH_SC_REG(base), ((uint8_t)(value) << VREF_VREFH_SC_VREFEN_SHIFT), VREF_VREFH_SC_VREFEN_SHIFT, VREF_VREFH_SC_VREFEN_WIDTH))
/*@}*/

/*******************************************************************************
 * VREF_VREFL_TRM - VREFL TRIM Register
 ******************************************************************************/

/*!
 * @brief VREF_VREFL_TRM - VREFL TRIM Register (RW)
 *
 * Reset value: 0x03U
 *
 * This register contains bits that contain enable and trim data for VREFL (0.4
 * V) reference. It also contains a bit to select between internal and external
 * 1.2 V reference.
 */
/*!
 * @name Constants and macros for entire VREF_VREFL_TRM register
 */
/*@{*/
#define VREF_RD_VREFL_TRM(base)  (VREF_VREFL_TRM_REG(base))
#define VREF_WR_VREFL_TRM(base, value) (VREF_VREFL_TRM_REG(base) = (value))
#define VREF_RMW_VREFL_TRM(base, mask, value) (VREF_WR_VREFL_TRM(base, (VREF_RD_VREFL_TRM(base) & ~(mask)) | (value)))
#define VREF_SET_VREFL_TRM(base, value) (BME_OR8(&VREF_VREFL_TRM_REG(base), (uint8_t)(value)))
#define VREF_CLR_VREFL_TRM(base, value) (BME_AND8(&VREF_VREFL_TRM_REG(base), (uint8_t)(~(value))))
#define VREF_TOG_VREFL_TRM(base, value) (BME_XOR8(&VREF_VREFL_TRM_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual VREF_VREFL_TRM bitfields
 */

/*!
 * @name Register VREF_VREFL_TRM, field VREFL_TRIM[2:0] (RW)
 *
 * These bits trim the VREFL reference voltage in steps of 10 mV. The mid
 * voltage of the trim range is 0.4 V at the trim value of 011. The values 111 and 110
 * are NOT valid/allowed. Value of VREFL_TRIM (default 011) is determined by IFR.
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFL_TRM_VREFL_TRIM field. */
#define VREF_RD_VREFL_TRM_VREFL_TRIM(base) ((VREF_VREFL_TRM_REG(base) & VREF_VREFL_TRM_VREFL_TRIM_MASK) >> VREF_VREFL_TRM_VREFL_TRIM_SHIFT)
#define VREF_BRD_VREFL_TRM_VREFL_TRIM(base) (BME_UBFX8(&VREF_VREFL_TRM_REG(base), VREF_VREFL_TRM_VREFL_TRIM_SHIFT, VREF_VREFL_TRM_VREFL_TRIM_WIDTH))

/*! @brief Set the VREFL_TRIM field to a new value. */
#define VREF_WR_VREFL_TRM_VREFL_TRIM(base, value) (VREF_RMW_VREFL_TRM(base, VREF_VREFL_TRM_VREFL_TRIM_MASK, VREF_VREFL_TRM_VREFL_TRIM(value)))
#define VREF_BWR_VREFL_TRM_VREFL_TRIM(base, value) (BME_BFI8(&VREF_VREFL_TRM_REG(base), ((uint8_t)(value) << VREF_VREFL_TRM_VREFL_TRIM_SHIFT), VREF_VREFL_TRM_VREFL_TRIM_SHIFT, VREF_VREFL_TRM_VREFL_TRIM_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFL_TRM, field VREFL_EN[3] (RW)
 *
 * This bit enables the VREFL (0.4 V) reference buffer.
 *
 * Values:
 * - 0b0 - Disable
 * - 0b1 - Enable
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFL_TRM_VREFL_EN field. */
#define VREF_RD_VREFL_TRM_VREFL_EN(base) ((VREF_VREFL_TRM_REG(base) & VREF_VREFL_TRM_VREFL_EN_MASK) >> VREF_VREFL_TRM_VREFL_EN_SHIFT)
#define VREF_BRD_VREFL_TRM_VREFL_EN(base) (BME_UBFX8(&VREF_VREFL_TRM_REG(base), VREF_VREFL_TRM_VREFL_EN_SHIFT, VREF_VREFL_TRM_VREFL_EN_WIDTH))

/*! @brief Set the VREFL_EN field to a new value. */
#define VREF_WR_VREFL_TRM_VREFL_EN(base, value) (VREF_RMW_VREFL_TRM(base, VREF_VREFL_TRM_VREFL_EN_MASK, VREF_VREFL_TRM_VREFL_EN(value)))
#define VREF_BWR_VREFL_TRM_VREFL_EN(base, value) (BME_BFI8(&VREF_VREFL_TRM_REG(base), ((uint8_t)(value) << VREF_VREFL_TRM_VREFL_EN_SHIFT), VREF_VREFL_TRM_VREFL_EN_SHIFT, VREF_VREFL_TRM_VREFL_EN_WIDTH))
/*@}*/

/*!
 * @name Register VREF_VREFL_TRM, field VREFL_SEL[4] (RW)
 *
 * This bit selects between internal and external 1.2 V reference.
 *
 * Values:
 * - 0b0 - Internal reference
 * - 0b1 - External reference
 */
/*@{*/
/*! @brief Read current value of the VREF_VREFL_TRM_VREFL_SEL field. */
#define VREF_RD_VREFL_TRM_VREFL_SEL(base) ((VREF_VREFL_TRM_REG(base) & VREF_VREFL_TRM_VREFL_SEL_MASK) >> VREF_VREFL_TRM_VREFL_SEL_SHIFT)
#define VREF_BRD_VREFL_TRM_VREFL_SEL(base) (BME_UBFX8(&VREF_VREFL_TRM_REG(base), VREF_VREFL_TRM_VREFL_SEL_SHIFT, VREF_VREFL_TRM_VREFL_SEL_WIDTH))

/*! @brief Set the VREFL_SEL field to a new value. */
#define VREF_WR_VREFL_TRM_VREFL_SEL(base, value) (VREF_RMW_VREFL_TRM(base, VREF_VREFL_TRM_VREFL_SEL_MASK, VREF_VREFL_TRM_VREFL_SEL(value)))
#define VREF_BWR_VREFL_TRM_VREFL_SEL(base, value) (BME_BFI8(&VREF_VREFL_TRM_REG(base), ((uint8_t)(value) << VREF_VREFL_TRM_VREFL_SEL_SHIFT), VREF_VREFL_TRM_VREFL_SEL_SHIFT, VREF_VREFL_TRM_VREFL_SEL_WIDTH))
/*@}*/

