RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the SEL7 field to a new value. */
#define XBAR_WR_SEL3_SEL7(base, value) (XBAR_RMW_SEL3(base, XBAR_SEL3_SEL7_MASK, XBAR_SEL3_SEL7(value)))
#define XBAR_BWR_SEL3_SEL7(base, value) (BME_BFI16(&XBAR_SEL3_REG(base), ((uint16_t)(value) << XBAR_SEL3_SEL7_SHIFT), XBAR_SEL3_SEL7_SHIFT, XBAR_SEL3_SEL7_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL4 - Crossbar Select Register 4
 ******************************************************************************/

/*!
 * @brief XBAR_SEL4 - Crossbar Select Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL4 register
 */
/*@{*/
#define XBAR_RD_SEL4(base)       (XBAR_SEL4_REG(base))
#define XBAR_WR_SEL4(base, value) (XBAR_SEL4_REG(base) = (value))
#define XBAR_RMW_SEL4(base, mask, value) (XBAR_WR_SEL4(base, (XBAR_RD_SEL4(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL4(base, value) (BME_OR16(&XBAR_SEL4_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL4(base, value) (BME_AND16(&XBAR_SEL4_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL4(base, value) (BME_XOR16(&XBAR_SEL4_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL4 bitfields
 */

/*!
 * @name Register XBAR_SEL4, field SEL8[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT8 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL4_SEL8 field. */
#define XBAR_RD_SEL4_SEL8(base) ((XBAR_SEL4_REG(base) & XBAR_SEL4_SEL8_MASK) >> XBAR_SEL4_SEL8_SHIFT)
#define XBAR_BRD_SEL4_SEL8(base) (BME_UBFX16(&XBAR_SEL4_REG(base), XBAR_SEL4_SEL8_SHIFT, XBAR_SEL4_SEL8_WIDTH))

/*! @brief Set the SEL8 field to a new value. */
#define XBAR_WR_SEL4_SEL8(base, value) (XBAR_RMW_SEL4(base, XBAR_SEL4_SEL8_MASK, XBAR_SEL4_SEL8(value)))
#define XBAR_BWR_SEL4_SEL8(base, value) (BME_BFI16(&XBAR_SEL4_REG(base), ((uint16_t)(value) << XBAR_SEL4_SEL8_SHIFT), XBAR_SEL4_SEL8_SHIFT, XBAR_SEL4_SEL8_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL4, field SEL9[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT9 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL4_SEL9 field. */
#define XBAR_RD_SEL4_SEL9(base) ((XBAR_SEL4_REG(base) & XBAR_SEL4_SEL9_MASK) >> XBAR_SEL4_SEL9_SHIFT)
#define XBAR_BRD_SEL4_SEL9(base) (BME_UBFX16(&XBAR_SEL4_REG(base), XBAR_SEL4_SEL9_SHIFT, XBAR_SEL4_SEL9_WIDTH))

/*! @brief Set the SEL9 field to a new value. */
#define XBAR_WR_SEL4_SEL9(base, value) (XBAR_RMW_SEL4(base, XBAR_SEL4_SEL9_MASK, XBAR_SEL4_SEL9(value)))
#define XBAR_BWR_SEL4_SEL9(base, value) (BME_BFI16(&XBAR_SEL4_REG(base), ((uint16_t)(value) << XBAR_SEL4_SEL9_SHIFT), XBAR_SEL4_SEL9_SHIFT, XBAR_SEL4_SEL9_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL5 - Crossbar Select Register 5
 ******************************************************************************/

/*!
 * @brief XBAR_SEL5 - Crossbar Select Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL5 register
 */
/*@{*/
#define XBAR_RD_SEL5(base)       (XBAR_SEL5_REG(base))
#define XBAR_WR_SEL5(base, value) (XBAR_SEL5_REG(base) = (value))
#define XBAR_RMW_SEL5(base, mask, value) (XBAR_WR_SEL5(base, (XBAR_RD_SEL5(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL5(base, value) (BME_OR16(&XBAR_SEL5_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL5(base, value) (BME_AND16(&XBAR_SEL5_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL5(base, value) (BME_XOR16(&XBAR_SEL5_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL5 bitfields
 */

/*!
 * @name Register XBAR_SEL5, field SEL10[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT10 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL5_SEL10 field. */
#define XBAR_RD_SEL5_SEL10(base) ((XBAR_SEL5_REG(base) & XBAR_SEL5_SEL10_MASK) >> XBAR_SEL5_SEL10_SHIFT)
#define XBAR_BRD_SEL5_SEL10(base) (BME_UBFX16(&XBAR_SEL5_REG(base), XBAR_SEL5_SEL10_SHIFT, XBAR_SEL5_SEL10_WIDTH))

/*! @brief Set the SEL10 field to a new value. */
#define XBAR_WR_SEL5_SEL10(base, value) (XBAR_RMW_SEL5(base, XBAR_SEL5_SEL10_MASK, XBAR_SEL5_SEL10(value)))
#define XBAR_BWR_SEL5_SEL10(base, value) (BME_BFI16(&XBAR_SEL5_REG(base), ((uint16_t)(value) << XBAR_SEL5_SEL10_SHIFT), XBAR_SEL5_SEL10_SHIFT, XBAR_SEL5_SEL10_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL5, field SEL11[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT11 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL5_SEL11 field. */
#define XBAR_RD_SEL5_SEL11(base) ((XBAR_SEL5_REG(base) & XBAR_SEL5_SEL11_MASK) >> XBAR_SEL5_SEL11_SHIFT)
#define XBAR_BRD_SEL5_SEL11(base) (BME_UBFX16(&XBAR_SEL5_REG(base), XBAR_SEL5_SEL11_SHIFT, XBAR_SEL5_SEL11_WIDTH))

/*! @brief Set the SEL11 field to a new value. */
#define XBAR_WR_SEL5_SEL11(base, value) (XBAR_RMW_SEL5(base, XBAR_SEL5_SEL11_MASK, XBAR_SEL5_SEL11(value)))
#define XBAR_BWR_SEL5_SEL11(base, value) (BME_BFI16(&XBAR_SEL5_REG(base), ((uint16_t)(value) << XBAR_SEL5_SEL11_SHIFT), XBAR_SEL5_SEL11_SHIFT, XBAR_SEL5_SEL11_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL6 - Crossbar Select Register 6
 ******************************************************************************/

/*!
 * @brief XBAR_SEL6 - Crossbar Select Register 6 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL6 register
 */
/*@{*/
#define XBAR_RD_SEL6(base)       (XBAR_SEL6_REG(base))
#define XBAR_WR_SEL6(base, value) (XBAR_SEL6_REG(base) = (value))
#define XBAR_RMW_SEL6(base, mask, value) (XBAR_WR_SEL6(base, (XBAR_RD_SEL6(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL6(base, value) (BME_OR16(&XBAR_SEL6_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL6(base, value) (BME_AND16(&XBAR_SEL6_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL6(base, value) (BME_XOR16(&XBAR_SEL6_REG(base), (uint16_t)(value)))
/*@}*/

