RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*
 * Constants & macros for individual XBAR_SEL6 bitfields
 */

/*!
 * @name Register XBAR_SEL6, field SEL12[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT12 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL6_SEL12 field. */
#define XBAR_RD_SEL6_SEL12(base) ((XBAR_SEL6_REG(base) & XBAR_SEL6_SEL12_MASK) >> XBAR_SEL6_SEL12_SHIFT)
#define XBAR_BRD_SEL6_SEL12(base) (BME_UBFX16(&XBAR_SEL6_REG(base), XBAR_SEL6_SEL12_SHIFT, XBAR_SEL6_SEL12_WIDTH))

/*! @brief Set the SEL12 field to a new value. */
#define XBAR_WR_SEL6_SEL12(base, value) (XBAR_RMW_SEL6(base, XBAR_SEL6_SEL12_MASK, XBAR_SEL6_SEL12(value)))
#define XBAR_BWR_SEL6_SEL12(base, value) (BME_BFI16(&XBAR_SEL6_REG(base), ((uint16_t)(value) << XBAR_SEL6_SEL12_SHIFT), XBAR_SEL6_SEL12_SHIFT, XBAR_SEL6_SEL12_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL6, field SEL13[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT13 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL6_SEL13 field. */
#define XBAR_RD_SEL6_SEL13(base) ((XBAR_SEL6_REG(base) & XBAR_SEL6_SEL13_MASK) >> XBAR_SEL6_SEL13_SHIFT)
#define XBAR_BRD_SEL6_SEL13(base) (BME_UBFX16(&XBAR_SEL6_REG(base), XBAR_SEL6_SEL13_SHIFT, XBAR_SEL6_SEL13_WIDTH))

/*! @brief Set the SEL13 field to a new value. */
#define XBAR_WR_SEL6_SEL13(base, value) (XBAR_RMW_SEL6(base, XBAR_SEL6_SEL13_MASK, XBAR_SEL6_SEL13(value)))
#define XBAR_BWR_SEL6_SEL13(base, value) (BME_BFI16(&XBAR_SEL6_REG(base), ((uint16_t)(value) << XBAR_SEL6_SEL13_SHIFT), XBAR_SEL6_SEL13_SHIFT, XBAR_SEL6_SEL13_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL7 - Crossbar Select Register 7
 ******************************************************************************/

/*!
 * @brief XBAR_SEL7 - Crossbar Select Register 7 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL7 register
 */
/*@{*/
#define XBAR_RD_SEL7(base)       (XBAR_SEL7_REG(base))
#define XBAR_WR_SEL7(base, value) (XBAR_SEL7_REG(base) = (value))
#define XBAR_RMW_SEL7(base, mask, value) (XBAR_WR_SEL7(base, (XBAR_RD_SEL7(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL7(base, value) (BME_OR16(&XBAR_SEL7_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL7(base, value) (BME_AND16(&XBAR_SEL7_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL7(base, value) (BME_XOR16(&XBAR_SEL7_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL7 bitfields
 */

/*!
 * @name Register XBAR_SEL7, field SEL14[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT14 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL7_SEL14 field. */
#define XBAR_RD_SEL7_SEL14(base) ((XBAR_SEL7_REG(base) & XBAR_SEL7_SEL14_MASK) >> XBAR_SEL7_SEL14_SHIFT)
#define XBAR_BRD_SEL7_SEL14(base) (BME_UBFX16(&XBAR_SEL7_REG(base), XBAR_SEL7_SEL14_SHIFT, XBAR_SEL7_SEL14_WIDTH))

/*! @brief Set the SEL14 field to a new value. */
#define XBAR_WR_SEL7_SEL14(base, value) (XBAR_RMW_SEL7(base, XBAR_SEL7_SEL14_MASK, XBAR_SEL7_SEL14(value)))
#define XBAR_BWR_SEL7_SEL14(base, value) (BME_BFI16(&XBAR_SEL7_REG(base), ((uint16_t)(value) << XBAR_SEL7_SEL14_SHIFT), XBAR_SEL7_SEL14_SHIFT, XBAR_SEL7_SEL14_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL7, field SEL15[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT15 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL7_SEL15 field. */
#define XBAR_RD_SEL7_SEL15(base) ((XBAR_SEL7_REG(base) & XBAR_SEL7_SEL15_MASK) >> XBAR_SEL7_SEL15_SHIFT)
#define XBAR_BRD_SEL7_SEL15(base) (BME_UBFX16(&XBAR_SEL7_REG(base), XBAR_SEL7_SEL15_SHIFT, XBAR_SEL7_SEL15_WIDTH))

/*! @brief Set the SEL15 field to a new value. */
#define XBAR_WR_SEL7_SEL15(base, value) (XBAR_RMW_SEL7(base, XBAR_SEL7_SEL15_MASK, XBAR_SEL7_SEL15(value)))
#define XBAR_BWR_SEL7_SEL15(base, value) (BME_BFI16(&XBAR_SEL7_REG(base), ((uint16_t)(value) << XBAR_SEL7_SEL15_SHIFT), XBAR_SEL7_SEL15_SHIFT, XBAR_SEL7_SEL15_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL8 - Crossbar Select Register 8
 ******************************************************************************/

/*!
 * @brief XBAR_SEL8 - Crossbar Select Register 8 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL8 register
 */
/*@{*/
#define XBAR_RD_SEL8(base)       (XBAR_SEL8_REG(base))
#define XBAR_WR_SEL8(base, value) (XBAR_SEL8_REG(base) = (value))
#define XBAR_RMW_SEL8(base, mask, value) (XBAR_WR_SEL8(base, (XBAR_RD_SEL8(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL8(base, value) (BME_OR16(&XBAR_SEL8_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL8(base, value) (BME_AND16(&XBAR_SEL8_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL8(base, value) (BME_XOR16(&XBAR_SEL8_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL8 bitfields
 */

/*!
 * @name Register XBAR_SEL8, field SEL16[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT16 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL8_SEL16 field. */
#define XBAR_RD_SEL8_SEL16(base) ((XBAR_SEL8_REG(base) & XBAR_SEL8_SEL16_MASK) >> XBAR_SEL8_SEL16_SHIFT)
#define XBAR_BRD_SEL8_SEL16(base) (BME_UBFX16(&XBAR_SEL8_REG(base), XBAR_SEL8_SEL16_SHIFT, XBAR_SEL8_SEL16_WIDTH))

/*! @brief Set the SEL16 field to a new value. */
#define XBAR_WR_SEL8_SEL16(base, value) (XBAR_RMW_SEL8(base, XBAR_SEL8_SEL16_MASK, XBAR_SEL8_SEL16(value)))
#define XBAR_BWR_SEL8_SEL16(base, value) (BME_BFI16(&XBAR_SEL8_REG(base), ((uint16_t)(value) << XBAR_SEL8_SEL16_SHIFT), XBAR_SEL8_SEL16_SHIFT, XBAR_SEL8_SEL16_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL8, field SEL17[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT17 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL8_SEL17 field. */
#define XBAR_RD_SEL8_SEL17(base) ((XBAR_SEL8_REG(base) & XBAR_SEL8_SEL17_MASK) >> XBAR_SEL8_SEL17_SHIFT)
#define XBAR_BRD_SEL8_SEL17(base) (BME_UBFX16(&XBAR_SEL8_REG(base), XBAR_SEL8_SEL17_SHIFT, XBAR_SEL8_SEL17_WIDTH))

/*! @brief Set the SEL17 field to a new value. */
#define XBAR_WR_SEL8_SEL17(base, value) (XBAR_RMW_SEL8(base, XBAR_SEL8_SEL17_MASK, XBAR_SEL8_SEL17(value)))
#define XBAR_BWR_SEL8_SEL17(base, value) (BME_BFI16(&XBAR_SEL8_REG(base), ((uint16_t)(value) << XBAR_SEL8_SEL17_SHIFT), XBAR_SEL8_SEL17_SHIFT, XBAR_SEL8_SEL17_WIDTH))
/*@}*/

