RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * XBAR_SEL9 - Crossbar Select Register 9
 ******************************************************************************/

/*!
 * @brief XBAR_SEL9 - Crossbar Select Register 9 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL9 register
 */
/*@{*/
#define XBAR_RD_SEL9(base)       (XBAR_SEL9_REG(base))
#define XBAR_WR_SEL9(base, value) (XBAR_SEL9_REG(base) = (value))
#define XBAR_RMW_SEL9(base, mask, value) (XBAR_WR_SEL9(base, (XBAR_RD_SEL9(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL9(base, value) (BME_OR16(&XBAR_SEL9_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL9(base, value) (BME_AND16(&XBAR_SEL9_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL9(base, value) (BME_XOR16(&XBAR_SEL9_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL9 bitfields
 */

/*!
 * @name Register XBAR_SEL9, field SEL18[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT18 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL9_SEL18 field. */
#define XBAR_RD_SEL9_SEL18(base) ((XBAR_SEL9_REG(base) & XBAR_SEL9_SEL18_MASK) >> XBAR_SEL9_SEL18_SHIFT)
#define XBAR_BRD_SEL9_SEL18(base) (BME_UBFX16(&XBAR_SEL9_REG(base), XBAR_SEL9_SEL18_SHIFT, XBAR_SEL9_SEL18_WIDTH))

/*! @brief Set the SEL18 field to a new value. */
#define XBAR_WR_SEL9_SEL18(base, value) (XBAR_RMW_SEL9(base, XBAR_SEL9_SEL18_MASK, XBAR_SEL9_SEL18(value)))
#define XBAR_BWR_SEL9_SEL18(base, value) (BME_BFI16(&XBAR_SEL9_REG(base), ((uint16_t)(value) << XBAR_SEL9_SEL18_SHIFT), XBAR_SEL9_SEL18_SHIFT, XBAR_SEL9_SEL18_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL9, field SEL19[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT19 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL9_SEL19 field. */
#define XBAR_RD_SEL9_SEL19(base) ((XBAR_SEL9_REG(base) & XBAR_SEL9_SEL19_MASK) >> XBAR_SEL9_SEL19_SHIFT)
#define XBAR_BRD_SEL9_SEL19(base) (BME_UBFX16(&XBAR_SEL9_REG(base), XBAR_SEL9_SEL19_SHIFT, XBAR_SEL9_SEL19_WIDTH))

/*! @brief Set the SEL19 field to a new value. */
#define XBAR_WR_SEL9_SEL19(base, value) (XBAR_RMW_SEL9(base, XBAR_SEL9_SEL19_MASK, XBAR_SEL9_SEL19(value)))
#define XBAR_BWR_SEL9_SEL19(base, value) (BME_BFI16(&XBAR_SEL9_REG(base), ((uint16_t)(value) << XBAR_SEL9_SEL19_SHIFT), XBAR_SEL9_SEL19_SHIFT, XBAR_SEL9_SEL19_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL10 - Crossbar Select Register 10
 ******************************************************************************/

/*!
 * @brief XBAR_SEL10 - Crossbar Select Register 10 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL10 register
 */
/*@{*/
#define XBAR_RD_SEL10(base)      (XBAR_SEL10_REG(base))
#define XBAR_WR_SEL10(base, value) (XBAR_SEL10_REG(base) = (value))
#define XBAR_RMW_SEL10(base, mask, value) (XBAR_WR_SEL10(base, (XBAR_RD_SEL10(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL10(base, value) (BME_OR16(&XBAR_SEL10_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL10(base, value) (BME_AND16(&XBAR_SEL10_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL10(base, value) (BME_XOR16(&XBAR_SEL10_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL10 bitfields
 */

/*!
 * @name Register XBAR_SEL10, field SEL20[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT20 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL10_SEL20 field. */
#define XBAR_RD_SEL10_SEL20(base) ((XBAR_SEL10_REG(base) & XBAR_SEL10_SEL20_MASK) >> XBAR_SEL10_SEL20_SHIFT)
#define XBAR_BRD_SEL10_SEL20(base) (BME_UBFX16(&XBAR_SEL10_REG(base), XBAR_SEL10_SEL20_SHIFT, XBAR_SEL10_SEL20_WIDTH))

/*! @brief Set the SEL20 field to a new value. */
#define XBAR_WR_SEL10_SEL20(base, value) (XBAR_RMW_SEL10(base, XBAR_SEL10_SEL20_MASK, XBAR_SEL10_SEL20(value)))
#define XBAR_BWR_SEL10_SEL20(base, value) (BME_BFI16(&XBAR_SEL10_REG(base), ((uint16_t)(value) << XBAR_SEL10_SEL20_SHIFT), XBAR_SEL10_SEL20_SHIFT, XBAR_SEL10_SEL20_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL10, field SEL21[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT21 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL10_SEL21 field. */
#define XBAR_RD_SEL10_SEL21(base) ((XBAR_SEL10_REG(base) & XBAR_SEL10_SEL21_MASK) >> XBAR_SEL10_SEL21_SHIFT)
#define XBAR_BRD_SEL10_SEL21(base) (BME_UBFX16(&XBAR_SEL10_REG(base), XBAR_SEL10_SEL21_SHIFT, XBAR_SEL10_SEL21_WIDTH))

/*! @brief Set the SEL21 field to a new value. */
#define XBAR_WR_SEL10_SEL21(base, value) (XBAR_RMW_SEL10(base, XBAR_SEL10_SEL21_MASK, XBAR_SEL10_SEL21(value)))
#define XBAR_BWR_SEL10_SEL21(base, value) (BME_BFI16(&XBAR_SEL10_REG(base), ((uint16_t)(value) << XBAR_SEL10_SEL21_SHIFT), XBAR_SEL10_SEL21_SHIFT, XBAR_SEL10_SEL21_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL11 - Crossbar Select Register 11
 ******************************************************************************/

/*!
 * @brief XBAR_SEL11 - Crossbar Select Register 11 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL11 register
 */
/*@{*/
#define XBAR_RD_SEL11(base)      (XBAR_SEL11_REG(base))
#define XBAR_WR_SEL11(base, value) (XBAR_SEL11_REG(base) = (value))
#define XBAR_RMW_SEL11(base, mask, value) (XBAR_WR_SEL11(base, (XBAR_RD_SEL11(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL11(base, value) (BME_OR16(&XBAR_SEL11_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL11(base, value) (BME_AND16(&XBAR_SEL11_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL11(base, value) (BME_XOR16(&XBAR_SEL11_REG(base), (uint16_t)(value)))
/*@}*/

