RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*! @brief Set the SEL27 field to a new value. */
#define XBAR_WR_SEL13_SEL27(base, value) (XBAR_RMW_SEL13(base, XBAR_SEL13_SEL27_MASK, XBAR_SEL13_SEL27(value)))
#define XBAR_BWR_SEL13_SEL27(base, value) (BME_BFI16(&XBAR_SEL13_REG(base), ((uint16_t)(value) << XBAR_SEL13_SEL27_SHIFT), XBAR_SEL13_SEL27_SHIFT, XBAR_SEL13_SEL27_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL14 - Crossbar Select Register 14
 ******************************************************************************/

/*!
 * @brief XBAR_SEL14 - Crossbar Select Register 14 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL14 register
 */
/*@{*/
#define XBAR_RD_SEL14(base)      (XBAR_SEL14_REG(base))
#define XBAR_WR_SEL14(base, value) (XBAR_SEL14_REG(base) = (value))
#define XBAR_RMW_SEL14(base, mask, value) (XBAR_WR_SEL14(base, (XBAR_RD_SEL14(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL14(base, value) (BME_OR16(&XBAR_SEL14_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL14(base, value) (BME_AND16(&XBAR_SEL14_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL14(base, value) (BME_XOR16(&XBAR_SEL14_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL14 bitfields
 */

/*!
 * @name Register XBAR_SEL14, field SEL28[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT28 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL14_SEL28 field. */
#define XBAR_RD_SEL14_SEL28(base) ((XBAR_SEL14_REG(base) & XBAR_SEL14_SEL28_MASK) >> XBAR_SEL14_SEL28_SHIFT)
#define XBAR_BRD_SEL14_SEL28(base) (BME_UBFX16(&XBAR_SEL14_REG(base), XBAR_SEL14_SEL28_SHIFT, XBAR_SEL14_SEL28_WIDTH))

/*! @brief Set the SEL28 field to a new value. */
#define XBAR_WR_SEL14_SEL28(base, value) (XBAR_RMW_SEL14(base, XBAR_SEL14_SEL28_MASK, XBAR_SEL14_SEL28(value)))
#define XBAR_BWR_SEL14_SEL28(base, value) (BME_BFI16(&XBAR_SEL14_REG(base), ((uint16_t)(value) << XBAR_SEL14_SEL28_SHIFT), XBAR_SEL14_SEL28_SHIFT, XBAR_SEL14_SEL28_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL14, field SEL29[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT29 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL14_SEL29 field. */
#define XBAR_RD_SEL14_SEL29(base) ((XBAR_SEL14_REG(base) & XBAR_SEL14_SEL29_MASK) >> XBAR_SEL14_SEL29_SHIFT)
#define XBAR_BRD_SEL14_SEL29(base) (BME_UBFX16(&XBAR_SEL14_REG(base), XBAR_SEL14_SEL29_SHIFT, XBAR_SEL14_SEL29_WIDTH))

/*! @brief Set the SEL29 field to a new value. */
#define XBAR_WR_SEL14_SEL29(base, value) (XBAR_RMW_SEL14(base, XBAR_SEL14_SEL29_MASK, XBAR_SEL14_SEL29(value)))
#define XBAR_BWR_SEL14_SEL29(base, value) (BME_BFI16(&XBAR_SEL14_REG(base), ((uint16_t)(value) << XBAR_SEL14_SEL29_SHIFT), XBAR_SEL14_SEL29_SHIFT, XBAR_SEL14_SEL29_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL15 - Crossbar Select Register 15
 ******************************************************************************/

/*!
 * @brief XBAR_SEL15 - Crossbar Select Register 15 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL15 register
 */
/*@{*/
#define XBAR_RD_SEL15(base)      (XBAR_SEL15_REG(base))
#define XBAR_WR_SEL15(base, value) (XBAR_SEL15_REG(base) = (value))
#define XBAR_RMW_SEL15(base, mask, value) (XBAR_WR_SEL15(base, (XBAR_RD_SEL15(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL15(base, value) (BME_OR16(&XBAR_SEL15_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL15(base, value) (BME_AND16(&XBAR_SEL15_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL15(base, value) (BME_XOR16(&XBAR_SEL15_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL15 bitfields
 */

/*!
 * @name Register XBAR_SEL15, field SEL30[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT30 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL15_SEL30 field. */
#define XBAR_RD_SEL15_SEL30(base) ((XBAR_SEL15_REG(base) & XBAR_SEL15_SEL30_MASK) >> XBAR_SEL15_SEL30_SHIFT)
#define XBAR_BRD_SEL15_SEL30(base) (BME_UBFX16(&XBAR_SEL15_REG(base), XBAR_SEL15_SEL30_SHIFT, XBAR_SEL15_SEL30_WIDTH))

/*! @brief Set the SEL30 field to a new value. */
#define XBAR_WR_SEL15_SEL30(base, value) (XBAR_RMW_SEL15(base, XBAR_SEL15_SEL30_MASK, XBAR_SEL15_SEL30(value)))
#define XBAR_BWR_SEL15_SEL30(base, value) (BME_BFI16(&XBAR_SEL15_REG(base), ((uint16_t)(value) << XBAR_SEL15_SEL30_SHIFT), XBAR_SEL15_SEL30_SHIFT, XBAR_SEL15_SEL30_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL15, field SEL31[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT31 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL15_SEL31 field. */
#define XBAR_RD_SEL15_SEL31(base) ((XBAR_SEL15_REG(base) & XBAR_SEL15_SEL31_MASK) >> XBAR_SEL15_SEL31_SHIFT)
#define XBAR_BRD_SEL15_SEL31(base) (BME_UBFX16(&XBAR_SEL15_REG(base), XBAR_SEL15_SEL31_SHIFT, XBAR_SEL15_SEL31_WIDTH))

/*! @brief Set the SEL31 field to a new value. */
#define XBAR_WR_SEL15_SEL31(base, value) (XBAR_RMW_SEL15(base, XBAR_SEL15_SEL31_MASK, XBAR_SEL15_SEL31(value)))
#define XBAR_BWR_SEL15_SEL31(base, value) (BME_BFI16(&XBAR_SEL15_REG(base), ((uint16_t)(value) << XBAR_SEL15_SEL31_SHIFT), XBAR_SEL15_SEL31_SHIFT, XBAR_SEL15_SEL31_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL16 - Crossbar Select Register 16
 ******************************************************************************/

/*!
 * @brief XBAR_SEL16 - Crossbar Select Register 16 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL16 register
 */
/*@{*/
#define XBAR_RD_SEL16(base)      (XBAR_SEL16_REG(base))
#define XBAR_WR_SEL16(base, value) (XBAR_SEL16_REG(base) = (value))
#define XBAR_RMW_SEL16(base, mask, value) (XBAR_WR_SEL16(base, (XBAR_RD_SEL16(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL16(base, value) (BME_OR16(&XBAR_SEL16_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL16(base, value) (BME_AND16(&XBAR_SEL16_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL16(base, value) (BME_XOR16(&XBAR_SEL16_REG(base), (uint16_t)(value)))
/*@}*/

