RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*
 * Constants & macros for individual XBAR_SEL16 bitfields
 */

/*!
 * @name Register XBAR_SEL16, field SEL32[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT32
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL16_SEL32 field. */
#define XBAR_RD_SEL16_SEL32(base) ((XBAR_SEL16_REG(base) & XBAR_SEL16_SEL32_MASK) >> XBAR_SEL16_SEL32_SHIFT)
#define XBAR_BRD_SEL16_SEL32(base) (BME_UBFX16(&XBAR_SEL16_REG(base), XBAR_SEL16_SEL32_SHIFT, XBAR_SEL16_SEL32_WIDTH))

/*! @brief Set the SEL32 field to a new value. */
#define XBAR_WR_SEL16_SEL32(base, value) (XBAR_RMW_SEL16(base, XBAR_SEL16_SEL32_MASK, XBAR_SEL16_SEL32(value)))
#define XBAR_BWR_SEL16_SEL32(base, value) (BME_BFI16(&XBAR_SEL16_REG(base), ((uint16_t)(value) << XBAR_SEL16_SEL32_SHIFT), XBAR_SEL16_SEL32_SHIFT, XBAR_SEL16_SEL32_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL16, field SEL33[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT33
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL16_SEL33 field. */
#define XBAR_RD_SEL16_SEL33(base) ((XBAR_SEL16_REG(base) & XBAR_SEL16_SEL33_MASK) >> XBAR_SEL16_SEL33_SHIFT)
#define XBAR_BRD_SEL16_SEL33(base) (BME_UBFX16(&XBAR_SEL16_REG(base), XBAR_SEL16_SEL33_SHIFT, XBAR_SEL16_SEL33_WIDTH))

/*! @brief Set the SEL33 field to a new value. */
#define XBAR_WR_SEL16_SEL33(base, value) (XBAR_RMW_SEL16(base, XBAR_SEL16_SEL33_MASK, XBAR_SEL16_SEL33(value)))
#define XBAR_BWR_SEL16_SEL33(base, value) (BME_BFI16(&XBAR_SEL16_REG(base), ((uint16_t)(value) << XBAR_SEL16_SEL33_SHIFT), XBAR_SEL16_SEL33_SHIFT, XBAR_SEL16_SEL33_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL17 - Crossbar Select Register 17
 ******************************************************************************/

/*!
 * @brief XBAR_SEL17 - Crossbar Select Register 17 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL17 register
 */
/*@{*/
#define XBAR_RD_SEL17(base)      (XBAR_SEL17_REG(base))
#define XBAR_WR_SEL17(base, value) (XBAR_SEL17_REG(base) = (value))
#define XBAR_RMW_SEL17(base, mask, value) (XBAR_WR_SEL17(base, (XBAR_RD_SEL17(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL17(base, value) (BME_OR16(&XBAR_SEL17_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL17(base, value) (BME_AND16(&XBAR_SEL17_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL17(base, value) (BME_XOR16(&XBAR_SEL17_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL17 bitfields
 */

/*!
 * @name Register XBAR_SEL17, field SEL34[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT34
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL17_SEL34 field. */
#define XBAR_RD_SEL17_SEL34(base) ((XBAR_SEL17_REG(base) & XBAR_SEL17_SEL34_MASK) >> XBAR_SEL17_SEL34_SHIFT)
#define XBAR_BRD_SEL17_SEL34(base) (BME_UBFX16(&XBAR_SEL17_REG(base), XBAR_SEL17_SEL34_SHIFT, XBAR_SEL17_SEL34_WIDTH))

/*! @brief Set the SEL34 field to a new value. */
#define XBAR_WR_SEL17_SEL34(base, value) (XBAR_RMW_SEL17(base, XBAR_SEL17_SEL34_MASK, XBAR_SEL17_SEL34(value)))
#define XBAR_BWR_SEL17_SEL34(base, value) (BME_BFI16(&XBAR_SEL17_REG(base), ((uint16_t)(value) << XBAR_SEL17_SEL34_SHIFT), XBAR_SEL17_SEL34_SHIFT, XBAR_SEL17_SEL34_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL17, field SEL35[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT35
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL17_SEL35 field. */
#define XBAR_RD_SEL17_SEL35(base) ((XBAR_SEL17_REG(base) & XBAR_SEL17_SEL35_MASK) >> XBAR_SEL17_SEL35_SHIFT)
#define XBAR_BRD_SEL17_SEL35(base) (BME_UBFX16(&XBAR_SEL17_REG(base), XBAR_SEL17_SEL35_SHIFT, XBAR_SEL17_SEL35_WIDTH))

/*! @brief Set the SEL35 field to a new value. */
#define XBAR_WR_SEL17_SEL35(base, value) (XBAR_RMW_SEL17(base, XBAR_SEL17_SEL35_MASK, XBAR_SEL17_SEL35(value)))
#define XBAR_BWR_SEL17_SEL35(base, value) (BME_BFI16(&XBAR_SEL17_REG(base), ((uint16_t)(value) << XBAR_SEL17_SEL35_SHIFT), XBAR_SEL17_SEL35_SHIFT, XBAR_SEL17_SEL35_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL18 - Crossbar Select Register 18
 ******************************************************************************/

/*!
 * @brief XBAR_SEL18 - Crossbar Select Register 18 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL18 register
 */
/*@{*/
#define XBAR_RD_SEL18(base)      (XBAR_SEL18_REG(base))
#define XBAR_WR_SEL18(base, value) (XBAR_SEL18_REG(base) = (value))
#define XBAR_RMW_SEL18(base, mask, value) (XBAR_WR_SEL18(base, (XBAR_RD_SEL18(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL18(base, value) (BME_OR16(&XBAR_SEL18_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL18(base, value) (BME_AND16(&XBAR_SEL18_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL18(base, value) (BME_XOR16(&XBAR_SEL18_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL18 bitfields
 */

/*!
 * @name Register XBAR_SEL18, field SEL36[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT36
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL18_SEL36 field. */
#define XBAR_RD_SEL18_SEL36(base) ((XBAR_SEL18_REG(base) & XBAR_SEL18_SEL36_MASK) >> XBAR_SEL18_SEL36_SHIFT)
#define XBAR_BRD_SEL18_SEL36(base) (BME_UBFX16(&XBAR_SEL18_REG(base), XBAR_SEL18_SEL36_SHIFT, XBAR_SEL18_SEL36_WIDTH))

/*! @brief Set the SEL36 field to a new value. */
#define XBAR_WR_SEL18_SEL36(base, value) (XBAR_RMW_SEL18(base, XBAR_SEL18_SEL36_MASK, XBAR_SEL18_SEL36(value)))
#define XBAR_BWR_SEL18_SEL36(base, value) (BME_BFI16(&XBAR_SEL18_REG(base), ((uint16_t)(value) << XBAR_SEL18_SEL36_SHIFT), XBAR_SEL18_SEL36_SHIFT, XBAR_SEL18_SEL36_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL18, field SEL37[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT37
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL18_SEL37 field. */
#define XBAR_RD_SEL18_SEL37(base) ((XBAR_SEL18_REG(base) & XBAR_SEL18_SEL37_MASK) >> XBAR_SEL18_SEL37_SHIFT)
#define XBAR_BRD_SEL18_SEL37(base) (BME_UBFX16(&XBAR_SEL18_REG(base), XBAR_SEL18_SEL37_SHIFT, XBAR_SEL18_SEL37_WIDTH))

/*! @brief Set the SEL37 field to a new value. */
#define XBAR_WR_SEL18_SEL37(base, value) (XBAR_RMW_SEL18(base, XBAR_SEL18_SEL37_MASK, XBAR_SEL18_SEL37(value)))
#define XBAR_BWR_SEL18_SEL37(base, value) (BME_BFI16(&XBAR_SEL18_REG(base), ((uint16_t)(value) << XBAR_SEL18_SEL37_SHIFT), XBAR_SEL18_SEL37_SHIFT, XBAR_SEL18_SEL37_WIDTH))
/*@}*/

