RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * XBAR_SEL19 - Crossbar Select Register 19
 ******************************************************************************/

/*!
 * @brief XBAR_SEL19 - Crossbar Select Register 19 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL19 register
 */
/*@{*/
#define XBAR_RD_SEL19(base)      (XBAR_SEL19_REG(base))
#define XBAR_WR_SEL19(base, value) (XBAR_SEL19_REG(base) = (value))
#define XBAR_RMW_SEL19(base, mask, value) (XBAR_WR_SEL19(base, (XBAR_RD_SEL19(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL19(base, value) (BME_OR16(&XBAR_SEL19_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL19(base, value) (BME_AND16(&XBAR_SEL19_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL19(base, value) (BME_XOR16(&XBAR_SEL19_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL19 bitfields
 */

/*!
 * @name Register XBAR_SEL19, field SEL38[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT38
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL19_SEL38 field. */
#define XBAR_RD_SEL19_SEL38(base) ((XBAR_SEL19_REG(base) & XBAR_SEL19_SEL38_MASK) >> XBAR_SEL19_SEL38_SHIFT)
#define XBAR_BRD_SEL19_SEL38(base) (BME_UBFX16(&XBAR_SEL19_REG(base), XBAR_SEL19_SEL38_SHIFT, XBAR_SEL19_SEL38_WIDTH))

/*! @brief Set the SEL38 field to a new value. */
#define XBAR_WR_SEL19_SEL38(base, value) (XBAR_RMW_SEL19(base, XBAR_SEL19_SEL38_MASK, XBAR_SEL19_SEL38(value)))
#define XBAR_BWR_SEL19_SEL38(base, value) (BME_BFI16(&XBAR_SEL19_REG(base), ((uint16_t)(value) << XBAR_SEL19_SEL38_SHIFT), XBAR_SEL19_SEL38_SHIFT, XBAR_SEL19_SEL38_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL19, field SEL39[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT39
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL19_SEL39 field. */
#define XBAR_RD_SEL19_SEL39(base) ((XBAR_SEL19_REG(base) & XBAR_SEL19_SEL39_MASK) >> XBAR_SEL19_SEL39_SHIFT)
#define XBAR_BRD_SEL19_SEL39(base) (BME_UBFX16(&XBAR_SEL19_REG(base), XBAR_SEL19_SEL39_SHIFT, XBAR_SEL19_SEL39_WIDTH))

/*! @brief Set the SEL39 field to a new value. */
#define XBAR_WR_SEL19_SEL39(base, value) (XBAR_RMW_SEL19(base, XBAR_SEL19_SEL39_MASK, XBAR_SEL19_SEL39(value)))
#define XBAR_BWR_SEL19_SEL39(base, value) (BME_BFI16(&XBAR_SEL19_REG(base), ((uint16_t)(value) << XBAR_SEL19_SEL39_SHIFT), XBAR_SEL19_SEL39_SHIFT, XBAR_SEL19_SEL39_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL20 - Crossbar Select Register 20
 ******************************************************************************/

/*!
 * @brief XBAR_SEL20 - Crossbar Select Register 20 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL20 register
 */
/*@{*/
#define XBAR_RD_SEL20(base)      (XBAR_SEL20_REG(base))
#define XBAR_WR_SEL20(base, value) (XBAR_SEL20_REG(base) = (value))
#define XBAR_RMW_SEL20(base, mask, value) (XBAR_WR_SEL20(base, (XBAR_RD_SEL20(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL20(base, value) (BME_OR16(&XBAR_SEL20_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL20(base, value) (BME_AND16(&XBAR_SEL20_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL20(base, value) (BME_XOR16(&XBAR_SEL20_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL20 bitfields
 */

/*!
 * @name Register XBAR_SEL20, field SEL40[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT40
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL20_SEL40 field. */
#define XBAR_RD_SEL20_SEL40(base) ((XBAR_SEL20_REG(base) & XBAR_SEL20_SEL40_MASK) >> XBAR_SEL20_SEL40_SHIFT)
#define XBAR_BRD_SEL20_SEL40(base) (BME_UBFX16(&XBAR_SEL20_REG(base), XBAR_SEL20_SEL40_SHIFT, XBAR_SEL20_SEL40_WIDTH))

/*! @brief Set the SEL40 field to a new value. */
#define XBAR_WR_SEL20_SEL40(base, value) (XBAR_RMW_SEL20(base, XBAR_SEL20_SEL40_MASK, XBAR_SEL20_SEL40(value)))
#define XBAR_BWR_SEL20_SEL40(base, value) (BME_BFI16(&XBAR_SEL20_REG(base), ((uint16_t)(value) << XBAR_SEL20_SEL40_SHIFT), XBAR_SEL20_SEL40_SHIFT, XBAR_SEL20_SEL40_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL20, field SEL41[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT41
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL20_SEL41 field. */
#define XBAR_RD_SEL20_SEL41(base) ((XBAR_SEL20_REG(base) & XBAR_SEL20_SEL41_MASK) >> XBAR_SEL20_SEL41_SHIFT)
#define XBAR_BRD_SEL20_SEL41(base) (BME_UBFX16(&XBAR_SEL20_REG(base), XBAR_SEL20_SEL41_SHIFT, XBAR_SEL20_SEL41_WIDTH))

/*! @brief Set the SEL41 field to a new value. */
#define XBAR_WR_SEL20_SEL41(base, value) (XBAR_RMW_SEL20(base, XBAR_SEL20_SEL41_MASK, XBAR_SEL20_SEL41(value)))
#define XBAR_BWR_SEL20_SEL41(base, value) (BME_BFI16(&XBAR_SEL20_REG(base), ((uint16_t)(value) << XBAR_SEL20_SEL41_SHIFT), XBAR_SEL20_SEL41_SHIFT, XBAR_SEL20_SEL41_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL21 - Crossbar Select Register 21
 ******************************************************************************/

/*!
 * @brief XBAR_SEL21 - Crossbar Select Register 21 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL21 register
 */
/*@{*/
#define XBAR_RD_SEL21(base)      (XBAR_SEL21_REG(base))
#define XBAR_WR_SEL21(base, value) (XBAR_SEL21_REG(base) = (value))
#define XBAR_RMW_SEL21(base, mask, value) (XBAR_WR_SEL21(base, (XBAR_RD_SEL21(base) & ~(mask)) | (value)))
#define XBAR_SET_SEL21(base, value) (BME_OR16(&XBAR_SEL21_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL21(base, value) (BME_AND16(&XBAR_SEL21_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL21(base, value) (BME_XOR16(&XBAR_SEL21_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL21 bitfields
 */

/*!
 * @name Register XBAR_SEL21, field SEL42[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT42
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL21_SEL42 field. */
#define XBAR_RD_SEL21_SEL42(base) ((XBAR_SEL21_REG(base) & XBAR_SEL21_SEL42_MASK) >> XBAR_SEL21_SEL42_SHIFT)
#define XBAR_BRD_SEL21_SEL42(base) (BME_UBFX16(&XBAR_SEL21_REG(base), XBAR_SEL21_SEL42_SHIFT, XBAR_SEL21_SEL42_WIDTH))

/*! @brief Set the SEL42 field to a new value. */
#define XBAR_WR_SEL21_SEL42(base, value) (XBAR_RMW_SEL21(base, XBAR_SEL21_SEL42_MASK, XBAR_SEL21_SEL42(value)))
#define XBAR_BWR_SEL21_SEL42(base, value) (BME_BFI16(&XBAR_SEL21_REG(base), ((uint16_t)(value) << XBAR_SEL21_SEL42_SHIFT), XBAR_SEL21_SEL42_SHIFT, XBAR_SEL21_SEL42_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL21, field SEL43[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT43
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL21_SEL43 field. */
#define XBAR_RD_SEL21_SEL43(base) ((XBAR_SEL21_REG(base) & XBAR_SEL21_SEL43_MASK) >> XBAR_SEL21_SEL43_SHIFT)
#define XBAR_BRD_SEL21_SEL43(base) (BME_UBFX16(&XBAR_SEL21_REG(base), XBAR_SEL21_SEL43_SHIFT, XBAR_SEL21_SEL43_WIDTH))

/*! @brief Set the SEL43 field to a new value. */
#define XBAR_WR_SEL21_SEL43(base, value) (XBAR_RMW_SEL21(base, XBAR_SEL21_SEL43_MASK, XBAR_SEL21_SEL43(value)))
#define XBAR_BWR_SEL21_SEL43(base, value) (BME_BFI16(&XBAR_SEL21_REG(base), ((uint16_t)(value) << XBAR_SEL21_SEL43_SHIFT), XBAR_SEL21_SEL43_SHIFT, XBAR_SEL21_SEL43_WIDTH))
/*@}*/

