RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_extension.h
/*******************************************************************************
 * XBAR_CTRL0 - Crossbar Control Register 0
 ******************************************************************************/

/*!
 * @brief XBAR_CTRL0 - Crossbar Control Register 0 (RW)
 *
 * Reset value: 0x0000U
 *
 * Use this register to configure edge detection, interrupt, and DMA features
 * for the XBAR_OUT0 and XBAR_OUT1 outputs. The XBAR_CTRL registers are organized
 * similarly to the XBAR_SEL registers, with control fields for two XBAR_OUT
 * outputs in each register. In control register 0, the LSBs contain the control
 * fields for XBAR_OUT0, and the MSBs contain the control fields for XBAR_OUT1.
 */
/*!
 * @name Constants and macros for entire XBAR_CTRL0 register
 */
/*@{*/
#define XBAR_RD_CTRL0(base)      (XBAR_CTRL0_REG(base))
#define XBAR_WR_CTRL0(base, value) (XBAR_CTRL0_REG(base) = (value))
#define XBAR_RMW_CTRL0(base, mask, value) (XBAR_WR_CTRL0(base, (XBAR_RD_CTRL0(base) & ~(mask)) | (value)))
#define XBAR_SET_CTRL0(base, value) (BME_OR16(&XBAR_CTRL0_REG(base), (uint16_t)(value)))
#define XBAR_CLR_CTRL0(base, value) (BME_AND16(&XBAR_CTRL0_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_CTRL0(base, value) (BME_XOR16(&XBAR_CTRL0_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_CTRL0 bitfields
 */

/*!
 * @name Register XBAR_CTRL0, field DEN0[0] (RW)
 *
 * This bit enables the DMA function on the corresponding XBAR_OUT0 output. When
 * enabled, DMA_REQ0 presents the value STS0. When disabled, the DMA_REQ0 output
 * remains low. IEN0 and DEN0 should not both be set to 1.
 *
 * Values:
 * - 0b0 - DMA disabled
 * - 0b1 - DMA enabled
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_DEN0 field. */
#define XBAR_RD_CTRL0_DEN0(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_DEN0_MASK) >> XBAR_CTRL0_DEN0_SHIFT)
#define XBAR_BRD_CTRL0_DEN0(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_DEN0_SHIFT, XBAR_CTRL0_DEN0_WIDTH))

/*! @brief Set the DEN0 field to a new value. */
#define XBAR_WR_CTRL0_DEN0(base, value) (XBAR_RMW_CTRL0(base, (XBAR_CTRL0_DEN0_MASK | XBAR_CTRL0_STS0_MASK | XBAR_CTRL0_STS1_MASK), XBAR_CTRL0_DEN0(value)))
#define XBAR_BWR_CTRL0_DEN0(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_DEN0_SHIFT), XBAR_CTRL0_DEN0_SHIFT, XBAR_CTRL0_DEN0_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_CTRL0, field IEN0[1] (RW)
 *
 * This bit enables the interrupt function on the corresponding XBAR_OUT0
 * output. When the interrupt is enabled, the output INT_REQ0 reflects the value STS0.
 * When the interrupt is disabled, INT_REQ0 remains low. The interrupt request is
 * cleared by writing a 1 to STS0. IEN0 and DEN0 should not both be set to 1.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_IEN0 field. */
#define XBAR_RD_CTRL0_IEN0(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_IEN0_MASK) >> XBAR_CTRL0_IEN0_SHIFT)
#define XBAR_BRD_CTRL0_IEN0(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_IEN0_SHIFT, XBAR_CTRL0_IEN0_WIDTH))

/*! @brief Set the IEN0 field to a new value. */
#define XBAR_WR_CTRL0_IEN0(base, value) (XBAR_RMW_CTRL0(base, (XBAR_CTRL0_IEN0_MASK | XBAR_CTRL0_STS0_MASK | XBAR_CTRL0_STS1_MASK), XBAR_CTRL0_IEN0(value)))
#define XBAR_BWR_CTRL0_IEN0(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_IEN0_SHIFT), XBAR_CTRL0_IEN0_SHIFT, XBAR_CTRL0_IEN0_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_CTRL0, field EDGE0[3:2] (RW)
 *
 * This field selects which edges on XBAR_OUT0 cause STS0 to assert.
 *
 * Values:
 * - 0b00 - STS0 never asserts
 * - 0b01 - STS0 asserts on rising edges of XBAR_OUT0
 * - 0b10 - STS0 asserts on falling edges of XBAR_OUT0
 * - 0b11 - STS0 asserts on rising and falling edges of XBAR_OUT0
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_EDGE0 field. */
#define XBAR_RD_CTRL0_EDGE0(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_EDGE0_MASK) >> XBAR_CTRL0_EDGE0_SHIFT)
#define XBAR_BRD_CTRL0_EDGE0(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_EDGE0_SHIFT, XBAR_CTRL0_EDGE0_WIDTH))

/*! @brief Set the EDGE0 field to a new value. */
#define XBAR_WR_CTRL0_EDGE0(base, value) (XBAR_RMW_CTRL0(base, (XBAR_CTRL0_EDGE0_MASK | XBAR_CTRL0_STS0_MASK | XBAR_CTRL0_STS1_MASK), XBAR_CTRL0_EDGE0(value)))
#define XBAR_BWR_CTRL0_EDGE0(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_EDGE0_SHIFT), XBAR_CTRL0_EDGE0_SHIFT, XBAR_CTRL0_EDGE0_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_CTRL0, field STS0[4] (W1C)
 *
 * This bit reflects the results of edge detection for XBAR_OUT0. This field is
 * set to 1 when an edge consistent with the current setting of EDGE0 is detected
 * on XBAR_OUT0. This field is cleared by writing 1 to it or by a DMA_ACK0
 * reception when DEN0 is set. Writing 0 to the field has no effect. When interrupt or
 * DMA functionality is enabled for XBAR_OUT0, this field is 1 when the
 * interrupt or DMA request is asserted and 0 when the interrupt or DMA request has been
 * cleared.
 *
 * Values:
 * - 0b0 - Active edge not yet detected on XBAR_OUT0
 * - 0b1 - Active edge detected on XBAR_OUT0
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_STS0 field. */
#define XBAR_RD_CTRL0_STS0(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_STS0_MASK) >> XBAR_CTRL0_STS0_SHIFT)
#define XBAR_BRD_CTRL0_STS0(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_STS0_SHIFT, XBAR_CTRL0_STS0_WIDTH))

/*! @brief Set the STS0 field to a new value. */
#define XBAR_WR_CTRL0_STS0(base, value) (XBAR_RMW_CTRL0(base, (XBAR_CTRL0_STS0_MASK | XBAR_CTRL0_STS1_MASK), XBAR_CTRL0_STS0(value)))
#define XBAR_BWR_CTRL0_STS0(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_STS0_SHIFT), XBAR_CTRL0_STS0_SHIFT, XBAR_CTRL0_STS0_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_CTRL0, field DEN1[8] (RW)
 *
 * This bit enables the DMA function on the corresponding XBAR_OUT1 output. When
 * enabled, DMA_REQ1 presents the value STS1. When disabled, the DMA_REQ1 output
 * remains low. IEN1 and DEN1 should not both be set to 1.
 *
 * Values:
 * - 0b0 - DMA disabled
 * - 0b1 - DMA enabled
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_DEN1 field. */
#define XBAR_RD_CTRL0_DEN1(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_DEN1_MASK) >> XBAR_CTRL0_DEN1_SHIFT)
#define XBAR_BRD_CTRL0_DEN1(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_DEN1_SHIFT, XBAR_CTRL0_DEN1_WIDTH))

/*! @brief Set the DEN1 field to a new value. */
#define XBAR_WR_CTRL0_DEN1(base, value) (XBAR_RMW_CTRL0(base, (XBAR_CTRL0_DEN1_MASK | XBAR_CTRL0_STS0_MASK | XBAR_CTRL0_STS1_MASK), XBAR_CTRL0_DEN1(value)))
#define XBAR_BWR_CTRL0_DEN1(base, value) (BME_BFI16(&XBAR_CTRL0_REG(base), ((uint16_t)(value) << XBAR_CTRL0_DEN1_SHIFT), XBAR_CTRL0_DEN1_SHIFT, XBAR_CTRL0_DEN1_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_CTRL0, field IEN1[9] (RW)
 *
 * This bit enables the interrupt function on the corresponding XBAR_OUT1
 * output. When the interrupt is enabled, the output INT_REQ1 reflects the value STS1.
 * When the interrupt is disabled, INT_REQ1 remains low. The interrupt request is
 * cleared by writing a 1 to STS1. IEN1 and DEN1 should not both be set to 1.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the XBAR_CTRL0_IEN1 field. */
#define XBAR_RD_CTRL0_IEN1(base) ((XBAR_CTRL0_REG(base) & XBAR_CTRL0_IEN1_MASK) >> XBAR_CTRL0_IEN1_SHIFT)
#define XBAR_BRD_CTRL0_IEN1(base) (BME_UBFX16(&XBAR_CTRL0_REG(base), XBAR_CTRL0_IEN1_SHIFT, XBAR_CTRL0_IEN1_WIDTH))

